{
    "status": "Fix Released", 
    "last_updated": "2011-09-22 13:26:15.513675+00:00", 
    "description": "BAD!", 
    "tags": [], 
    "importance": "Critical", 
    "heat": 8, 
    "link": "https://bugs.launchpad.net/nova/+bug/803186", 
    "owner": "https://api.launchpad.net/1.0/~jk0", 
    "id": 803186, 
    "index": 20, 
    "openned": "2011-06-28 22:13:20.393110+00:00", 
    "created": "2011-06-28 22:13:20.393110+00:00", 
    "title": "possible_topdir removed from nova-api", 
    "comments": [
        {
            "content": "BAD!", 
            "date_created": "2011-06-28 22:13:20.393110+00:00", 
            "author": "https://api.launchpad.net/1.0/~jk0"
        }, 
        {
            "content": "Please help me understand how nova-api is being run so that you are unable to perform the same tasks as prior to my intentional removal of this piece of code. \n\nAlso, \"BAD!\" as a bug description really doesn't help me understand what is going on here. I've worked with a number of python projects and none of them have needed this to work.\n\nThanks!", 
            "date_created": "2011-06-29 00:11:00.171074+00:00", 
            "author": "https://api.launchpad.net/1.0/~blamar"
        }, 
        {
            "content": "This bug was more or less just a quick placeholder to link the branch for fast merging. We had already figured out the solution by this point.\n\nThe problem was nova-api was unable to import nova.services when attempting to start outside of the development branch (preventing nova-api from running entirely). If you were to install the package using setup.py (or any other real package) this would have gone unnoticed, since the modules would be in the python path.", 
            "date_created": "2011-06-29 00:27:34.070016+00:00", 
            "author": "https://api.launchpad.net/1.0/~jk0"
        }, 
        {
            "content": "Hey Josh,\n\nnova-api being unable to import nova.services is the expected outcome of standard Python. Can you explain (or help me understand, because really that's all I want) how \"setup.py develop\" doesn't apply here? I don't understand why we even have a setup.py if we're not going to use it and bypass it's functionality with hacking the sys.path.", 
            "date_created": "2011-06-29 01:19:47.347219+00:00", 
            "author": "https://api.launchpad.net/1.0/~blamar"
        }, 
        {
            "content": "For those curious, setup.py/distutils provides the \"develop\" command which allows for installation of python projects into local/user-specific/project-specific site-packages directories. For example, on most Linux distributions it's as easy as:\n\n$ python setup.py develop --user\n\nThis will install Nova in to /home/<user>/.local/lib/python2.x/site-packages. From there on out you'll be able to run bin/nova-api with the sys.path modifications removed.\n\nFor those without the \"--user\" flag (OSX and maybe older version of Python?), the documented way to use setup.py for development is to create a distutils.cfg file as described here: http://docs.python.org/install/index.html#location-and-names-of-config-files, then run:\n\n$ python setup.py develop\n\n...in the desired branch.\n\nIf your distutils.cfg file looks like this:\n\n[develop]\nprefix=/home/<user>/.local\n\nthen you'll get the same results.\n\nI can't be the only one that things modifications to sys.path are sub-optimal, but I do have the bias of being rooted in my ways :)", 
            "date_created": "2011-06-29 01:32:55.660781+00:00", 
            "author": "https://api.launchpad.net/1.0/~blamar"
        }, 
        {
            "content": "Personally I don't want to have to run setup.py develop every time I edit some code and want to run it.  If we really want to remove this functionality it should be discussed and done for all services simultaneously, because there is the expectation on the part of many devs (and scripts like nova.sh) that the code can be run directly from a source checkout/tarball\n\nVish\n\nOn Jun 28, 2011, at 6:32 PM, Brian Lamar wrote:\n\n> For those curious, setup.py/distutils provides the \"develop\" command\n> which allows for installation of python projects into local/user-\n> specific/project-specific site-packages directories. For example, on\n> most Linux distributions it's as easy as:\n> \n> $ python setup.py develop --user\n> \n> This will install Nova in to /home/<user>/.local/lib/python2.x/site-\n> packages. From there on out you'll be able to run bin/nova-api with the\n> sys.path modifications removed.\n> \n> For those without the \"--user\" flag (OSX and maybe older version of\n> Python?), the documented way to use setup.py for development is to\n> create a distutils.cfg file as described here:\n> http://docs.python.org/install/index.html#location-and-names-of-config-\n> files, then run:\n> \n> $ python setup.py develop\n> \n> ...in the desired branch.\n> \n> If your distutils.cfg file looks like this:\n> \n> [develop]\n> prefix=/home/<user>/.local\n> \n> then you'll get the same results.\n> \n> I can't be the only one that things modifications to sys.path are sub-\n> optimal, but I do have the bias of being rooted in my ways :)\n> \n> -- \n> You received this bug notification because you are a member of Nova Bug\n> Team, which is subscribed to OpenStack Compute (nova).\n> https://bugs.launchpad.net/bugs/803186\n> \n> Title:\n>  possible_topdir removed from nova-api\n> \n> Status in OpenStack Compute (Nova):\n>  Fix Committed\n> \n> Bug description:\n>  BAD!\n> \n> To manage notifications about this bug go to:\n> https://bugs.launchpad.net/nova/+bug/803186/+subscriptions\n\n", 
            "date_created": "2011-06-29 05:49:28+00:00", 
            "author": "https://api.launchpad.net/1.0/~vishvananda"
        }, 
        {
            "content": "Ok, sounds like I'm in the extreme minority here, but I'll just say that you don't have to run \"setup.py develop\" every time you edit code. You'll only need to run it when you switch branches.\n\nRun setup.py develop and that will be your primary Nova python package until you run 'develop' elsewhere. \n\nTo have this code in production is dangerous and unecessary in my opinion. Why risk running a different version of Nova than the one installed in production?\n\n$ export PYTHONPATH=.\n\nThis does the exact same thing without any setup.py magic or code editing.", 
            "date_created": "2011-06-29 13:26:06.242031+00:00", 
            "author": "https://api.launchpad.net/1.0/~blamar"
        }, 
        {
            "content": "I'm in the same boat as Vish when it comes to my dev env preferences. That's not to say using setup.py doesn't have its uses (in fact, I would like to give it a try). However removing that chunk of code caused a major regression (especially since it was only removed from API and not Compute, Network, Scheduler, etc). Personally I'm not opposed to having it removed, I just think it warrants a ML discussion to make sure we're covering all our bases.", 
            "date_created": "2011-06-29 15:03:21.488275+00:00", 
            "author": "https://api.launchpad.net/1.0/~jk0"
        }, 
        {
            "content": "On Wed, Jun 29, 2011 at 8:26 AM, Brian Lamar <email address hidden> wrote:\n> Ok, sounds like I'm in the extreme minority here, but I'll just say that\n> you don't have to run \"setup.py develop\" every time you edit code.\n> You'll only need to run it when you switch branches.\n\nYou're not the only one. It annoys the crap out of me to have all the\n\"possible topdir\" stuff all over the bins (and in Keystone, all over\nvarious random modules in the codebase).\n\nI know of not a single other Python library or project that does this.\n\n> Run setup.py develop and that will be your primary Nova python package\n> until you run 'develop' elsewhere.\n>\n> To have this code in production is dangerous and unecessary in my\n> opinion. Why risk running a different version of Nova than the one\n> installed in production?\n>\n> $ export PYTHONPATH=.\n>\n> This does the exact same thing without any setup.py magic or code\n> editing.\n\n++\n\n-jay\n", 
            "date_created": "2011-06-29 18:09:25+00:00", 
            "author": "https://api.launchpad.net/1.0/~jaypipes"
        }, 
        {
            "content": "Before this discussion is lost due to the bug being now closed, maybe we should create a new bug to track the opportunity of getting rid of possible_topdir stuff, or start a ML thread to see where the consensus lies ?", 
            "date_created": "2011-06-30 12:06:39.766955+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "On Thu, Jun 30, 2011 at 7:06 AM, Thierry Carrez <email address hidden> wrote:\n> Before this discussion is lost due to the bug being now closed, maybe we\n> should create a new bug to track the opportunity of getting rid of\n> possible_topdir stuff, or start a ML thread to see where the consensus\n> lies ?\n\nWe can do that (ML discussion). It's pretty low priority, though...\n\nBrian, you want to draft an email to the ML? I'll back you up?\n\n-jay\n", 
            "date_created": "2011-06-30 14:00:26+00:00", 
            "author": "https://api.launchpad.net/1.0/~jaypipes"
        }
    ], 
    "closed": "2011-09-22 13:26:14.316873+00:00"
}