{
    "status": "Opinion", 
    "last_updated": "2015-03-30 13:31:15.040410+00:00", 
    "description": "We get the following error from XenAPI when trying to do \"VBD.plug\" on a volume on a system without PV tools:\nVM_MISSING_PV_DRIVERS\n\nReally we need a way for these users to find out about this issue, and be able to attach the volume somehow.", 
    "tags": [
        "xenserver"
    ], 
    "importance": "Wishlist", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1199475", 
    "owner": "None", 
    "id": 1199475, 
    "index": 2650, 
    "openned": "2013-07-09 18:09:51.089184+00:00", 
    "created": "2013-07-09 18:09:51.089184+00:00", 
    "title": "xenapi: bad error when trying to attach a volume to a non-pv guest", 
    "comments": [
        {
            "content": "We get the following error from XenAPI when trying to do \"VBD.plug\" on a volume on a system without PV tools:\nVM_MISSING_PV_DRIVERS\n\nReally we need a way for these users to find out about this issue, and be able to attach the volume somehow.", 
            "date_created": "2013-07-09 18:09:51.089184+00:00", 
            "author": "https://api.launchpad.net/1.0/~johngarbutt"
        }, 
        {
            "content": "It's probably better to clarify here - without the PV _drivers_ a hotplug is not possible; the user would have to reboot their instance to attach the volume.\n\nXAPI can only check for the presence of PV _tools_ which report version information etc to XenStore.  Some instances (e.g. HVM Linux, PV Linux without tools installed or with them removed) would be able to hotplug if XAPI permitted the attempt.\n\nPerhaps we want a way for XAPI to try hotplugging on instances that it detects have PV drivers enabled?", 
            "date_created": "2013-07-10 08:24:04.547987+00:00", 
            "author": "https://api.launchpad.net/1.0/~bob-ball"
        }, 
        {
            "content": "Good clarification.\n\nIf XenAPI gets better at deciding when it really will not work or work, that is cool.\n\nThe big issue is there is no way to attach the volume to the VM right now. You could power off, but then connect fails (different bug), and not all providers expose power off anyway.\n\nI am still thinking through the options and which I like, but my current thinking is:\n* at least raise an error back to the user about not having PV tools installed\n\nThen we either have:\n* a force_attach, where VM is shutdown, volume added, then started\nOR we have:\n* a don't hotplug flag, and the user is free to reboot when they next want the volume", 
            "date_created": "2013-07-10 08:44:36.760696+00:00", 
            "author": "https://api.launchpad.net/1.0/~johngarbutt"
        }, 
        {
            "content": "Probably need the wait for the task API to fix this in a nice way.", 
            "date_created": "2014-03-13 14:04:31.758941+00:00", 
            "author": "https://api.launchpad.net/1.0/~johngarbutt"
        }, 
        {
            "content": "This really isn't addressable in current API, need new APIs to address this.", 
            "date_created": "2015-03-30 13:31:14.325858+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }
    ], 
    "closed": "2015-03-30 13:30:55.837237+00:00"
}