{
    "status": "Won't Fix", 
    "last_updated": "2015-07-31 16:49:05.810829+00:00", 
    "description": "1. Version of Nova:  1:2015.1.0\nThere is no nova.conf.sample in source code at github.com\nAnd there is no detailed documents to tell users(not developers) to generate a full list of nova.conf.sample.\n\nOptions described in deployment guide on docs.openstack.org is very different from the generated nova.conf.sample by the command tox -egenconfig.\n\n2. No logs needed, just check the source code on github.com\n\n3. Reproduce steps.\n    step 1. check the options listed in deployment guide on docs.openstack.org\n    step 2. generate nova.conf.sample as commond listed in https://github.com/openstack/nova/blob/stable/kilo/etc/nova/README-nova.conf.txt\n    step 3. try to find out options listed in deployment guide.\n\nSuggest from a user (not a developer), why not generate a full list of nova.conf.sample like other projects like neutron, glance?", 
    "tags": [
        "config", 
        "documentation"
    ], 
    "importance": "Undecided", 
    "heat": 8, 
    "link": "https://bugs.launchpad.net/nova/+bug/1476912", 
    "owner": "None", 
    "id": 1476912, 
    "index": 6926, 
    "openned": "2015-07-22 03:54:46.797510+00:00", 
    "created": "2015-07-22 03:54:46.797510+00:00", 
    "title": "No nova.conf.sample, and no details procedures to describe how to generate a full list of nova.conf.sample", 
    "comments": [
        {
            "content": "1. Version of Nova:  1:2015.1.0\nThere is no nova.conf.sample in source code at github.com\nAnd there is no detailed documents to tell users(not developers) to generate a full list of nova.conf.sample.\n\nOptions described in deployment guide on docs.openstack.org is very different from the generated nova.conf.sample by the command tox -egenconfig.\n\n2. No logs needed, just check the source code on github.com\n\n3. Reproduce steps.\n    step 1. check the options listed in deployment guide on docs.openstack.org\n    step 2. generate nova.conf.sample as commond listed in https://github.com/openstack/nova/blob/stable/kilo/etc/nova/README-nova.conf.txt\n    step 3. try to find out options listed in deployment guide.\n\nSuggest from a user (not a developer), why not generate a full list of nova.conf.sample like other projects like neutron, glance?", 
            "date_created": "2015-07-22 03:54:46.797510+00:00", 
            "author": "https://api.launchpad.net/1.0/~jack6.liu"
        }, 
        {
            "content": "@frozen.lcl:\n\nFrom a user point of view, which sample files would you expect to be in the suggested list?", 
            "date_created": "2015-07-22 19:47:44.369572+00:00", 
            "author": "https://api.launchpad.net/1.0/~mzoeller"
        }, 
        {
            "content": "A nova.conf.sample with all configuable options. Just like sample conf file provided by glance-api.conf, neuton.conf.\nI dont think a user should git clone source code from github, and run the tox -egenconfig.\nAnd actually even if a user just did such things, he/she will get a full list of nova.conf.sample, at least I didnt find out lock_path option in the sample, and nova-api cannot start with such an option. ", 
            "date_created": "2015-07-24 00:30:11.721624+00:00", 
            "author": "https://api.launchpad.net/1.0/~jack6.liu"
        }, 
        {
            "content": "@jack6.liu (jack6.liu):\n\nAFAIK the \"Configuration Reference\" gets updated for each OpenStack release. For the latest Kilo release it is [1] and for Icehouse it is [2]. These guides should be exhaustive because they extract the config options from the source code. As long as the development cycle is ongoing, the (interim) manual gets irregularly and manually updated at [3]. I would assume that the config options *between* two releases are mainly interesting for developers and less for users/operators. Could you explain your use case in more detail please?\n\n[1] Kilo: http://docs.openstack.org/kilo/config-reference/content/list-of-compute-config-options.html\n[2] Icehouse: http://docs.openstack.org/icehouse/config-reference/content/list-of-compute-config-options.html\n[3] Current: http://docs.openstack.org/kilo/config-reference/content/list-of-compute-config-options.html", 
            "date_created": "2015-07-27 16:50:02.049532+00:00", 
            "author": "https://api.launchpad.net/1.0/~mzoeller"
        }, 
        {
            "content": "http://git.openstack.org/cgit/openstack/nova/tree/etc/nova/README-nova.conf.txt tells you to run tox -e genconfig to generate the sample.\n\nWe removed the sample from the tree back in Icehouse:\n\nhttps://github.com/openstack/nova/commit/918f6eab7c69ca2c698fa6782ecf1a6639a41938\n\nThere is probably an old dev mailing list thread on this somewhere, but basically it came down to the fact that the gate was broken every time a library that fed options into nova.conf.sample (think oslo and keystonemiddleware) would release a new version that changed (add/update/remove) options and nova.conf.sample wouldn't match what was generated, so all nova changes would be blocked from the gate until we got a change up that fixed it - which happened weekly and everyone hated it, so we removed it.  There are other projects that had the same issue and did the same, or are still just living with the constant breakage.", 
            "date_created": "2015-07-29 00:35:21.857815+00:00", 
            "author": "https://api.launchpad.net/1.0/~mriedem"
        }, 
        {
            "content": "The fact is nova.conf.sample generated by runnibg tox -egenconfig is not a full list, it may be less than a half of the full list. Many of the new config options comes with kilo are not generated out even they are documented in the configuration reference guide.\nAs I said, there even no lock_path in the generated nova.conf.sample!\n\nAnd as you mentioned, nova project won't include the generated nova.conf.sample to the github repository all because it always failed the gate tests? So. that means the tox -egenconf will never get the right nova.conf.sample because of it's failed any tests or it is full of bugs itself?\n\nSo, question is how can we get a full list of nova.conf.sample rather than manually input them according to the reference guide? Is there any way?\n\nAnd another question is that if there are other projects(cinder as I know) face the same problem, why you not solve this problem together, just let it stays as a blocker issue for such a long time, as you mentioned since icehouse version!!\n\nSorry for this raising this bug, if all you guys dont think this is a problem. BUT, I just cannot understand. ", 
            "date_created": "2015-07-31 16:49:04.630349+00:00", 
            "author": "https://api.launchpad.net/1.0/~jack6.liu"
        }
    ], 
    "closed": "2015-07-29 00:32:00.012325+00:00"
}