{
    "status": "Fix Released", 
    "last_updated": "2012-09-10 21:38:36.015992+00:00", 
    "description": "To support high availability of nova-network service, there is a need to send gratuitous ARP or unsolicited ARP from nova-network for following IP addresses.\n\n1) Gateway address of each vlan\n2) Floating IPs\n\nThe reason to do this is obvious when master dies, the backup server will take over and because the mac address of the vlan/public interface of backup server is different from master any clients connected to the VM instances will be dropped out. The clients will still try to send the request to the master server since the ARP cache is not yet updated. To avoid this it is important to send gratuitous ARPs from the backup server which will cause routers and other hardware to update ARP cache.\n\nAny service provider can choose OSS like heartbeat, keepalived or so on to detect failover and take action of starting nova-network service on the backup server in case of active-passive mode. It is also possible to send the gratuitous ARPs externally without modifying the nova-network source code but design wise I feel it is more appropriate to do this in nova-network service.\n\nI am thinking of introducing one more flag for example send_arps which should be set to True to send gratuitous ARP in highly availability environment. If this flag is set to False, no gratuitous ARP will be sent.\n\nThis is a very small change in the nova-network source code so I thought of posting it as a bug rather than creating a blueprint for such a small change.", 
    "tags": [], 
    "importance": "Wishlist", 
    "heat": 18, 
    "link": "https://bugs.launchpad.net/nova/+bug/782364", 
    "owner": "https://api.launchpad.net/1.0/~tpatil", 
    "id": 782364, 
    "index": 2322, 
    "openned": "2011-05-13 19:32:41.608918+00:00", 
    "created": "2011-05-13 19:32:41.608918+00:00", 
    "title": "better to send gratuitous ARPs to support HA", 
    "comments": [
        {
            "content": "To support high availability of nova-network service, there is a need to send gratuitous ARP or unsolicited ARP from nova-network for following IP addresses.\n\n1) Gateway address of each vlan\n2) Floating IPs\n\nThe reason to do this is obvious when master dies, the backup server will take over and because the mac address of the vlan/public interface of backup server is different from master any clients connected to the VM instances will be dropped out. The clients will still try to send the request to the master server since the ARP cache is not yet updated. To avoid this it is important to send gratuitous ARPs from the backup server which will cause routers and other hardware to update ARP cache.\n\nAny service provider can choose OSS like heartbeat, keepalived or so on to detect failover and take action of starting nova-network service on the backup server in case of active-passive mode. It is also possible to send the gratuitous ARPs externally without modifying the nova-network source code but design wise I feel it is more appropriate to do this in nova-network service.\n\nI am thinking of introducing one more flag for example send_arps which should be set to True to send gratuitous ARP in highly availability environment. If this flag is set to False, no gratuitous ARP will be sent.\n\nThis is a very small change in the nova-network source code so I thought of posting it as a bug rather than creating a blueprint for such a small change.", 
            "date_created": "2011-05-13 19:32:41.608918+00:00", 
            "author": "https://api.launchpad.net/1.0/~tpatil"
        }, 
        {
            "content": "I'd also love to see this feature added.\n", 
            "date_created": "2011-06-14 05:50:09.354729+00:00", 
            "author": "https://api.launchpad.net/1.0/~devcamcar"
        }, 
        {
            "content": "I think I might be missing some context, because I'm not seeing a compelling reason why this should be apart of nova-network, rather than managed entirely by external software such as heartbeat.\n\nIn the case of an active/passive nova cluster, in the event of the active host failing the passive host will need to do the following:\n\n  - Bring up a network interface for the IP address that the active host used to respond on\n    - It is possible that this interface is already active and configured to not ARP\n  - Send a gratuitous ARP on the new interface so the new mac address/switch port gets registered across the network\n  - Start up nova-network on the passive host, ready to continue work of active via some shared resource or synchronization\n\nCurrently, Nova cannot do any of these things, so even if gratuitous ARP support is added, Nova is still dependent upon third party HA software to manage bringing up the interface and turning on nova-network, so why not let the third-party manage the nics and ARPs?\n\nThe only way adding this makes sense to me is if there is a long term goal to add full HA services to nova such that no third-party HA software is necessary.  I didn't see any blueprint that talks about full HA services in launchpad.", 
            "date_created": "2011-06-21 01:05:12.835693+00:00", 
            "author": "https://api.launchpad.net/1.0/~markgius"
        }, 
        {
            "content": "Context has been delivered to me.  I hadn't realized that nova-network in some cases serves as a gateway for instances, which are endpoints not likely to be visible easily to heartbeat or keepalived, etc.  It also sounds like nova-network as it currently exists is deprecated and is going to be split up in such a way as to render this ARPing nonsense unnecessary.\n\nTL;DR: I see the reason to add this while waiting for nova-network to be split out and discarded a la https://blueprints.launchpad.net/nova/+spec/ha-flatdhcp and https://blueprints.launchpad.net/nova/+spec/making-nova-components-ha", 
            "date_created": "2011-06-21 20:01:31.147166+00:00", 
            "author": "https://api.launchpad.net/1.0/~markgius"
        }, 
        {
            "content": "Mark, Your understanding is correct. \nI am going to discuss about this bug again within our team and see if it's worth adding this changes now and discard it later on after nova-network is split out.\n\n", 
            "date_created": "2011-06-21 20:34:02.681449+00:00", 
            "author": "https://api.launchpad.net/1.0/~tpatil"
        }, 
        {
            "content": "Added patch fix for those who wants to test nova-network with HA.\n\nYou will need to install iputils-arping package on compute and network nodes.\n\nNova Configuration changes:-\n--send_arp_for_ha = True # By default it is set to False", 
            "date_created": "2011-06-24 21:34:06.711858+00:00", 
            "author": "https://api.launchpad.net/1.0/~tpatil"
        }, 
        {
            "content": "Why is the iputils-arping package needed on compute nodes? Wouldn't it just be needed on the nova-network nodes (to send a GARP when switching between physical hosts)?", 
            "date_created": "2012-09-10 21:38:35.253513+00:00", 
            "author": "https://api.launchpad.net/1.0/~stephen-c1ud"
        }
    ], 
    "closed": "2011-09-22 12:52:55.185021+00:00"
}