{
    "status": "Opinion", 
    "last_updated": "2017-04-28 17:52:31.744219+00:00", 
    "description": "Issue:\nWhen service provider wants to use only boot from volume option for booting a server then the integration tests fails. No option in Tempest to use only boot from volume for booting the server.\n\nExpected :\n\na parameter in Tempest.conf for option of boot_from_volume_only for all the tests except for image tests.\n\n\n$ nova boot --flavor FLAVOR_ID [--image IMAGE_ID] / [ --boot-volume BOOTABLE_VOLUME]", 
    "tags": [
        "volumes"
    ], 
    "importance": "Wishlist", 
    "heat": 20, 
    "link": "https://bugs.launchpad.net/nova/+bug/1436314", 
    "owner": "None", 
    "id": 1436314, 
    "index": 2941, 
    "openned": "2015-04-03 03:15:03.245149+00:00", 
    "created": "2015-03-25 12:49:16.938938+00:00", 
    "title": "Option to boot VM only from volume is not available", 
    "comments": [
        {
            "content": "Issue:\nWhen service provider wants to use only boot from volume option for booting a server then the integration tests fails. No option in Tempest to use only boot from volume for booting the server.\n\nExpected :\n\na parameter in Tempest.conf for option of boot_from_volume_only for all the tests except for image tests.\n\n\n$ nova boot --flavor FLAVOR_ID [--image IMAGE_ID] / [ --boot-volume BOOTABLE_VOLUME]", 
            "date_created": "2015-03-25 12:49:16.938938+00:00", 
            "author": "https://api.launchpad.net/1.0/~soumit-mishra"
        }, 
        {
            "content": "Providing boot only from volume option in tempest will help service provider if they have cloud provision using only bootable volumes.\n\n ", 
            "date_created": "2015-03-25 12:58:34.726677+00:00", 
            "author": "https://api.launchpad.net/1.0/~dwivedihimanshu"
        }, 
        {
            "content": "we need to add this , it will help ", 
            "date_created": "2015-03-27 04:13:29.731272+00:00", 
            "author": "https://api.launchpad.net/1.0/~vivek-b-sharma"
        }, 
        {
            "content": "So in case nova is configured to only boot from volume (conf option \"max_local_block_device\" to 0), tempest tests will fail.\n\nI think we need more discussion in team to provide such options. I will discuss this on weekly meeting or IRC.", 
            "date_created": "2015-03-30 07:26:07.485098+00:00", 
            "author": "https://api.launchpad.net/1.0/~ghanshyammann"
        }, 
        {
            "content": "Adding Nova on this.\n\nNova team can better provide how feasible this option is and what are the use cases of this options. Based on that tempest can take decision to support that.", 
            "date_created": "2015-04-03 03:10:59.964780+00:00", 
            "author": "https://api.launchpad.net/1.0/~ghanshyammann"
        }, 
        {
            "content": "@Soumit\n\nI tried on my local env by setting 'max_local_block_devices' to 0 in nova.conf and gets below error in Tempest. \n\nERROR (BadRequest): Block Device Mapping is Invalid: You specified more local devices than the limit allows (HTTP 400) (Request-ID: req-3ef100c7-b5c5-4a2d-a5da-8344726336e2)\n\nCan you please let us know is that all setting you do for making nova boot from volume only. Also provide more information about its use cases etc.", 
            "date_created": "2015-04-03 03:14:38.785280+00:00", 
            "author": "https://api.launchpad.net/1.0/~ghanshyammann"
        }, 
        {
            "content": "It is enough to specify --boot-volume option, (see https://wiki.openstack.org/wiki/BlockDeviceConfig for more details about the block device mapping syntax).\n\nSetting max_local_block_devices to 0 means that any request that attempts to create a local disk will fail. This option is meant to limit the number of local discs (so root local disc that is the result of --image being used, and any other ephemeral and swap disks).\n\nAFAIK Tempest by it's very nature will test both booting instances from volumes and from images downloaded to hypervisor local storage, so it makes very little sense to me to attempt to limit the environment tempest runs against to allow only boot from volume and then expect to be able to run tests that spawn instances from images.\n\n max_local_block_devices set to 0 does not mean that nova will automatically convert --images to volumes and boot instances from volumes - it just means that all request that attempt to create a local disk will fail.", 
            "date_created": "2015-04-03 11:27:26.792479+00:00", 
            "author": "https://api.launchpad.net/1.0/~ndipanov"
        }, 
        {
            "content": "As a service provider who decides to use only expose boot from volume option,in such a scenario all the tempest test fails as we don't have an option in Tempest to only use boot from volume option. Thus the integration test suite beats its sole purpose to enable service provider to verify the upstream changes continuously.\n\nThe use cases is a very practical problem that arises when the service provider limits only to boot from volume due to the below advantages : -  even if the server gets deleted the data can be retained and can be used as an image to create a new server ; upgrading the server is also very easy if we have a boot-able volume; also the storage needs can be easily defined due to the control of the volume size and type.\nI understand in Nova there isn't any option to just enable boot from volume and disable boot from image, but we should not force any service provider to use the option to use from image also just for testing purpose.\nWe should consider to provide an option in Tempest as it will fulfill it's basic purpose of integration testing in all openstack environment. ", 
            "date_created": "2015-04-03 12:09:24.808766+00:00", 
            "author": "https://api.launchpad.net/1.0/~soumit-mishra"
        }, 
        {
            "content": "Out of curiosity, how do you configure nova to only expose boot from volume?\n\n\nNot sure if this is directly related or not, but we don't test boot from volume very well in tempest, and it would be interesting to try running the existing boot from image tests with volume backed instances.", 
            "date_created": "2015-04-03 17:07:22.843368+00:00", 
            "author": "https://api.launchpad.net/1.0/~jogo"
        }, 
        {
            "content": "Right - if there is a case for making nova disallow boot from image (that is stored on a local drive) than max_local_block_devices is little crude as setting it to 0, as it will disallow swap drives too.\n\nLooking at the code - setting root_gb to 0 in the flavor seems like it would do what you want actually - have you tried that?", 
            "date_created": "2015-04-03 17:16:58.569316+00:00", 
            "author": "https://api.launchpad.net/1.0/~ndipanov"
        }, 
        {
            "content": "Hmmm actually it won't:\n\n        # NOTE(johannes): root_gb is allowed to be 0 for legacy reasons\n        # since libvirt interpreted the value differently than other\n        # drivers. A value of 0 means don't check size.\n        root_gb = instance_type['root_gb']\n        if root_gb:\n            if int(image.get('size') or 0) > root_gb * (1024 ** 3):\n                raise exception.FlavorDiskTooSmall()\n\n            if int(image.get('min_disk') or 0) > root_gb:\n                    raise exception.FlavorDiskTooSmall()\n\nIt seems like flavor is still the natural place to have this (as opposed to a global disable.", 
            "date_created": "2015-04-03 17:23:30.872233+00:00", 
            "author": "https://api.launchpad.net/1.0/~ndipanov"
        }, 
        {
            "content": "We should at least update the help text for max_local_block_devices because someone was asking about an option to enforce only booting instances from volumes and we found that option in the docs with text:\n\n\"(IntOpt) Maximum number of devices that will result in a local image being created on the hypervisor node. Setting this to 0 means nova will allow only boot from volume. A negative number means unlimited.\"\n\nThe text \"Setting this to 0 means nova will allow only boot from volume.\" is misleading - you can still boot an instance from an image, the option really just limits the number of local volumes you can boot from.", 
            "date_created": "2015-09-04 01:10:45.719539+00:00", 
            "author": "https://api.launchpad.net/1.0/~mriedem"
        }, 
        {
            "content": "Related fix proposed to branch: master\nReview: https://review.openstack.org/220375", 
            "date_created": "2015-09-04 01:46:03.428636+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Reviewed:  https://review.openstack.org/220375\nCommitted: https://git.openstack.org/cgit/openstack/nova/commit/?id=6ef48140999e6fe2d23e6e0c61dfdd41e07359e9\nSubmitter: Jenkins\nBranch:    master\n\ncommit 6ef48140999e6fe2d23e6e0c61dfdd41e07359e9\nAuthor: Matt Riedemann <email address hidden>\nDate:   Thu Sep 3 18:45:08 2015 -0700\n\n    Clarify max_local_block_devices config option usage\n    \n    The previous wording for the max_local_block_devices config option made\n    it sound like if you set it to 0 that you could restrict to only booting\n    instances from volumes, which is not the case - but is apparently\n    something that some operators want (this came up in the related bug and\n    in IRC).\n    \n    This updates the help text with a description that ndipanov put in the\n    bug report which makes the 0 case more clear.\n    \n    Co-Authored-By: Nikola Dipanov <email address hidden>\n    \n    Related-Bug: #1436314\n    \n    Change-Id: I01a9e2f193b50285966690efd771da432a7ad40c\n", 
            "date_created": "2015-09-17 21:00:58.129414+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "This wishlist bug has been open a year without any activity. I'm going to move it to \"Opinion / Wishlist\", which is an easily-obtainable queue of older requests that have come on. \n\nIn case you want to work on that, consider writing a blueprints [1] and spec [2]. I'll recommend to read [3] if not yet done. The effort to implement the requested feature is then driven only by the blueprint (and spec).\n\nReferences:\n[1] https://blueprints.launchpad.net/nova/\n[2] https://github.com/openstack/nova-specs\n[3] https://wiki.openstack.org/wiki/Blueprints", 
            "date_created": "2016-05-17 17:30:53.142119+00:00", 
            "author": "https://api.launchpad.net/1.0/~mzoeller"
        }, 
        {
            "content": "There are not any activity on Tempest side in long-term, and we could not get enough feedback for Nova team questions. It would be nice to drop this bug report from Tempest queue.", 
            "date_created": "2017-04-28 17:52:30.746541+00:00", 
            "author": "https://api.launchpad.net/1.0/~oomichi"
        }
    ], 
    "closed": "2016-05-17 17:30:44.160039+00:00"
}