{
    "status": "Expired", 
    "last_updated": "2016-04-29 21:33:10.584490+00:00", 
    "description": "If  an instance is created only in the public network(though not a meaningful or valid operation for the end user, but meaningful for the test purpose ),  it will incorrectly be counted towards with the router quota, making the user running out of router quota.", 
    "tags": [], 
    "importance": "Undecided", 
    "heat": 10, 
    "link": "https://bugs.launchpad.net/nova/+bug/1531344", 
    "owner": "None", 
    "id": 1531344, 
    "index": 7213, 
    "openned": "2016-01-05 23:59:23.203718+00:00", 
    "created": "2016-01-05 23:59:23.203718+00:00", 
    "title": "VMs with public interface will be incorrectly counted toward the router limits", 
    "comments": [
        {
            "content": "If  an instance is created only in the public network(though not a meaningful or valid operation for the end user, but meaningful for the test purpose ),  it will incorrectly be counted towards with the router quota, making the user running out of router quota.", 
            "date_created": "2016-01-05 23:59:23.203718+00:00", 
            "author": "https://api.launchpad.net/1.0/~felicia-fei-1024"
        }, 
        {
            "content": "Please provide detailed steps to reproduce and which version of Openstack/nova you are using. In addition, please provide any logs or command output that illustrate the problem.", 
            "date_created": "2016-01-27 13:28:55.674171+00:00", 
            "author": "https://api.launchpad.net/1.0/~auggy"
        }, 
        {
            "content": "Also looks like this could be a duplicate of this issue, but without more details I'm not certain - https://bugs.launchpad.net/nova/+bug/1296414", 
            "date_created": "2016-01-27 13:35:33.893519+00:00", 
            "author": "https://api.launchpad.net/1.0/~auggy"
        }, 
        {
            "content": "1. Find a lab environment. In this example, the lab has a \"/28\" public network. (picture 1)\n\n2. Launch 10 instances in the public network. (picture 2)\nThough launching instances in public network is not a recommend behavior and is not valid, it is used in this bug description example to demonstrate how instances spawned in public network are incorrectly counted towards the router quota.\n\n3. Verify your router quota, which is \"10\" in this case. (picture 3)\n\n4. Create private networks and create routers to connect each of the private network with the public network. but you can not create as many as your quota limit. (picture 4) \n\n5. When you create the 4th router, there will be an error message from horizon \"Error: Quota exceeded for resource router\". (picture 5)\n\nIn this example, your router quota limit is 10, but you can create only 3 routers. The public net work is a \"/28\" network. So, it looks like instances spawned in public network is incorrectly counting towards the quota of the routers.\n", 
            "date_created": "2016-02-10 22:07:11.322112+00:00", 
            "author": "https://api.launchpad.net/1.0/~felicia-fei-1024"
        }, 
        {
            "content": "[Expired for OpenStack Compute (nova) because there has been no activity for 60 days.]", 
            "date_created": "2016-04-11 04:17:49.241932+00:00", 
            "author": "https://api.launchpad.net/1.0/~janitor"
        }, 
        {
            "content": "Is the intention for this ticket to rot?  Personally, I'd prefer not to see a ticket expire and be stuck in an undecided state.  Can it be given either a proper burial or resurrected?   ", 
            "date_created": "2016-04-29 21:33:10.122117+00:00", 
            "author": "https://api.launchpad.net/1.0/~pugh-jeremy"
        }
    ], 
    "closed": "2016-04-11 04:17:49.907021+00:00"
}