{
    "status": "Incomplete", 
    "last_updated": "2017-06-28 12:45:45.373209+00:00", 
    "description": "Reported by Benjamin Deuter of SUSE:\n\nSome rootwrap filters are too permissive and allow privilege escalation from service user, as explained here:\n\nhttps://security.openstack.org/guidelines/dg_use-oslo-rootwrap-securely.html#incorrect\n\nFor example this shouldn't be authorized:\n\nsudo nova-rootwrap /etc/nova/rootwrap.conf chmod 777 /etc/shadow", 
    "tags": [
        "security"
    ], 
    "importance": "Undecided", 
    "heat": 14, 
    "link": "https://bugs.launchpad.net/nova/+bug/1700501", 
    "owner": "None", 
    "id": 1700501, 
    "index": 8186, 
    "openned": "2017-06-26 10:46:40.624883+00:00", 
    "created": "2017-06-26 10:46:40.624883+00:00", 
    "title": "Insecure rootwrap usage", 
    "comments": [
        {
            "content": "Reported by Benjamin Deuter of SUSE:\n\nSome rootwrap filters are too permissive and allow privilege escalation from service user, as explained here:\n\nhttps://security.openstack.org/guidelines/dg_use-oslo-rootwrap-securely.html#incorrect\n\nFor example this shouldn't be authorized:\n\nsudo nova-rootwrap /etc/nova/rootwrap.conf chmod 777 /etc/shadow", 
            "date_created": "2017-06-26 10:46:40.624883+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "Since this report concerns a possible security risk, an incomplete security advisory task has been added while the core security reviewers for the affected project or projects confirm the bug and discuss the scope of any vulnerability along with potential solutions.", 
            "date_created": "2017-06-26 10:49:52.168065+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "Assuming this only affect localhost user and that rootwrap argument can not be set arbitrarily by remote user, I guess this is at best a class B2 or perhaps C1 according to VMT's taxonomy: https://security.openstack.org/vmt-process.html#incident-report-taxonomy\n\nThis also affects quite a few filters, e.g.: mount, tee, chown, dd, cp, chgrp, cat", 
            "date_created": "2017-06-26 11:00:00.175419+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "At a minimum, I think we can continue this in public because it's a known issue. The rootwrap base implementation was an okay idea in theory, but in practice many projects shipped terrible default configurations which bypassed any actual security afforded by the framework. As a result, rootwrap is itself on the path to deprecation with https://docs.openstack.org/developer/oslo.privsep/ as its eventual successor.\n\nI agree this is probably a B2 class report (or maybe B1 if rootwrap replacement with oslo.privsep happens quickly).", 
            "date_created": "2017-06-27 13:48:13.728377+00:00", 
            "author": "https://api.launchpad.net/1.0/~fungi"
        }, 
        {
            "content": "In a private E-mail reply, Benjamin agreed with the suggestion to proceed with this report in public for now. As such, I'm triaging it as class B2 (\"a vulnerability without a complete fix yet, security note for all versions, e.g., poor architecture / design\"). The security note normally suggested by B2 is probably not warranted either given the existing treatment in the security guide, linked from the initial report.", 
            "date_created": "2017-06-27 16:45:42.434660+00:00", 
            "author": "https://api.launchpad.net/1.0/~fungi"
        }, 
        {
            "content": "This is too vague to be actionable. There is one example, and it's not clear where in the system the concern is. And the kinds of changes to make this be as restricted as one would like really don't lead well to a bug, but would require a more systematic push to really embrace something like privsep.\n\nIn general, the use of root wrap on nova-compute is honestly pointless in my pov. Besides chmod, cat, dd and a few others are running more or less unrestricted. It just doesn't make for a useful security model.", 
            "date_created": "2017-06-28 10:33:04.094323+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }, 
        {
            "content": "Well, there is proposed code is up to start moving to privsep, but it's not\na priority right now...\n\nMichael\n\nOn 28 Jun. 2017 8:41 pm, \"Sean Dague\" <email address hidden> wrote:\n\n> This is too vague to be actionable. There is one example, and it's not\n> clear where in the system the concern is. And the kinds of changes to\n> make this be as restricted as one would like really don't lead well to a\n> bug, but would require a more systematic push to really embrace\n> something like privsep.\n>\n> In general, the use of root wrap on nova-compute is honestly pointless\n> in my pov. Besides chmod, cat, dd and a few others are running more or\n> less unrestricted. It just doesn't make for a useful security model.\n>\n> ** Changed in: nova\n>        Status: New => Incomplete\n>\n> --\n> You received this bug notification because you are a member of Nova Core\n> security contacts, which is subscribed to the bug report.\n> https://bugs.launchpad.net/bugs/1700501\n>\n> Title:\n>   Insecure rootwrap usage\n>\n> To manage notifications about this bug go to:\n> https://bugs.launchpad.net/cinder/+bug/1700501/+subscriptions\n>\n", 
            "date_created": "2017-06-28 12:43:21+00:00", 
            "author": "https://api.launchpad.net/1.0/~mikal"
        }
    ]
}