{
    "status": "Opinion", 
    "last_updated": "2017-07-27 16:55:34.904213+00:00", 
    "description": "This issue is being treated as a potential security risk under embargo. Please do not make any public mention of embargoed (private) security vulnerabilities before their coordinated publication by the OpenStack Vulnerability Management Team in the form of an official OpenStack Security Advisory. This includes discussion of the bug or associated fixes in public forums such as mailing lists, code review systems and bug trackers. Please also avoid private disclosure to other individuals not already approved for access to this information, and provide this same reminder to those who are made aware of the issue prior to publication. All discussion should remain confined to this private bug report, and any proposed fixes should be added to the bug as attachments.\n\nOlder versions of libvirt included network storage authentication information on the qemu command line. If libvirt raises an exception which logs the qemu command line it used, for example an error starting a domain, this authentication information will end up in the logs. There is an existing CVE for this issue here:\n\n  https://access.redhat.com/security/cve/CVE-2015-5160\n\nSpecifically, if a deployment is using ceph, a libvirt error starting a domain would log the cephx secret key and the monitor addresses on the qemu command line.\n\nThe issue has been resolved upstream. Users running qemu version 2.6 or later, and libvirt version 2.2 or later, are not vulnerable. No change is required in Nova to resolve this issue.\n\nRed Hat users running RHEL 7.3 or later are not vulnerable.\n\nIt's not 100% clear to me that an OpenStack CVE is required here as it's not a bug in an OpenStack component, and it's already fixed upstream. However, it did come to my attention after a user publicly posted their ceph credentials on IRC, so evidently some OpenStack users are running vulnerable systems, and this is a very common configuration.\n\nIn Nova, we currently have:\n\nMIN_LIBVIRT_VERSION = (1, 2, 9)\nMIN_QEMU_VERSION = (2, 1, 0)\n\nso anybody running the minimum supported versions will be vulnerable.", 
    "tags": [
        "security"
    ], 
    "importance": "Undecided", 
    "heat": 14, 
    "link": "https://bugs.launchpad.net/nova/+bug/1686743", 
    "owner": "None", 
    "id": 1686743, 
    "index": 8089, 
    "openned": "2017-04-27 14:27:47.377794+00:00", 
    "created": "2017-04-27 14:27:47.377794+00:00", 
    "title": "Ceph credentials included in logs using older libvirt/qemu", 
    "comments": [
        {
            "content": "Older versions of libvirt included network storage authentication information on the qemu command line. If libvirt raises an exception which logs the qemu command line it used, for example an error starting a domain, this authentication information will end up in the logs. There is an existing CVE for this issue here:\n\n  https://access.redhat.com/security/cve/CVE-2015-5160\n\nSpecifically, if a deployment is using ceph, a libvirt error starting a domain would log the cephx secret key and the monitor addresses on the qemu command line.\n\nThe issue has been resolved upstream. Users running qemu version 2.6 or later, and libvirt version 2.2 or later, are not vulnerable. No change is required in Nova to resolve this issue.\n\nRed Hat users running RHEL 7.3 or later are not vulnerable.\n\nIt's not 100% clear to me that an OpenStack CVE is required here as it's not a bug in an OpenStack component, and it's already fixed upstream. However, it did come to my attention after a user publicly posted their ceph credentials on IRC, so evidently some OpenStack users are running vulnerable systems, and this is a very common configuration.\n\nIn Nova, we currently have:\n\nMIN_LIBVIRT_VERSION = (1, 2, 9)\nMIN_QEMU_VERSION = (2, 1, 0)\n\nso anybody running the minimum supported versions will be vulnerable.", 
            "date_created": "2017-04-27 14:27:47.377794+00:00", 
            "author": "https://api.launchpad.net/1.0/~mbooth-9"
        }, 
        {
            "content": "Incidentally, Dan Berrangé points out that the libvirt and qemu bugs were never embargoed as the issues had been public knowledge for a long time.", 
            "date_created": "2017-04-27 15:13:58.111895+00:00", 
            "author": "https://api.launchpad.net/1.0/~mbooth-9"
        }, 
        {
            "content": "Public way back to day 1  https://www.redhat.com/archives/libvir-list/2011-November/msg00853.html\n\nand I'm fairly sure they've been discussed on openstack bugs / mailing lists / irc several times before, though I don't recall specific links.", 
            "date_created": "2017-04-27 15:25:32.130792+00:00", 
            "author": "https://api.launchpad.net/1.0/~berrange"
        }, 
        {
            "content": "That all said, the scope of the libvirt / qemu bug was a local user information leak.\n\nIf Nova turns that compute-node local info leak, into a remote user information leak by publicizing the error message somewhere, that could be considered a genuinely new security bug in nova.", 
            "date_created": "2017-04-27 15:26:47.125854+00:00", 
            "author": "https://api.launchpad.net/1.0/~berrange"
        }, 
        {
            "content": "Since this report concerns a possible security risk, an incomplete security advisory task has been added while the core security reviewers for the affected project or projects confirm the bug and discuss the scope of any vulnerability along with potential solutions.\n\nGiven the public nature of the issue, I'm inclined to switch this report to public. It doesn't sound like there's much point to an embargo here unless it's possible for unprivileged users to intentionally trigger an exception (in which case the value may be leaked in Nova's service logs?).\n\nSince a dependency upgrade mitigates the issue and it sounds like there won't be any associated Nova patches, I'm inclined to treat this as C2 in our taxonomy (a vulnerability, but not in OpenStack supported code, e.g., in a dependency, https://security.openstack.org/vmt-process.html#incident-report-taxonomy ) and recommend an OSSN letting consumers of Nova know they should upgrade to at least qemu 2.6 and libvirt 2.2 (or backport the relevant fixes to their qemu/libvirt versions). I'm subscribing the ossg-coresec team for input on this as well.", 
            "date_created": "2017-04-27 15:39:48.303526+00:00", 
            "author": "https://api.launchpad.net/1.0/~fungi"
        }, 
        {
            "content": "One further thing - the same issue affects the in-qemu iscsi client, and has *not* yet been fixed because the neccessary QEMU fix was only released last week in qemu 2.9.   While nova has code for the in-qemu iSCSI client, I don't think that is actually possible to be enabled any more - it was never the default either since it lacked multi-path support.", 
            "date_created": "2017-04-27 16:09:45.703560+00:00", 
            "author": "https://api.launchpad.net/1.0/~berrange"
        }, 
        {
            "content": "I don't see any immediate reason to keep this private. Ideally it wouldn't be possible for a user to trigger an error like this, although in practise there will be bugs. However, even when triggered I don't think we ever intentionally expose stack traces to non-admin users. In that case, I don't think this is a new issue and we should just warn users as you say.\n\nI'm going to request a second opinion on whether users should ever be able to see stack traces.", 
            "date_created": "2017-04-27 16:51:33.736595+00:00", 
            "author": "https://api.launchpad.net/1.0/~mbooth-9"
        }, 
        {
            "content": "We don't intentionally expose stacktraces to the user, and don't consider the logs for the user. Nova records exception traces via instance faults for some operations, but we only show those details for an admin context:\n\nhttps://github.com/openstack/nova/blob/master/nova/api/openstack/compute/views/servers.py#L301", 
            "date_created": "2017-04-27 18:09:46.477555+00:00", 
            "author": "https://api.launchpad.net/1.0/~mriedem"
        }, 
        {
            "content": "I agree with above comments, this sounds like a C2 class. Unless there is an objection let's open this bug.", 
            "date_created": "2017-04-28 06:57:51.463447+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "Ubuntu Xenial has libvirt 1.3.1 and qemu 2.5, so unless these packages have backported fixes (I haven't checked), Ubuntu users will be vulnerable.", 
            "date_created": "2017-04-28 08:58:34.750350+00:00", 
            "author": "https://api.launchpad.net/1.0/~mbooth-9"
        }, 
        {
            "content": "Making this public, all the issues in here have been publicly discussed in the libvirt/qemu projects, and being public at least makes people more aware of the potential leak.", 
            "date_created": "2017-06-08 12:34:40.471065+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }, 
        {
            "content": "Triaged as class C2 (a vulnerability, but not in OpenStack supported code, e.g., in a dependency; won't fix OSSA; potential OSSN) based on prior discussion in this bug report.", 
            "date_created": "2017-06-08 14:01:20.221393+00:00", 
            "author": "https://api.launchpad.net/1.0/~fungi"
        }, 
        {
            "content": "I don't think there is really a Nova fix here, just an FYI", 
            "date_created": "2017-07-24 15:30:38.163134+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }
    ], 
    "closed": "2017-07-24 15:30:20.151836+00:00"
}