{
    "status": "Confirmed", 
    "last_updated": "2016-09-29 20:00:50.541901+00:00", 
    "description": "Currently we cannot detach root device volume, even if instance is in shutoff state. Following error comes,\n+++\nERROR (Forbidden): Can't detach root device volume (HTTP 403) (Request-ID: req-57159c1c-5835-4a44-8e41-1b822b92127e)\n+++\n\nWhen instance is in shutoff this task should be allowed.", 
    "tags": [
        "compute"
    ], 
    "importance": "Wishlist", 
    "heat": 154, 
    "link": "https://bugs.launchpad.net/nova/+bug/1396965", 
    "owner": "None", 
    "id": 1396965, 
    "index": 2902, 
    "openned": "2014-11-27 11:20:11.808830+00:00", 
    "created": "2014-11-27 11:20:11.808830+00:00", 
    "title": "Add capability to detach root device volume of an instance, when in shutoff state", 
    "comments": [
        {
            "content": "Currently we cannot detach root device volume, even if instance is in shutoff state. Following error comes,\n+++\nERROR (Forbidden): Can't detach root device volume (HTTP 403) (Request-ID: req-57159c1c-5835-4a44-8e41-1b822b92127e)\n+++\n\nWhen instance is in shutoff this task should be allowed.", 
            "date_created": "2014-11-27 11:20:11.808830+00:00", 
            "author": "https://api.launchpad.net/1.0/~swap-kamble"
        }, 
        {
            "content": "not sure we can, the forbidden is added by https://bugs.launchpad.net/nova/+bug/1279300", 
            "date_created": "2014-11-28 07:59:21.087033+00:00", 
            "author": "https://api.launchpad.net/1.0/~xuhj"
        }, 
        {
            "content": "I suspect we might want to reopen this, a shutoff VM has no reason to prevent root device changes (and see also bug 1391196 where a user is requesting we re-instate the ability to make changes like one could previously.\n\nswapnil, can you give an example of where doing this makes sense? E.g. what do you want to accomplish, by doing this.", 
            "date_created": "2015-02-12 02:38:37.169887+00:00", 
            "author": "https://api.launchpad.net/1.0/~lifeless"
        }, 
        {
            "content": "A change in this to allow the detaching of a root volume to an instance makes since when the following happens:\n\ncinder snapshots are being created on a regular interval for a nova instance running Linux\ncinder creates a volume from a snapshot\nvolume needs to be attached to the nova instance that has the original volume on /dev/sda\n\nLinux has a specific issue with /etc/udev/rules.d/persistence-net-rules which stores the MAC addresses\n\nIf the restored volume is attached to a new nova instance, the new MAC address adds a second entry to the persistence-net-rules and treats the interface like a second non-configured device; thus, breaking networking.\n\nThe legitimate use case for this is local Operational Recovery where a customer wants to go backwards to a set of snapshots, where they are dependent on the disks as they have yet to write portable code or ephemeral applications. \n", 
            "date_created": "2015-03-05 06:25:39.253402+00:00", 
            "author": "https://api.launchpad.net/1.0/~t-openstack"
        }, 
        {
            "content": "When the server which the volume attached to is failed,  we may want to attach this root volume and delete manually from command line.", 
            "date_created": "2015-04-24 09:26:25.174816+00:00", 
            "author": "https://api.launchpad.net/1.0/~appleorchard2000"
        }, 
        {
            "content": "It would be very useful feature when installing guest systems, like FreeBSD, on instancewith no need to delete instance after installing. My users prefer to install their systems by hand from their ISO, not using my images.", 
            "date_created": "2015-05-18 11:25:37.527752+00:00", 
            "author": "https://api.launchpad.net/1.0/~pseudo"
        }, 
        {
            "content": "This is very useful because it is the only way to reimage/rebuild a sever because nova rebuild is not working if you are working with Volumes.  Sometimes you need to detach a Volume to attache a new one.  Please implement this.", 
            "date_created": "2015-07-28 10:06:17.909377+00:00", 
            "author": "https://api.launchpad.net/1.0/~frede-r"
        }, 
        {
            "content": "I just marked bug 1391196 as a duplicate to group all the comments together. Also removing the assignee as this hasn't been updated in about 7 months.\r\n\r\nDoing a little research about this, detach root device volume when in shutoff state was disabled because it can cause damage to the guest under certain conditions, rendering it unusable. From what I gathered in #openstack-nova, being able to detach root device volume in shutoff state can be a useful ability, but adding it back should be done with careful checking around it, to prevent guest damage.", 
            "date_created": "2015-07-28 17:51:03.520995+00:00", 
            "author": "https://api.launchpad.net/1.0/~melwitt"
        }, 
        {
            "content": "Happy to see someone paying attention to this issue. \n\nJust to reassume here, for our use case the important things are:\n\n1) not need to change/detach root volume live, but only in shutoff or even a new \"maintenance\" state (if this could help with other problems)\n2) destroying and creating another VM is not an option for us because we have windows OS aboard and changing the VM raises some serious problems: license loss, cloudbase-init restart (it's the windows declination of cloud-init), to name a few.", 
            "date_created": "2015-07-29 07:39:06.994354+00:00", 
            "author": "https://api.launchpad.net/1.0/~fabiodasoghe"
        }, 
        {
            "content": "I second the issue here. There are several use cases where having the ability is crucial for operation. Changing a MAC / IP address can be prohibitive in some environment. Consider setups where security is relevant and any changes need to go through a manual review process or when you are using provider nets with interconnects to real existing devices (like RSA token server, etc.) where you just can't have systems change their mac and/or ip addresses.\n\nYou need the ability in such cases.\n\nHere's a manual workaround (read: hack) to make it work. I am actually in the process of codifying this into our tooling as this is something we need and cannot wait another year until someone re-enables this.\n\nI write this down here in the hope that it may help others stuck here. Note that perhaps not all these steps are necessary for you. They are for us as we're booting from volumes generated from snapshotted images (on ceph)  ie: on nova show serverId I have \"Attempt to boot from volume - no image supplied\" in the image columns.\n\n- Detaching:\n first ensure VM is stopped\n cinder reset-state --state available oldVolumeId\n mysql cinder 'delete from volume_attachment where volume_id = oldVolumeId';\n mysql cinder 'update volumes set attachment_status=\"detached\" where id = oldVolumeId';\n mysql nova 'delete from block_device_mapping where not deleted and volume_id = oldVolumeId';\n nova volume-attach serverId newVolumeId\n cinder delete oldVolumeId\n mysql nova 'update block_device_mapping set device_name = \"/dev/vda\" where instance_uuid = serverId';\n\nNow very important, you need to execute this to regenerate the libvirt xml file (it would have bad disk references and would not start otherwise):\n\nnova reboot --hard serverId\n\nNow you should have the new volume mounted, the old deleted (obviously omit that step if you need to keep it) and the vm booting with the new one.\n\nThings that I noticed. Prior to this process, nova volume-detach server volume failes with the known root volume cannot be removed message. Afterwards this procedure it works. For some reason nova thinks the volume is vdb (ie second volume). You see this if you do a volume-detach then volume-attach where it will always be displayed as vdb and you will always need to do the update device mapping to vda and nova reboot --hard to make it start. If anyone knows where to kick nova so that it will accept this new volume as root / vda, I'll happily amend the procedure.\n\nI hope this is useful information until this bug results in working volume-attach / detach for root volumes again.", 
            "date_created": "2015-07-30 12:05:30.943112+00:00", 
            "author": "https://api.launchpad.net/1.0/~ren6"
        }, 
        {
            "content": "After working half of the day on this issue on my local installation, if all you want to do is to detach a root volume, two updates in mysql are sufficient:\n\nuse cinder;\nupdate volume_attachment set mountpoint='/dev/vdb' where volume_id = 'oldVolumeId' and deleted = 0;\nuse nova;\nupdate block_device_mapping set device_name = '/dev/vdb', boot_index=1 where volume_id = 'oldVolumeId' and deleted = 0;\n\nbasically the mountpoint/device name must not be /dev/vda and boot_index must not be 0. If this is true, you can successfully remove the volume using\nnova volume-detach <instanceId> <volumeId>.\n\nTo attach another volume, do the same thing in reverse after having used nova volume-attach. That is, set the name back to /dev/vda and set the boot_index to 0 for the new volume. Basically below:\n\nuse cinder;\nupdate volume_attachment set mountpoint='/dev/vda' where volume_id = 'shinyNewVolumeId' and deleted = 0;\nuse nova;\nupdate block_device_mapping set device_name = '/dev/vda', boot_index=0 where volume_id = 'shinyNewVolumeId' and deleted = 0;\n\nThen again use the magic incantation:\n\nnova reboot --hard <instanceId>\n\nto force a fresh and correct libvirt config for the instance being created.\n", 
            "date_created": "2015-07-30 14:26:50.644749+00:00", 
            "author": "https://api.launchpad.net/1.0/~ren6"
        }, 
        {
            "content": "Yes that may work. But dirty workarounds are not the way to go. There is no valid reason jet why a Volume can not be detached from a Instance while it is shutdown.  This is something that was implemented to protect a instance from being damaged because someone detaches the Volume while the Instance is running. ", 
            "date_created": "2015-07-30 14:49:13.996382+00:00", 
            "author": "https://api.launchpad.net/1.0/~frede-r"
        }, 
        {
            "content": "This is more of a feature than a bug. Adding the ability to detach and attach boot volumes was discussed in the Liberty design summit here: https://etherpad.openstack.org/p/YVR-nova-contributor-meetup#43 \n\nI took an action then to write up a spec but got delayed, so it was pushed out to address in Mitaka, see: https://bugs.launchpad.net/nova/+bug/1396965\n\nThe notes in the etherpad above a very brief but sum up some of the problems that will need to be addressed. The good news is that the volume attach and detach operations are already there and work for volumes attached as root devices. If you change the conditional in detach_volume() in the volumes API you will be allowed to do it. Attach requires a slight change to the naming to make sure it goes back as the root device.\n\nThe things to address are to do with notifications in case it affects billing etc., making operations on the instance safe, how to set the state of the instance and the volumes..... We intend to address all these as part of the spec. Please review it and see if it meets you needs.\n\nThanks,\npaul", 
            "date_created": "2015-09-09 13:03:11.687541+00:00", 
            "author": "https://api.launchpad.net/1.0/~pmurray"
        }, 
        {
            "content": "Here's another use case: We use the \"retype\" cinder function to relocate existing volumes to another storage backend. As expected, it only works for detached volumes. But since we cannot detach root volumes even from a shut down instance, we cannot retype root volumes at all. Since the majority of the affected instances only got one volume (the root volume), the retype function is basically useless.", 
            "date_created": "2015-09-18 21:27:50.996120+00:00", 
            "author": "https://api.launchpad.net/1.0/~chef-h"
        }, 
        {
            "content": "Any news on this? \nWe had the same problem theses days. We follow René Gallati's hack and it works, but this can not be implemented using code.  ", 
            "date_created": "2016-09-13 18:31:44.530326+00:00", 
            "author": "https://api.launchpad.net/1.0/~vini-g-fer"
        }, 
        {
            "content": "I am confronted with the same issue today on Mitaka. I will follow René Gallati's workaround.", 
            "date_created": "2016-09-22 07:00:43.594663+00:00", 
            "author": "https://api.launchpad.net/1.0/~cfiehe"
        }, 
        {
            "content": "There is a more simple workaround: just make a clone of the volume - it should work even if the VM is running (The only problem is the data loss. So you'd better stop the VM before it).\n\nFor example:\n\nopenstack volume create --size 5 --source Vol Name\n\nShould create a copy of the volume source Vol with 5 GB. Just note that the size should at least be equal to the source volume size, and the reference for the attached volume can be its ID or name (better the ID).\n\nThis should create a exact copy of the attached volume, without kill the VM or hacking the Cinder and Nova DataBase. :-D", 
            "date_created": "2016-09-28 18:44:23.943704+00:00", 
            "author": "https://api.launchpad.net/1.0/~tcanascimento"
        }, 
        {
            "content": "Cloning the volume, re-creating the guest VM with the right combination of metadata/flavors and finding the right combination of hostname is something that many of our end users would find quite difficult.", 
            "date_created": "2016-09-28 19:15:01.782349+00:00", 
            "author": "https://api.launchpad.net/1.0/~tim-bell"
        }, 
        {
            "content": "Hello Tim Bell, you are right; but I think that is a better solution than changing database tables. \n\nIn fact, the best solution is the fixing the bug. The method for download the volume have a --force option (which should stands for the case), but this does not work.\n\nThe hack I wrote above can be easly implemented (as a workaround) in a bash script fashion, even in python: just read the user credentials and call a subprocess on Python Code to Openstack CLI passing the command line. Again, this is a hack, not the best solution.\n\nBest regards.", 
            "date_created": "2016-09-29 18:48:00.582831+00:00", 
            "author": "https://api.launchpad.net/1.0/~tcanascimento"
        }, 
        {
            "content": "This bug (or misfeature) needs to be addressed.\n\nIf you only need to do this once, and the volume is not especially large,\nworkarounds are quite practical.\n\nIf your volumes are large, our if you need to do this across hundreds or\nthousands (or more) instances, you are going to put massive load on your\nstorage (for no reason).\n\nYour storage vendor will happily sell you a lot more/higher-performance\nstorage. You might but be fond of this approach.\n\nOn one side you have a relatively cheap fix to the implementation. On the\nother side you have a massive cost to each and every cloud.\n\nOn Thu, Sep 29, 2016 at 12:07 PM Thiago Carreira <email address hidden>\nwrote:\n\n> Hello Tim Bell, you are right; but I think that is a better solution\n> than changing database tables.\n>\n> In fact, the best solution is the fixing the bug. The method for\n> download the volume have a --force option (which should stands for the\n> case), but this does not work.\n>\n> The hack I wrote above can be easly implemented (as a workaround) in a\n> bash script fashion, even in python: just read the user credentials and\n> call a subprocess on Python Code to Openstack CLI passing the command\n> line. Again, this is a hack, not the best solution.\n>\n> Best regards.\n>\n> --\n> You received this bug notification because you are subscribed to the bug\n> report.\n> https://bugs.launchpad.net/bugs/1396965\n>\n> Title:\n>   Add capability to detach root device volume of an instance, when in\n>   shutoff state\n>\n> To manage notifications about this bug go to:\n> https://bugs.launchpad.net/nova/+bug/1396965/+subscriptions\n>\n", 
            "date_created": "2016-09-29 20:00:21+00:00", 
            "author": "https://api.launchpad.net/1.0/~preston-bannister"
        }
    ]
}