{
    "status": "Expired", 
    "last_updated": "2016-08-16 04:17:40.896812+00:00", 
    "description": "Add microversion changes description on compute introduction.\nhttps://github.com/openstack/nova/blob/4c18867424f09332cf5f7f5678e1f3a984b03618/nova/api/openstack/api_version_request.py#L72\n\nCurrently microversion history is not documented.\nhttp://developer.openstack.org/api-ref-compute-v2.1.html\n\nRef.\nsee following review comments\nhttps://review.openstack.org/#/c/291270/", 
    "tags": [
        "nova"
    ], 
    "importance": "Undecided", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1563314", 
    "owner": "None", 
    "id": 1563314, 
    "index": 7393, 
    "openned": "2016-03-29 13:03:34.807888+00:00", 
    "created": "2016-03-29 13:03:34.807888+00:00", 
    "title": "Add microversion changes desription con compute introduction section", 
    "comments": [
        {
            "content": "Add microversion changes description on compute introduction.\nhttps://github.com/openstack/nova/blob/4c18867424f09332cf5f7f5678e1f3a984b03618/nova/api/openstack/api_version_request.py#L72\n\nCurrently microversion history is not documented.\nhttp://developer.openstack.org/api-ref-compute-v2.1.html\n\nRef.\nsee following review comments\nhttps://review.openstack.org/#/c/291270/", 
            "date_created": "2016-03-29 13:03:34.807888+00:00", 
            "author": "https://api.launchpad.net/1.0/~sakaia"
        }, 
        {
            "content": "Sharat, if you have a change for this, be sure to update your commit message with \"closes-bug\" and the bug number. Our api documentation has changed since this bug was filed so your change might be out of date.\n\nI'm marking this as Incomplete because I need some clarification to better understand the issue. It sounds like the issue is that some documentation needs to be updated, but I've had to do a lot of work to figure out exactly what and it would be nice if you could lay that out better in your bug report.\n\nBased on the review comments, it looks like some documentation that used to live in api-site and now lives in the nova tree under api-ref needs to be updated. Can you please provide a link or specify the name of the api-ref document that needs the updates?\n\nCan you also be more clear about what in the documentation needs to be updated? From looking at the review comments, it looks like you've added an example to the document and you need information about what version is supported there.\n\nWhen you say \"microversion history is not documented\", what specifically are you proposing would need to be documented to resolve this? I feel that including microversion info in the api docs is a separate issue that is already being addressed. Is there something specific to the microversion history in this case that needs to be updated in this documentation in order to resolve this bug?\n\n", 
            "date_created": "2016-06-16 19:58:11.696989+00:00", 
            "author": "https://api.launchpad.net/1.0/~auggy"
        }, 
        {
            "content": "[Expired for OpenStack Compute (nova) because there has been no activity for 60 days.]", 
            "date_created": "2016-08-16 04:17:37.635141+00:00", 
            "author": "https://api.launchpad.net/1.0/~janitor"
        }
    ], 
    "closed": "2016-08-16 04:17:38.257172+00:00"
}