{
    "status": "Opinion", 
    "last_updated": "2016-05-18 15:16:50.524177+00:00", 
    "description": "The current workflow of rebooting a instance is:\n\n1. Reboot an active instance. If succeed, instance is still in active state.\n\n2. Reboot an active instance. If fail, and power_state is running, instance is still in active state.\n\n3. Reboot an active instance. If fail, and power_state is not running, instance will become error state.\n\n4. Reboot an error instance. If succeed, instance will become active state.\n\n5. Reboot an error instance. If fail, instance is still in error state.\n\n\n#1 and #2 are completely opposite result from user perspective. Especially, user should always hope to be informed, if his/her operation is not done as expected.  However, the instance information output by Nova api does not distinguish #1 and #2,  so that the user is not able to know if the reboot instance operation succeed or fail.", 
    "tags": [], 
    "importance": "Wishlist", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1397879", 
    "owner": "None", 
    "id": 1397879, 
    "index": 2903, 
    "openned": "2014-12-01 08:25:22.419574+00:00", 
    "created": "2014-12-01 08:25:22.419574+00:00", 
    "title": "User is not informed if reboot VM fail", 
    "comments": [
        {
            "content": "The current workflow of rebooting a instance is:\n\n1. Reboot an active instance. If succeed, instance is still in active state.\n\n2. Reboot an active instance. If fail, and power_state is running, instance is still in active state.\n\n3. Reboot an active instance. If fail, and power_state is not running, instance will become error state.\n\n4. Reboot an error instance. If succeed, instance will become active state.\n\n5. Reboot an error instance. If fail, instance is still in error state.\n\n\n#1 and #2 are completely opposite result from user perspective. Especially, user should always hope to be informed, if his/her operation is not done as expected.  However, the instance information output by Nova api does not distinguish #1 and #2,  so that the user is not able to know if the reboot instance operation succeed or fail.", 
            "date_created": "2014-12-01 08:25:22.419574+00:00", 
            "author": "https://api.launchpad.net/1.0/~zhaoqin"
        }, 
        {
            "content": "You talk about #1 and #2, what are #3, #4, #5 for? Also can you clarify what you mean by fail?  Not all failures are the same.", 
            "date_created": "2014-12-03 13:04:24.945165+00:00", 
            "author": "https://api.launchpad.net/1.0/~jogo"
        }, 
        {
            "content": "I think the report is just poorly worded.\n\nLet me have a go:\n\nIf you use 'nova reboot' on an instance and nova doesn't actually reboot it for some reason, nova doesn't show that it failed to do the reboot, for at least some failure modes (which Qin seems to be saying are tied into the power_state field).\n\nOne way we could solve this is to show the last power-on time in the API, so users can look at that. Another way would be to audit super carefully to ensure that we correctly change the instance state even if things fail. Another way would be to separate out the users desired state from the observed state, exposing the state machine of reboot in more detail (which BTW I think Ironic would appreciate(", 
            "date_created": "2015-02-03 03:25:42.929509+00:00", 
            "author": "https://api.launchpad.net/1.0/~lifeless"
        }, 
        {
            "content": "Thanks, Robert!  What you said is my point.\n\nI think over this problem for several weeks, feel that might not be a problem only for reboot operation.\n\nAssuming that we define one operation against Nova instance. After use request this operation via api, api returns http 202, and then asks compute node to perform this operation. If this operation succeed, one instance attribute will change; If fail, no instance attribute will change, and instance will still in active state. So after api call, the user will periodically query instance details and will wait for this attribute changing.\n\nIf this attribute does not change for a long time, the user may be confused. He is not clear whether this server operation has been performed or has not been performed yet. And He is also not clear if or not this operation fails, because the instance detail returns from nova api is always same as the data returned before he requests this operation.\n\n", 
            "date_created": "2015-02-03 05:43:01.994470+00:00", 
            "author": "https://api.launchpad.net/1.0/~zhaoqin"
        }, 
        {
            "content": "So I feel a general problem is how to notify user an operation failure, which does not result in an instance state change. Now we have instance_faults recorded in db. However, it will not be included in instance details, if instance state is not error.\n\nMy concept idea is to display instance faults number changing in instance details. For example, a user just requests a reboot operation. When he query instance detail, he notices that the instance is active, but there is one unresolved instance fault. He will know that his last reboot operation may fail, and will query instance fault record to see what happens. This idea seems like the new message notification of social networking software. Its user can be notified by the new message number, and then click to list the message details.\n", 
            "date_created": "2015-02-03 09:36:46.877129+00:00", 
            "author": "https://api.launchpad.net/1.0/~zhaoqin"
        }, 
        {
            "content": "One mitigating factor that may not be clear is that task_state should indicate whether Nova is currently attempting an operation. This has some issues, but thats the intent (and is meant to lock out concurrent requests on the same VM)", 
            "date_created": "2015-02-12 03:10:12.565185+00:00", 
            "author": "https://api.launchpad.net/1.0/~lifeless"
        }, 
        {
            "content": "This wishlist bug has been open a year without any activity. I'm going\nto move it to \"Opinion / Wishlist\", which is an easily-obtainable queue\nof older requests that have come on. If you decide to work on this\nconsider using a blueprint [1] (maybe with a spec [2]). I'll recommend to \nread [3] if not yet done. \n\nReferences:\n[1] https://blueprints.launchpad.net/nova/\n[2] https://github.com/openstack/nova-specs\n[3] https://wiki.openstack.org/wiki/Blueprints", 
            "date_created": "2016-05-18 15:16:40.563204+00:00", 
            "author": "https://api.launchpad.net/1.0/~mzoeller"
        }
    ], 
    "closed": "2016-05-18 15:16:47.720543+00:00"
}