{
    "status": "Fix Released", 
    "last_updated": "2011-02-07 13:53:54.845719+00:00", 
    "description": "It's apparantly common to not use a ramdisk for booting. Ubuntu's EC2 images only use a kernel, no ramdisk. EC2 and Eucalyptus both support this.", 
    "tags": [], 
    "importance": "High", 
    "heat": 12, 
    "link": "https://bugs.launchpad.net/nova/+bug/661159", 
    "owner": "https://api.launchpad.net/1.0/~soren", 
    "id": 661159, 
    "index": 307, 
    "openned": "2010-10-15 11:51:49.778003+00:00", 
    "created": "2010-10-15 11:51:49.778003+00:00", 
    "title": "Does not allow booting without a ramdisk", 
    "comments": [
        {
            "content": "It's apparantly common to not use a ramdisk for booting. Ubuntu's EC2 images only use a kernel, no ramdisk. EC2 and Eucalyptus both support this.", 
            "date_created": "2010-10-15 11:51:49.778003+00:00", 
            "author": "https://api.launchpad.net/1.0/~soren"
        }, 
        {
            "content": "This needs two things addressed:\n\na) We need to support it in the virt drivers. Currently, we always pass a ramdisk to kvm, this needs to be conditional.\nb) We have a concept of a default ramdisk. If none is set (either specifically in the RunInstances call or by way of a default setting in the machine image's metadata), there's a default value that will be used. We need to stop doing that.", 
            "date_created": "2010-10-15 11:54:07.628328+00:00", 
            "author": "https://api.launchpad.net/1.0/~soren"
        }, 
        {
            "content": "I'm a little concerned about the scope of this change.  In my opinion it would be perfectly acceptable for Austin to require a ramdisk.\n\nWhy should we do this pre-Austin?\n", 
            "date_created": "2010-10-15 12:06:00.750654+00:00", 
            "author": "https://api.launchpad.net/1.0/~dendrobates"
        }, 
        {
            "content": "The raw-disk-images patch already deals with not having a kernel & ramdisk:\nhttps://code.launchpad.net/~justin-fathomdb/nova/raw-disk-images/+merge/38458\n\nThat was (re)submitted a few hours before feature-freeze, but hasn't been reviewed/merged.\n\nThe raw-disk-images patch assumes that no kernel <=> no ramdisk, but this would be easy to change so that you can have a kernel but no ramdisk.\n\nFor EC2 API compatibility reasons, instead of dropping the default, it uses a 'magic' ramdisk / kernel id.  I think it's aki-00000000 and ari-00000000.  As I recall, vish and I came up with this 'hack'.\n\nBecause the user must explicitly select the 'null' kernel/ramdisk, this avoids breaking anything.\n", 
            "date_created": "2010-10-15 15:17:19.375907+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "I appreciate the effort to avoid breaking things, but I'm not sure what exactly has the potential for breaking?", 
            "date_created": "2010-12-01 12:39:13.846492+00:00", 
            "author": "https://api.launchpad.net/1.0/~soren"
        }, 
        {
            "content": "Increasing importance, as this is blocking usage of official Ubuntu cloud images, which a lot of people are trying to run.", 
            "date_created": "2010-12-09 14:57:55.771245+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "This is perhaps a naive comment, and likely will not be a popular one due to my mention of the evil that lurks in a town called Redmond.\n\nIt seems to me that this is necessary to deploy Windows images.  Is this correct?  If so, I think this is a big problem.  I am trying to bring up a production cloud, and in the \"real world\" of business the inability to run a Windows image feels like a deal breaker.  I wish everyone would choose to run Linux servers, but that is not going to happen.", 
            "date_created": "2010-12-15 13:28:44.956909+00:00", 
            "author": "https://api.launchpad.net/1.0/~jdmfilter-spam"
        }, 
        {
            "content": "Earlier today I proposed a branch that fixes this bug. It allows booting both whole-disk-images (i.e. relying on a boot loader in the disk image) as well as ramdisk-less booting (i.e. with an out-of-image kernel, but no ramdisk). It should land shortly.", 
            "date_created": "2010-12-15 14:00:49.858421+00:00", 
            "author": "https://api.launchpad.net/1.0/~soren"
        }, 
        {
            "content": "Confirmed fixed, I could run an Ubuntu 10.10 cloud image with bzr487.", 
            "date_created": "2010-12-23 13:19:25.724440+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }
    ], 
    "closed": "2011-02-07 13:53:52.903759+00:00"
}