{
    "status": "Fix Released", 
    "last_updated": "2016-03-03 16:19:55.534891+00:00", 
    "description": "This issue is being treated as a potential security risk under embargo. Please do not make any public mention of embargoed (private) security vulnerabilities before their coordinated publication by the OpenStack Vulnerability Management Team in the form of an official OpenStack Security Advisory. This includes discussion of the bug or associated fixes in public forums such as mailing lists, code review systems and bug trackers. Please also avoid private disclosure to other individuals not already approved for access to this information, and provide this same reminder to those who are made aware of the issue prior to publication. All discussion should remain confined to this private bug report, and any proposed fixes should be added to the bug as attachments.\n\n--\n\nAs the disk number of iSCSI attached disks can change after host reboot, passthrough attached volumes can get attached in this case.\n\nThis bug was partially fixed during Icehouse by this patch:\nhttps://review.openstack.org/95356\n\nOne of the issues with this patch is that it only handles SCSI attached disks, for which reason this issue continues to occur when having generation 1 VMs booted from volume, in which case the disk will be placed on the IDE controller.\n\nIn this case, one instance may end up booting from another tenant's volume, which is a critical security issue.\n\nAlso, it assumes that the block device info volume order matches the according disk controller slot order, which is wrong.\n\nRelated bug: https://bugs.launchpad.net/nova/+bug/1322926", 
    "tags": [
        "hyper-v", 
        "volumes"
    ], 
    "importance": "High", 
    "heat": 12, 
    "link": "https://bugs.launchpad.net/nova/+bug/1526831", 
    "owner": "https://api.launchpad.net/1.0/~petrutlucian94", 
    "id": 1526831, 
    "index": 1858, 
    "openned": "2015-12-16 14:58:06.958647+00:00", 
    "created": "2015-12-16 14:58:06.958647+00:00", 
    "title": "Hyper-V: swapped disks after host reboot", 
    "comments": [
        {
            "content": "As the disk number of iSCSI attached disks can change after host reboot, passthrough\nattached volumes can get attached in this case.\n\nThis bug was partially fixed during Icehouse by this patch:\nhttps://review.openstack.org/95356\n\nOne of the issues with this patch is that it only handles SCSI attached disks, for which reason\nthis issue continues to occur when having generation 1 VMs booted from volume, in which\ncase the disk will be placed on the IDE controller.\n\nIn this case, one instance may end up booting from another tenant's volume, which is\na critical security issue.\n\nAlso, it assumes that the block device info volume order matches the according disk\ncontroller slot order, which is wrong.\n\nRelated bug: https://bugs.launchpad.net/nova/+bug/1322926", 
            "date_created": "2015-12-16 14:58:06.958647+00:00", 
            "author": "https://api.launchpad.net/1.0/~petrutlucian94"
        }, 
        {
            "content": "Since this report concerns a possible security risk, an incomplete security advisory task has been added while the core security reviewers for the affected project or projects confirm the bug and discuss the scope of any vulnerability along with potential solutions.", 
            "date_created": "2015-12-16 15:09:06.420051+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "While this sounds like a very unfortunate bug/flaw, how would a malicious actor cause it to occur in an effort to exploit it? Seems like it would be sheer random occurrence.", 
            "date_created": "2015-12-16 19:27:46.371624+00:00", 
            "author": "https://api.launchpad.net/1.0/~fungi"
        }, 
        {
            "content": "Also, if it's not something an unprivileged attacker can trigger, I don't see any benefit to keeping this bug embargoed while the fix is developed and reviewed.", 
            "date_created": "2015-12-16 19:29:12.571797+00:00", 
            "author": "https://api.launchpad.net/1.0/~fungi"
        }, 
        {
            "content": "I agree, there are no immediate impacts caused by this bug, unless there is way to force compute reboot.\n\nIf nobody complains by the end of the year, let's make this report public and raise awareness from hyperV experts.", 
            "date_created": "2015-12-21 15:13:34.611654+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "I'm going to add the Hyper-V people to this bug.  At the very least this gives them a 'heads up' that the bug will be open next year.\n\nNow to work out how to do that thing :)", 
            "date_created": "2015-12-22 04:15:25.010625+00:00", 
            "author": "https://api.launchpad.net/1.0/~o-tony"
        }, 
        {
            "content": "My feeling is that we only need to keep this embargoed if an unprivileged user/attacker can a) force the server to reboot and b) control the reassignments.\n\nIf the attacker can't do both of those things then it's just a regular bug.", 
            "date_created": "2015-12-22 04:18:35.920336+00:00", 
            "author": "https://api.launchpad.net/1.0/~o-tony"
        }, 
        {
            "content": "Thanks Tony, I removed the OSSA task", 
            "date_created": "2016-01-04 15:51:08.913080+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "Fix: https://review.openstack.org/#/c/258615/\n", 
            "date_created": "2016-01-04 16:07:23.039100+00:00", 
            "author": "https://api.launchpad.net/1.0/~alexpilotti"
        }, 
        {
            "content": "Reviewed:  https://review.openstack.org/258614\nCommitted: https://git.openstack.org/cgit/openstack/nova/commit/?id=82bf282dd599d9c1528a34a032513e6721ae9876\nSubmitter: Jenkins\nBranch:    master\n\ncommit 82bf282dd599d9c1528a34a032513e6721ae9876\nAuthor: Lucian Petrut <email address hidden>\nDate:   Mon Dec 7 12:09:22 2015 +0200\n\n    HyperV: Set disk serial number for attached volumes\n    \n    Setting the disk serial number allows us to easily map volumes\n    with the according virtual disk resources.\n    \n    This is required for the Fibre Channel support implementation, as\n    well for the patch fixing the swapped VM disks after host reboot.\n    \n    Co-Authored-By: Alin Balutoiu <email address hidden>\n    \n    Partial-Bug: #1526831\n    Depends-On: I7faf798aa7c1c306ac641f4364b1407b80b40b09\n    Change-Id: I5a91c12eb54d8539e30598e617eb9f036fbba843\n", 
            "date_created": "2016-02-25 19:14:16.388373+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Reviewed:  https://review.openstack.org/258615\nCommitted: https://git.openstack.org/cgit/openstack/nova/commit/?id=9de0bec4f9cdf0cd6424aeb95daabe657d4db2d4\nSubmitter: Jenkins\nBranch:    master\n\ncommit 9de0bec4f9cdf0cd6424aeb95daabe657d4db2d4\nAuthor: Lucian Petrut <email address hidden>\nDate:   Thu Dec 10 19:23:08 2015 +0200\n\n    HyperV: Fix vm disk path issue\n    \n    As the disk number of iSCSI attached disks can change after host\n    reboot, passthrough attached volumes can get attached in this case.\n    \n    This bug was partially fixed during Icehouse by this patch:\n    https://review.openstack.org/95356\n    \n    One of the issues with this patch is that it only handles SCSI\n    attached disks, for which reason this issue continues to occur when\n    having generation 1 VMs booted from volume, in which case the disk\n    will be placed on the IDE controller.\n    \n    In this case, one instance may end up booting from another tenant's\n    volume, which is a critical security issue.\n    \n    Also, it assumes that the block device info volume order matches\n    the according disk controller slot order, which is wrong.\n    \n    This patch fixes this issue, looping through the block device\n    info and fixing the disk path for all the passthrough attached\n    disks, regardless of the disk controller.\n    \n    This requires the virtual disk resources attached to the instance\n    to be tagged with the serial number.\n    \n    Co-Authored-By: Alin Balutoiu <email address hidden>\n    \n    Closes-Bug: #1526831\n    Depends-On: Ibe463ce9ffb9129cab4b99fe7967ccb5f2181958\n    Change-Id: Icf8697d917c814ec120fce9898661eb9a20ade48\n", 
            "date_created": "2016-02-25 19:15:35.543190+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "This issue was fixed in the openstack/nova 13.0.0.0b3 development milestone.", 
            "date_created": "2016-03-03 16:19:54.703360+00:00", 
            "author": "https://api.launchpad.net/1.0/~doug-hellmann"
        }
    ], 
    "closed": "2016-02-25 19:15:32.868169+00:00"
}