{
    "status": "Fix Released", 
    "last_updated": "2012-09-27 15:29:31.167230+00:00", 
    "description": "When a compute service is restarted each instance running on the host has its iptables rules built and applied sequentially during the host init stage. The impact of this, especially on a host running many instances, can be observed as a period where some instances are not accessible as the existing iptables rules have been torn down and not yet re-applied.\n\nA suggested work-around for this would be a configurable/flagged deferred mode that would prevent the application of the iptables rules until all instances on the host had been initialised then the rules for all instances would be applied at once preventing a ‘blackout’ period.", 
    "tags": [
        "security-groups"
    ], 
    "importance": "Undecided", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1034401", 
    "owner": "https://api.launchpad.net/1.0/~dave-mcnally", 
    "id": 1034401, 
    "index": 4286, 
    "openned": "2012-08-08 14:07:31.730790+00:00", 
    "created": "2012-08-08 14:07:31.730790+00:00", 
    "title": "Compute restart causes period of network ‘blackout’", 
    "comments": [
        {
            "content": "When a compute service is restarted each instance running on the host has its iptables\nrules built and applied sequentially during the host init stage. The impact of this, especially \non a host running many instances, can be observed as a period where some instances \nare not accessible as the existing iptables rules have been torn down and not yet re-applied.\n\nA suggested work-around for this would be a configurable/flagged deferred mode that \nwould prevent the application of the iptables rules until all instances on the host had been\ninitialised then the rules for all instances would be applied at once preventing a ‘blackout’ \nperiod.", 
            "date_created": "2012-08-08 14:07:31.730790+00:00", 
            "author": "https://api.launchpad.net/1.0/~dave-mcnally"
        }, 
        {
            "content": "Fix proposed to branch: master\nReview: https://review.openstack.org/11029", 
            "date_created": "2012-08-08 15:25:36.881499+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Reviewed:  https://review.openstack.org/11029\nCommitted: http://github.com/openstack/nova/commit/8f1c54ce98fed9cb7384be9cbb9f28eba2f12c2d\nSubmitter: Jenkins\nBranch:    master\n\ncommit 8f1c54ce98fed9cb7384be9cbb9f28eba2f12c2d\nAuthor: David McNally <email address hidden>\nDate:   Wed Aug 8 16:20:23 2012 +0100\n\n    Compute restart causes period of network 'blackout'\n    \n    Fixes bug 1034401\n    \n    When a compute service is restarted each instance running on the\n    host has its iptables rules built and applied sequentially during\n    the host init stage. The impact of this, especially on a host\n    running many instances, can be observed as a period where some\n    instances are not accessible as the existing iptables rules have\n    been torn down and not yet re-applied.\n    \n    The presented work-around for this is a configurable/flagged deferred\n    mode that prevents the application of the iptables rules until all\n    instances on the host had been initialised then the rules for all\n    instances are applied all at once preventing a 'blackout' period.\n    \n    Change-Id: I0da90d07e54225fb63f3884897fb00a6027cd537\n", 
            "date_created": "2012-08-12 02:16:00.223979+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }
    ], 
    "closed": "2012-08-16 07:38:50.601248+00:00"
}