{
    "status": "Invalid", 
    "last_updated": "2016-03-15 14:51:06.295737+00:00", 
    "description": "nova/scheduler/host_manager.py uses a simple model for determination if a host has enough resources to run a new instance. It simply adds all resources for all instances that are scheduled for that host. However, these instances can be broken (in ERROR state) - they can simply do not exist at all, so, they don's consume resources. An instance can be broken if there are no free networks, if its images are improper, or even due to RPC timeout in nova-compute as it happens. These instances cannot be revived and should not be taken into account.", 
    "tags": [
        "scheduler"
    ], 
    "importance": "Medium", 
    "heat": 40, 
    "link": "https://bugs.launchpad.net/nova/+bug/1012822", 
    "owner": "None", 
    "id": 1012822, 
    "index": 2939, 
    "openned": "2012-06-13 19:27:34.012973+00:00", 
    "created": "2012-06-13 19:27:34.012973+00:00", 
    "title": "broken instances are considered to be consuming resources", 
    "comments": [
        {
            "content": "nova/scheduler/host_manager.py uses a simple model for determination if a host has enough resources to run a new instance. It simply adds all resources for all instances that are scheduled for that host. However, these instances can be broken (in ERROR state) - they can simply do not exist at all, so, they don's consume resources. An instance can be broken if there are no free networks, if its images are improper, or even due to RPC timeout in nova-compute as it happens. These instances cannot be revived and should not be taken into account.", 
            "date_created": "2012-06-13 19:27:34.012973+00:00", 
            "author": "https://api.launchpad.net/1.0/~aababilov"
        }, 
        {
            "content": "I have a question, if the instance becomes to ERROR state during spawn in hypervisor, in other words, the disk/image has already been created(disk resource need to be consumed?), how we deal this situation?", 
            "date_created": "2013-03-22 02:42:25.070017+00:00", 
            "author": "https://api.launchpad.net/1.0/~hzwangpan"
        }, 
        {
            "content": "\n1st scenario : During the scheduler activities during instance create, the scheduler updates its compute node level data before the request to spawn even reaches the compute node. So if the instance is in ERROR state during these activities, i think we can ignore updating the resource consumed by that instance in the host manager update call. \n\n2nd scenario (wangpan has pointed out) : Instance is being spawned by hypervisor and disk has been created and something goes wrong and instance goes into ERROR state, This case should be handled by the periodic resource tracker and not the host_manager since host manager has no idea about whats happened at hypervisor.\n\ndo these approaches sound alright?\n", 
            "date_created": "2013-12-04 15:02:19.941734+00:00", 
            "author": "https://api.launchpad.net/1.0/~kanaderohan"
        }, 
        {
            "content": "i think wee need clear way how to consider resource as acquired or not.  Since we cannot do that it is more reliable way\nto consider all resources as aquired ( bad scenario) and delegate responsibility to reclaim resources of instances in ERROR state to\ncloud operator.", 
            "date_created": "2016-02-26 17:02:56.599711+00:00", 
            "author": "https://api.launchpad.net/1.0/~gstepanov"
        }, 
        {
            "content": "I agree with gstepanov: It is better to be conservative about these failures. It's hard to be sure about the state of the instance so better to clear up the error states later, with some administrative oversight.\n\nSo is this even a bug?", 
            "date_created": "2016-03-09 12:42:35.310264+00:00", 
            "author": "https://api.launchpad.net/1.0/~cdent"
        }
    ], 
    "closed": "2016-03-15 14:51:03.531350+00:00"
}