{
    "status": "Opinion", 
    "last_updated": "2011-07-25 15:20:01.956977+00:00", 
    "description": "The OpenStack API will now automatically generate and return a password for you on server creation.  There should be a way to specify that no password should be created or injected, for people that would prefer to use SSH keys.", 
    "tags": [], 
    "importance": "Undecided", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/732274", 
    "owner": "None", 
    "id": 732274, 
    "index": 3323, 
    "openned": "2011-03-09 21:52:52.172618+00:00", 
    "created": "2011-03-09 21:52:52.172618+00:00", 
    "title": "Should be a way to avoid having a server password generated", 
    "comments": [
        {
            "content": "The OpenStack API will now automatically generate and return a password for you on server creation.  There should be a way to specify that no password should be created or injected, for people that would prefer to use SSH keys.", 
            "date_created": "2011-03-09 21:52:52.172618+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "Couple of things to add to this description:\n\n1) It was my understanding that the Openstack API 1.0 was supposed to implement the Cloud Servers spec. As 'adminPass' is in that spec it should be generated and not merely be an option.\n\n2) The existing password generation code doesn't hurt anything if you don't want to use it. You can silently ignore returned password and make use of agents which disregard the password altogether. This issue came up on the mailing lists and it was generally decided (I thought) that there is no harm done if you don't want to use the password generation downstream with agents.\n\nI'm not opposed to the existence of SSH keys but they certainly aren't in the spec and as such we may actually want to default to having that behavior off for this version of the API (Cloud Servers v1.0, etc.)\n\n\n", 
            "date_created": "2011-03-10 01:00:14.657984+00:00", 
            "author": "https://api.launchpad.net/1.0/~dan-prince"
        }, 
        {
            "content": "Hi Dan - I wasn't sure that we reached any agreement on the ML - I thought\nwe just decided it was out-of-scope for that particular merge proposal and\nthat we should open a separate issue.\n\nI certainly agree for compatibility with CloudServers that it should default\nto generating the password (when using the OS API)\n\nHowever, I think we should also try to have the OpenStack API be at parity\nwith the EC2 API.  It shouldn't be the case that if I want feature X (SSH\nkeys, no pasword injection) I have to use the EC2 API, but if I want feature\nY (Glance?) I have to use the OS API.\n\nGiven the code is there already for SSH key injection without password\ninjection, I don't believe this is a big task.\n\n\n\n\nOn Wed, Mar 9, 2011 at 5:00 PM, Dan Prince <email address hidden> wrote:\n\n> Couple of things to add to this description:\n>\n> 1) It was my understanding that the Openstack API 1.0 was supposed to\n> implement the Cloud Servers spec. As 'adminPass' is in that spec it\n> should be generated and not merely be an option.\n>\n> 2) The existing password generation code doesn't hurt anything if you\n> don't want to use it. You can silently ignore returned password and make\n> use of agents which disregard the password altogether. This issue came\n> up on the mailing lists and it was generally decided (I thought) that\n> there is no harm done if you don't want to use the password generation\n> downstream with agents.\n>\n> I'm not opposed to the existence of SSH keys but they certainly aren't\n> in the spec and as such we may actually want to default to having that\n> behavior off for this version of the API (Cloud Servers v1.0, etc.)\n>\n> --\n> You received this bug notification because you are a direct subscriber\n> of the bug.\n> https://bugs.launchpad.net/bugs/732274\n>\n> Title:\n>  Should be a way to avoid having a server password generated\n>\n> Status in OpenStack Compute (Nova):\n>  New\n>\n> Bug description:\n>  The OpenStack API will now automatically generate and return a\n>  password for you on server creation.  There should be a way to specify\n>  that no password should be created or injected, for people that would\n>  prefer to use SSH keys.\n>\n> To unsubscribe from this bug, go to:\n> https://bugs.launchpad.net/nova/+bug/732274/+subscribe\n>\n", 
            "date_created": "2011-03-10 02:03:18+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "Justin,\n\nIs the goal here to make ssh key use possible in os api? Or to make the existence (and transmission) of a root password optional?\n\nIf it is the former, I think my bug fix in lp727225 will give you what you want.\n\nThanks!", 
            "date_created": "2011-03-10 04:32:14.760709+00:00", 
            "author": "https://api.launchpad.net/1.0/~markwash"
        }, 
        {
            "content": "In this case, it's the latter:  I think we should support good security \"out\nof the box\" if we can without a lot of extra work, and I think we definitely\ncan in this case.  Of course, I have you to thank for that with 727255!\n", 
            "date_created": "2011-03-10 04:46:14+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "Justin: I agree that you shouldn't have to use EC2 API if you want SSH keys and no password injection. I think Dan's point is that merely generating a password doesn't really force you to inject it. Your choice of guest agent (agent-smith, cloud-init, ...) will decide what exactly is done with the proposed password (i.e. injection is controlled by the guest image used)", 
            "date_created": "2011-03-10 14:25:16.678910+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "In my understanding this is unneeded for the reasons outlined in previous comment... Please reopen if you disagree with that.", 
            "date_created": "2011-07-25 15:19:59.876194+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }
    ], 
    "closed": "2011-07-25 15:20:01.040620+00:00"
}