{
    "status": "Invalid", 
    "last_updated": "2013-03-10 03:08:31.395917+00:00", 
    "description": "[nova-volumes][tgtd]\n\nCurrently anyone who is not blocked by iptables (and nova does not implement any related rules by default) can login to targets and get full access to the nova-volumes.\n\nCHAP authentication can be used to prevent this.", 
    "tags": [
        "security"
    ], 
    "importance": "Wishlist", 
    "heat": 18, 
    "link": "https://bugs.launchpad.net/nova/+bug/1025667", 
    "owner": "None", 
    "id": 1025667, 
    "index": 2533, 
    "openned": "2012-07-17 13:39:47.886154+00:00", 
    "created": "2012-07-17 13:39:47.886154+00:00", 
    "title": "[nova-volume][tgtd] Implement authentication to targets", 
    "comments": [
        {
            "content": "[nova-volumes][tgtd]\n\nCurrently anyone who is not blocked by iptables (and no does not implement any related rules by default) can login to targets and get full access to the nova-volumes.\n\nCHAP authentication can be used to prevent this.", 
            "date_created": "2012-07-17 13:39:47.886154+00:00", 
            "author": "https://api.launchpad.net/1.0/~davidnaori3"
        }, 
        {
            "content": "After looking at this and talking to David Naori, I don't think we need to treat this as a security vulnerability.  I think the problem would be a deployment vulnerability as opposed to a code vulnerability.  CHAP support would be a very good security hardening enhancement to make, though.  There is a blueprint for it, so it's at least on the radar:\n\nhttps://blueprints.launchpad.net/cinder/+spec/iscsi-chap\n\nThere may be some things we can do in documentation to make sure people know that they should make sure that VM guests are not able to directly access volume nodes.", 
            "date_created": "2012-07-17 16:54:32.668114+00:00", 
            "author": "https://api.launchpad.net/1.0/~russellb"
        }, 
        {
            "content": "I'd agree it's probably not a Nova issue, and more a deployment/packaging issue. By default, Nova needs to be deployed in a way that prevents random VMs from accessing volumes. And a welcome strengthening would be that even in case of internal network compromise, the VMs can't access it either (for example, require CHAP auth).\r\n\r\n@Vishy: how could we fix this ?", 
            "date_created": "2012-07-23 15:40:44.855481+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "My quick take on irc was that I'm pretty sure tgtd would not be accessible to VMs from their private network. If a cloud operator makes their management network publicly accessible, then this is an issue ... but clearly that's not a sane deployment choice.\n\nHowever, I had assumed we had at least host/initiator based access control here - the initialize_connection() method supplies the initiator details and we could configure access control from there. That would be a new feature, though, not suitable for backporting because of the regression risk.", 
            "date_created": "2012-07-25 09:53:25.753671+00:00", 
            "author": "https://api.launchpad.net/1.0/~markmc"
        }, 
        {
            "content": "targets are not available to vms unless the deployer puts the volume service on a vm routable network. While, chap should be supported by default, I agree with mark that this is a new feature and doesn't warrant a backport.", 
            "date_created": "2012-07-25 16:51:36.108841+00:00", 
            "author": "https://api.launchpad.net/1.0/~vishvananda"
        }, 
        {
            "content": "OK, then I propose we open up this bug to the public, rename it \"Support CHAP auth for volume targets\", and consider it a \"welcome security strengthening feature\" rather than an \"exploitable vulnerability\". Let me know if you see any problem with that.", 
            "date_created": "2012-07-26 09:37:28.945281+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "Is the need for such IPTables/firewalling documented in the install/setup documentation? Can someone point me to it? This issue may need a CVE depending on various factors. Thanks.", 
            "date_created": "2013-02-07 08:41:34.017883+00:00", 
            "author": "https://api.launchpad.net/1.0/~kseifried"
        }, 
        {
            "content": "This code is no longer in nova.  It has moved to Cinder.  CHAP support was added in Cinder, so we can consider this done now.", 
            "date_created": "2013-03-10 03:08:22.488040+00:00", 
            "author": "https://api.launchpad.net/1.0/~russellb"
        }
    ], 
    "closed": "2013-03-10 03:08:29.419205+00:00"
}