{
    "status": "Expired", 
    "last_updated": "2016-06-01 04:17:32.322490+00:00", 
    "description": "This isn't necessarily a bug, but rather a placeholder tix to investigate a dubious assumption in the code.\n\nCurrently, unrescue queries for VBDs related to the instance and then assumes that the second VBD will always be the root fs.\n\nThis seems to work, but it would be a good idea to understand exactly why this works (it's not obvious AFAICT).\n\nA safer approach would be to use the name-labels on the vbd to determine which is the root vs swap disk.", 
    "tags": [
        "xenserver"
    ], 
    "importance": "Low", 
    "heat": 12, 
    "link": "https://bugs.launchpad.net/nova/+bug/919461", 
    "owner": "None", 
    "id": 919461, 
    "index": 414, 
    "openned": "2012-01-21 00:30:02.395560+00:00", 
    "created": "2012-01-21 00:30:02.395560+00:00", 
    "title": "Unrescue assumes swap disk is always returned as first disk", 
    "comments": [
        {
            "content": "This isn't necessarily a bug, but rather a placeholder tix to investigate a dubious assumption in the code.\n\nCurrently, unrescue queries for VBDs related to the instance and then assumes that the second VBD will always be the root fs.\n\nThis seems to work, but it would be a good idea to understand exactly why this works (it's not obvious AFAICT).\n\nA safer approach would be to use the name-labels on the vbd to determine which is the root vs swap disk.", 
            "date_created": "2012-01-21 00:30:02.395560+00:00", 
            "author": "https://api.launchpad.net/1.0/~rconradharris"
        }, 
        {
            "content": "I am making the assumption that we are looking at this for XenServer as referenced by the term VBDs additionally, for this assessment of what is being done with Nova i was looking at trunk. With XenServer, the unrescue process seems to start by looking for the instance name + \"-rescue\" from information which was provided to the method. The lookup then queries the xenapi for the VM by name label which returns VM reference information. Once the VM is found, the instance information is set as an object using the same lookup method as was done initially just without the \"-rescue\" string, this sets the original instance information. \n\nWhen the rescue VM goes to be destroyed, the rescue VM is shutdown, or at least force shutdown if need be. VDI references are looked up using the rescue VM information and then the root VDI is looked up using the original VM information. the VDI references are then compared and the VDIs, which are NOT the \"root_fs\", are then safely destroyed. Finally, the rescue VM is destroyed and the original VM has it's boot block released and it's restarted.\n\nIn short, nova is using name labels for lookups now, however, based on this commit : https://github.com/openstack/nova/commit/859172963f5e1f92682c06f603262e234ea14a58 : it seems like this may have been the case when this was originally posted. Presently, I am not sure if we have anything that would need fixing and or work. We could attempt to walk through nova and make the lookup of VBD's, VDI's and VHD's more intelligent but I am not sure it needs doing at present. thoughts? \n", 
            "date_created": "2013-07-11 15:50:37.641934+00:00", 
            "author": "https://api.launchpad.net/1.0/~kevin-carter"
        }, 
        {
            "content": "Is this assumption still the case?", 
            "date_created": "2016-04-01 11:22:16.147366+00:00", 
            "author": "https://api.launchpad.net/1.0/~fifieldt"
        }, 
        {
            "content": "[Expired for OpenStack Compute (nova) because there has been no activity for 60 days.]", 
            "date_created": "2016-06-01 04:17:29.350880+00:00", 
            "author": "https://api.launchpad.net/1.0/~janitor"
        }
    ], 
    "closed": "2016-06-01 04:17:29.845014+00:00"
}