{
    "status": "Fix Released", 
    "last_updated": "2012-04-05 10:18:43.980806+00:00", 
    "description": "This is a huge deployment concern.  Recovering from accidental deletions by users is impossible if we immediately delete the instance files.", 
    "tags": [], 
    "importance": "Wishlist", 
    "heat": 12, 
    "link": "https://bugs.launchpad.net/nova/+bug/739601", 
    "owner": "https://api.launchpad.net/1.0/~johannes.erdfelt", 
    "id": 739601, 
    "index": 2288, 
    "openned": "2011-03-21 18:31:58.357727+00:00", 
    "created": "2011-03-21 18:31:58.357727+00:00", 
    "title": "Instance files should be tombstoned and cleaned up later instead of immediately deleted", 
    "comments": [
        {
            "content": "This is a huge deployment concern.  Recovering from accidental deletions by users is impossible if we immediately delete the instance files.", 
            "date_created": "2011-03-21 18:31:58.357727+00:00", 
            "author": "https://api.launchpad.net/1.0/~vishvananda"
        }, 
        {
            "content": "Agree this is important.\n\nDo you think there should be a administrative command that e.g. gets run in cron job or do you think we should schedule it ourselves somehow?  I like the former, because it feels simpler and easier for everyone, but it's really just pushing more work onto the packagers / deployers.\n\nAnyone from Rackspace want to weigh in with a recommended policy?  Do we just leave the disk image lying around for - say - 24 hours?  Do we archive it off to Swift?  What happens if people launch and shut down a lot of machines quickly - could that DoS the cloud?", 
            "date_created": "2011-03-23 06:18:11.408286+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "I like the manage command + cron job.  Perhaps enabling tombstoning with a flag, because it is pretty useless in dev mode.\n\n\nOn Mar 22, 2011, at 11:18 PM, justinsb wrote:\n\n> Agree this is important.\n> \n> Do you think there should be a administrative command that e.g. gets run\n> in cron job or do you think we should schedule it ourselves somehow?  I\n> like the former, because it feels simpler and easier for everyone, but\n> it's really just pushing more work onto the packagers / deployers.\n> \n> Anyone from Rackspace want to weigh in with a recommended policy?  Do we\n> just leave the disk image lying around for - say - 24 hours?  Do we\n> archive it off to Swift?  What happens if people launch and shut down a\n> lot of machines quickly - could that DoS the cloud?\n> \n> -- \n> You received this bug notification because you are a direct subscriber\n> of the bug.\n> https://bugs.launchpad.net/bugs/739601\n> \n> Title:\n>  Instance files should be tombstoned and cleaned up later instead of\n>  immediately deleted\n> \n> Status in OpenStack Compute (Nova):\n>  New\n> \n> Bug description:\n>  This is a huge deployment concern.  Recovering from accidental\n>  deletions by users is impossible if we immediately delete the instance\n>  files.\n> \n> To unsubscribe from this bug, go to:\n> https://bugs.launchpad.net/nova/+bug/739601/+subscribe\n\n", 
            "date_created": "2011-03-23 06:30:57+00:00", 
            "author": "https://api.launchpad.net/1.0/~vishvananda"
        }, 
        {
            "content": "I've realized that of course we don't actually delete things in the database, we just set the deleted_at flag, so this might not even be particularly hard...\n\nThere might be some helpful stuff which comes out of my work on making sure instances don't disappear every time the host is restarted which is a WIP here:\nlp:~justin-fathomdb/nova/restart-instance\n", 
            "date_created": "2011-03-24 04:22:37.093073+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "Particularly now a lot of the hard work has been done for us...\nhttps://code.launchpad.net/~jk0/nova/xs-rescue-periodic-tasks/+merge/54597", 
            "date_created": "2011-03-24 04:27:33.284522+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "lp:~justin-fathomdb/nova/restart-instance now includes a tombstone function, which we could use instead of actually deleting data.\n\nI'd like to hear from people with experience in running Rackspace CloudServers on what we should be doing here.", 
            "date_created": "2011-03-24 07:09:25.835533+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "This is controlled by reclaim_instance_interval, which got merged back in September 2011. Closing this out since it's been implemented for a while.", 
            "date_created": "2012-02-27 22:11:57.512897+00:00", 
            "author": "https://api.launchpad.net/1.0/~johannes.erdfelt"
        }
    ], 
    "closed": "2012-02-29 10:33:13.228539+00:00"
}