{
    "status": "Opinion", 
    "last_updated": "2017-10-10 06:23:55.192102+00:00", 
    "description": "It would be great to rename the \"Default\" security group to be \"Default security group\" so that when users click on this name as a link in the table in Horizon's \"Access & Security\" section it will be clear that this is a security group. Also, it would be best to update this in the API to be sure they are consistent. This will also help when users are looking to select this security group from the list in the Launch Instance modal in Horizon.", 
    "tags": [
        "api"
    ], 
    "importance": "Low", 
    "heat": 14, 
    "link": "https://bugs.launchpad.net/nova/+bug/1291570", 
    "owner": "https://api.launchpad.net/1.0/~ravindra-joshi", 
    "id": 1291570, 
    "index": 1201, 
    "openned": "2014-05-05 14:02:53.052841+00:00", 
    "created": "2014-03-12 19:15:25.563502+00:00", 
    "title": "'Default' naming for default security group can confuse end users", 
    "comments": [
        {
            "content": "It would be great to rename the \"Default\" security group to be \"Default security group\" so that when users click on this name as a link in the table it will be clear that this is a security group. Also, it will help when they are selecting this security group from the list in the Launch Instance modal.", 
            "date_created": "2014-03-12 19:15:25.563502+00:00", 
            "author": "https://api.launchpad.net/1.0/~lblanchard"
        }, 
        {
            "content": "I believe this is created automatically by Nova/Neutron (depending on which is managing the security groups), I don't think this can be changed at the Horizon level. We're simply retrieving the existing data.", 
            "date_created": "2014-03-13 09:04:57.971081+00:00", 
            "author": "https://api.launchpad.net/1.0/~jpichon"
        }, 
        {
            "content": "Ah okay, thanks for the heads up on this one Julie! Do you think I should reassign this to the nova project?\n\nThanks,\nLiz", 
            "date_created": "2014-03-17 13:38:15.925066+00:00", 
            "author": "https://api.launchpad.net/1.0/~lblanchard"
        }, 
        {
            "content": "A question:\n\n> It would be great to rename the \"Default\" security group to be \"Default security group\" so that when users click on this name as a link in the table it will be clear that this is a security group.\n\nIsn't \"Default\" in the security table sufficient?\nIt is displayed in \"Name\" column in the security table, so \"Default security group\" doesn't provide much.\nChanging the description to \"Default security group\" might be better.\n\n\nAFAIK,  \"default\" is a RESERVED name in security group implementation in nova/neutron.\nChanging name directly leads to a backward-incompatible API change and it will be rejected with high possibility. (At least, I disagree changing the default name as neutron-core if it is proposed.)\nWe can replace \"default\" to other name when displaying security group in Horizon layer, but we also need to consider the consistency between API and Horizon. I am afraid that different names between API and Horizon may cause another confusion to users. Thought?", 
            "date_created": "2014-03-28 18:37:48.487039+00:00", 
            "author": "https://api.launchpad.net/1.0/~amotoki"
        }, 
        {
            "content": "I don't like the idea of indroducing inconsistencies between API and UI. In this case, the table in the UI looks quite similar to the output of 'nova secgroup-list' in the CLI. I don't see it as confusing, but that's just my opinion.", 
            "date_created": "2014-03-31 18:30:49.254974+00:00", 
            "author": "https://api.launchpad.net/1.0/~akrivoka"
        }, 
        {
            "content": "Hi All,\n\nYes I'd agree that we should maintain consistency between the UI and API here. I like Akihiro's suggestion of changing the description at the very least. Would another option be to change the terminology in both API and UI? I can continue to test this with end users too, but we observed 3 of the 5 participants in our usability study with end users get tripped up by this.\n\nThanks,\nLiz", 
            "date_created": "2014-04-01 20:49:38.057693+00:00", 
            "author": "https://api.launchpad.net/1.0/~lblanchard"
        }, 
        {
            "content": "It sounds like it would be worthwhile to open the bug with Nova and Neutron, as they create the default security groups (we can add them to this bug so they also have the history). Changing the description sounds like a good idea to me, since it's shown in Horizon's \"Access & Security\" too and shouldn't affect anything else that depends on the security groups.", 
            "date_created": "2014-04-02 08:44:36.387462+00:00", 
            "author": "https://api.launchpad.net/1.0/~jpichon"
        }, 
        {
            "content": "For backwards compatibility reasons we can't just change the name of the default security group in Nova. I think however it may be possible to update the description for the default as that is a lot less likely to break any existing apps.", 
            "date_created": "2014-06-03 05:22:06.666292+00:00", 
            "author": "https://api.launchpad.net/1.0/~cyeoh-0"
        }, 
        {
            "content": "Fix proposed to branch: master\nReview: https://review.openstack.org/102509", 
            "date_created": "2014-06-25 12:32:51.767201+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Fix proposed to branch: master\nReview: https://review.openstack.org/102522", 
            "date_created": "2014-06-25 13:11:42.714643+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Moving the Horizon priority to low to match the Nova priority. ", 
            "date_created": "2014-08-26 02:29:51.168021+00:00", 
            "author": "https://api.launchpad.net/1.0/~gary-w-smith"
        }, 
        {
            "content": "It sounds like the issue is that its unclear what is an isn't a security group in horizon. I don't think nova should change the default name.", 
            "date_created": "2014-10-13 22:51:01.712733+00:00", 
            "author": "https://api.launchpad.net/1.0/~jogo"
        }, 
        {
            "content": "From comment #7 the idea was to update the default description, rather than the name.", 
            "date_created": "2014-10-14 08:13:56.720650+00:00", 
            "author": "https://api.launchpad.net/1.0/~jpichon"
        }, 
        {
            "content": "Hi Ravindra,\n\nI wanted to ask if you are currently working on the neutron part of this bug as I would like to pick it up. I currently  see you inactive on this bug so kindly let me know if I can work on this and close this.\n\nThanks and Regards\nAbhishek Talwar", 
            "date_created": "2014-11-19 06:24:21.342748+00:00", 
            "author": "https://api.launchpad.net/1.0/~abhishek-talwar"
        }, 
        {
            "content": "You can take up this bug. \r\n\r\nThank you. \r\nRegards, \r\nRavindra Joshi\r\n\r\n-----Original Message-----\r\nFrom: <email address hidden> [mailto:<email address hidden>] On Behalf Of Abhishek Talwar\r\nSent: Wednesday, November 19, 2014 11:54 AM\r\nTo: Ravindra Joshi\r\nSubject: [Bug 1291570] Re: \"Default\" naming for default security group can confuse end users\r\n\r\nHi Ravindra,\r\n\r\nI wanted to ask if you are currently working on the neutron part of this bug as I would like to pick it up. I currently  see you inactive on this bug so kindly let me know if I can work on this and close this.\r\n\r\nThanks and Regards\r\nAbhishek Talwar\r\n\r\n--\r\nYou received this bug notification because you are subscribed to the bug report.\r\nhttps://bugs.launchpad.net/bugs/1291570\r\n\r\nTitle:\r\n  \"Default\" naming for default security group can confuse end users\r\n\r\nStatus in OpenStack Dashboard (Horizon):\r\n  Confirmed\r\nStatus in OpenStack Neutron (virtual network service):\r\n  In Progress\r\nStatus in OpenStack Compute (Nova):\r\n  Opinion\r\n\r\nBug description:\r\n  It would be great to rename the \"Default\" security group to be\r\n  \"Default security group\" so that when users click on this name as a\r\n  link in the table in Horizon's \"Access & Security\" section it will be\r\n  clear that this is a security group. Also, it would be best to update\r\n  this in the API to be sure they are consistent. This will also help\r\n  when users are looking to select this security group from the list in\r\n  the Launch Instance modal in Horizon.\r\n\r\nTo manage notifications about this bug go to:\r\nhttps://bugs.launchpad.net/horizon/+bug/1291570/+subscriptions\r\n\r\nDISCLAIMER\r\n==========\r\nThis e-mail may contain privileged and confidential information which is the property of Persistent Systems Ltd. It is intended only for the use of the individual or entity to which it is addressed. If you are not the intended recipient, you are not authorized to read, retain, copy, print, distribute or use this message. If you have received this communication in error, please notify the sender and delete all copies of this message. Persistent Systems Ltd. does not accept any liability for virus infected mails.\r\n\r\n", 
            "date_created": "2014-11-19 06:34:39+00:00", 
            "author": "https://api.launchpad.net/1.0/~ravindra-joshi"
        }, 
        {
            "content": "Fix proposed to branch: master\nReview: https://review.openstack.org/135552", 
            "date_created": "2014-11-19 09:56:26.971209+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Change abandoned by Sean Dague (<email address hidden>) on branch: master\nReview: https://review.openstack.org/102522\nReason: This review is > 4 weeks without comment and currently blocked by a core reviewer with a -2. We are abandoning this for now. Feel free to reactivate the review by pressing the restore button and contacting the reviewer with the -2 on this review to ensure you address their concerns.", 
            "date_created": "2014-11-20 15:18:54.382579+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Reviewed:  https://review.openstack.org/135552\nCommitted: https://git.openstack.org/cgit/openstack/neutron/commit/?id=f20b725b4a056090567504441d59ed88bfe62cef\nSubmitter: Jenkins\nBranch:    master\n\ncommit f20b725b4a056090567504441d59ed88bfe62cef\nAuthor: abhishek.talwar <email address hidden>\nDate:   Wed Nov 19 15:24:42 2014 +0530\n\n    Change description of default security group\n    \n    The description for default security group in neutron\n    is “default”.\n    This confuses the end users, so updated the description\n    from “default” to “Default security group”.\n    Closes-Bug: #1291570\n    \n    Change-Id: I9e024de935e8d17afd3d459cfa17e9feb0cd79fa\n", 
            "date_created": "2014-12-02 15:23:32.231479+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Change abandoned by Kyle Mestery (<email address hidden>) on branch: master\nReview: https://review.openstack.org/102509\nReason: This review is > 4 weeks without comment, and failed Jenkins the last time it was checked. We are abandoning this for now. Feel free to reactivate the review by pressing the restore button and leaving a 'recheck' comment to get fresh test results.", 
            "date_created": "2015-02-24 22:40:15.057437+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "There is nothing to do in horizon. Removing horizon from the affected project.", 
            "date_created": "2017-10-10 06:23:51.741463+00:00", 
            "author": "https://api.launchpad.net/1.0/~amotoki"
        }
    ], 
    "closed": "2014-10-13 22:51:07.561400+00:00"
}