{
    "status": "Triaged", 
    "last_updated": "2017-06-23 06:46:02.751347+00:00", 
    "description": "When Ironic and nova work in one region。we should deploy multiple nova-scheduler process，some for Ironic node scheduling and others for virtual machines scheduling。 Then we call rest API to boot an ironic node， nova-conductor polls the message to multiple nova-scheduler，and not distinguish nova-schedulers for ironic from nova-schedulers for virtual machines。 so it will cause an exception for not selecting a valid host to boot。\n\nI eager to solving this question because this scenario happened in our deploying project。\n\nAnyone has good ideas？", 
    "tags": [
        "ironic", 
        "nova-scheduler"
    ], 
    "importance": "Wishlist", 
    "heat": 16, 
    "link": "https://bugs.launchpad.net/nova/+bug/1632539", 
    "owner": "None", 
    "id": 1632539, 
    "index": 3103, 
    "openned": "2016-10-12 02:53:41.406235+00:00", 
    "created": "2016-10-12 02:53:41.406235+00:00", 
    "title": "Multiple nova schedulers for Ironic and nova conflict when they  work together in one Region", 
    "comments": [
        {
            "content": "When Ironic and nova work in one region。we should deploy multiple nova-scheduler process，some for Ironic node scheduling and others for virtual machines scheduling。 Then we call rest API to boot an ironic node， nova-conductor polls the message to multiple nova-scheduler，and not distinguish nova-schedulers for ironic from nova-schedulers for virtual machines。 so it will cause an exception for not selecting a valid host to boot。\n\nI eager to solving this question because this scenario happened in our deploying project。\n\nAnyone has good ideas？", 
            "date_created": "2016-10-12 02:53:41.406235+00:00", 
            "author": "https://api.launchpad.net/1.0/~eric-litao"
        }, 
        {
            "content": "Hi! This fully belongs in Nova, so moving it back. I don't have a precise answer to your question, but nova-scheduler's do not depend on the exact compute backends. It is nova-compute instances that are backend-specific.\n\nI guess your problem is with choosing between BM and VM nodes. You can use, for example, host aggregates to distinguish between these. I suggest you reach out to the Nova team for better explanation.", 
            "date_created": "2016-10-12 13:37:16.235613+00:00", 
            "author": "https://api.launchpad.net/1.0/~divius"
        }, 
        {
            "content": "Certainly there's been some work experimenting with host aggregates to allow this scenario, but I don't believe this is ready for general consumption yet.  The better bet would be to wait for CellsV2 and deploy VMs in one region and BMs in another.  That approach will most likely do what you want easily.\n\nTo put this another way, I think what you're asking is a feature request.  It's certainly in the realm of Nova.", 
            "date_created": "2016-11-10 23:12:46.561314+00:00", 
            "author": "https://api.launchpad.net/1.0/~mrda"
        }, 
        {
            "content": "Thanks to Dmitry Tantsur and Michael Davies, I mean how to select nova scheduler not select nova compute host.For example, BM schedulers set scheduler_host_manager=ironic_host_manager and VM schedulers set scheduler_host_manager=host_manager in one region, host aggregates can not reach the goal, becasue host aggregate only affects nova compute not nova scheduler, so deploying different regions for BM and VM is a better choice.", 
            "date_created": "2016-11-14 08:56:05.292117+00:00", 
            "author": "https://api.launchpad.net/1.0/~eric-litao"
        }, 
        {
            "content": "i think using multiple nova-schedulers with differ filters setting should take care the hypervisor type. Indeed, why nova-conductor can't distribute baremetal and VM instance creation requests to delegated nova-scheduler?", 
            "date_created": "2017-04-27 02:40:47.763077+00:00", 
            "author": "https://api.launchpad.net/1.0/~yaojun"
        }, 
        {
            "content": "I think nova-conductor knows the hypervisor type is a choice。But I think it's aim is not to konw the hypervisor type，because it‘s a common mechanism。\n", 
            "date_created": "2017-05-04 07:20:41.270854+00:00", 
            "author": "https://api.launchpad.net/1.0/~eric-litao"
        }, 
        {
            "content": "I think more and think it is possible in a region for baremetal nodes and compute nodes in small scale. So Seamanhanshan's opinion should be considered. We should need a filter that knows the hypervisor type and decides to use which filter for baremetal nodes and compute nodes.\nso i will try to solve it issue. what do you think, Caine?", 
            "date_created": "2017-06-23 06:46:01.451417+00:00", 
            "author": "https://api.launchpad.net/1.0/~eric-litao"
        }
    ]
}