{
    "status": "Expired", 
    "last_updated": "2016-07-05 09:49:12.100909+00:00", 
    "description": "I have a Cluster-Datastore which has two datastores in it. One of the datastore has a instance spawned from nova VCDriver and the instance has an iso image attached to it(configdrive.iso). I tried putting the Datastore to maintenance mode. It failed with the reason being \"Storage DRS is unable to move virtual machines with mounted CD-ROM drives or with snapshots having mounted CD-ROM drives\". I tried manual migration of the virtual machine. After doing this i see that all the files of the instance were migrated except the configdrive.iso. Since the configdrive.iso file was present, i was not able to put the datastore into maintenance mode.\n\nSince configdrive.iso is used by cloud-init for customization which happens only on first boot, the driver should detach the configdrive.iso after the required customization is done.", 
    "tags": [
        "vmware"
    ], 
    "importance": "Undecided", 
    "heat": 12, 
    "link": "https://bugs.launchpad.net/nova/+bug/1325866", 
    "owner": "None", 
    "id": 1325866, 
    "index": 6163, 
    "openned": "2014-06-03 08:45:59.413768+00:00", 
    "created": "2014-06-03 08:45:59.413768+00:00", 
    "title": "Datastore in a Cluster-Datastore fails to enter maintenance mode if instance has a CD-Rom attached to it", 
    "comments": [
        {
            "content": "I have a Cluster-Datastore which has two datastores in it. One of the datastore had a instance which has an iso image attached to it. I tried putting the Datastore to maintenance mode. It failed with the reason being \"Storage DRS is unable to move virtual machines with mounted CD-ROM drives or with snapshots having mounted CD-ROM drives\". I tried manual migration of the virtual machine. After doing this i see that all the files of the virtual machine were migrated other than the iso image. Also,  the datastore never went to maintenance mode after this.\n\nSince configdrive.iso is used by cloud-init for customization which happens only on first boot, the driver should detach the configdrive.iso after the required customization is done.", 
            "date_created": "2014-06-03 08:45:59.413768+00:00", 
            "author": "https://api.launchpad.net/1.0/~chetan6033"
        }, 
        {
            "content": "", 
            "date_created": "2014-06-03 08:45:59.413768+00:00", 
            "author": "https://api.launchpad.net/1.0/~chetan6033"
        }, 
        {
            "content": "does the driver *know* when the customization is complete?", 
            "date_created": "2014-06-04 17:45:06.804884+00:00", 
            "author": "https://api.launchpad.net/1.0/~tjones-i"
        }, 
        {
            "content": "No the driver does not know about the completion of the customization. ", 
            "date_created": "2014-06-05 08:03:09.381227+00:00", 
            "author": "https://api.launchpad.net/1.0/~chetan6033"
        }, 
        {
            "content": "Instance spawned from Openstack using VMWare driver will always have the configdrive.iso attached. This means the datastore on which the instance  resides cannot be put into maintenance mode.\nThis is a major limitation since administrator would want the datastore to be retired/reassigned and they would like to ensure that the datastores can be put in maintenace mode\n", 
            "date_created": "2014-06-06 09:04:17.823327+00:00", 
            "author": "https://api.launchpad.net/1.0/~chetan6033"
        }, 
        {
            "content": "\nThis is an automated cleanup. This bug report has been closed because it\nis older than 18 months and there is no open code change to fix this.\nAfter this time it is unlikely that the circumstances which lead to\nthe observed issue can be reproduced.\n\nIf you can reproduce the bug, please:\n* reopen the bug report (set to status \"New\")\n* AND add the detailed steps to reproduce the issue (if applicable)\n* AND leave a comment \"CONFIRMED FOR: <RELEASE_NAME>\"\n  Only still supported release names are valid (LIBERTY, MITAKA, OCATA, NEWTON).\n  Valid example: CONFIRMED FOR: LIBERTY\n", 
            "date_created": "2016-07-05 09:49:11.619647+00:00", 
            "author": "https://api.launchpad.net/1.0/~mzoeller"
        }
    ], 
    "closed": "2016-07-05 09:49:08.653178+00:00"
}