{
    "status": "Invalid", 
    "last_updated": "2016-04-18 12:32:31.066397+00:00", 
    "description": "This issue is being treated as a potential security risk under embargo. Please do not make any public mention of embargoed (private) security vulnerabilities before their coordinated publication by the OpenStack Vulnerability Management Team in the form of an official OpenStack Security Advisory. This includes discussion of the bug or associated fixes in public forums such as mailing lists, code review systems and bug trackers. Please also avoid private disclosure to other individuals not already approved for access to this information, and provide this same reminder to those who are made aware of the issue prior to publication. All discussion should remain confined to this private bug report, and any proposed fixes should be added to the bug as attachments.\n\n--\n\nThis came up at the nova mid-cycle. We know that LVM uses the instance name (which is user configurable) as the LVM device name for devices it creates. We should audit to ensure that's correctly escaped. We should also check where else we do something similar.", 
    "tags": [], 
    "importance": "Undecided", 
    "heat": 14, 
    "link": "https://bugs.launchpad.net/nova/+bug/1538061", 
    "owner": "None", 
    "id": 1538061, 
    "index": 7261, 
    "openned": "2016-01-26 10:03:13.760253+00:00", 
    "created": "2016-01-26 10:03:13.760253+00:00", 
    "title": "Ensure that LVM escapes instance names for device names correctly", 
    "comments": [
        {
            "content": "This came up at the nova mid-cycle. We know that LVM uses the instance name (which is user configurable) as the LVM device name for devices it creates. We should audit to ensure that's correctly escaped. We should also check where else we do something similar.", 
            "date_created": "2016-01-26 10:03:13.760253+00:00", 
            "author": "https://api.launchpad.net/1.0/~mikal"
        }, 
        {
            "content": "Since this report concerns a possible security risk, an incomplete security advisory task has been added while the core security reviewers for the affected project or projects confirm the bug and discuss the scope of any vulnerability along with potential solutions.\n\nThis seems related to bug 1486565... What's the effect for the lvm driver, is the image name used in a command line ?", 
            "date_created": "2016-01-26 13:16:22.838064+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "Yes, it is used in command lines. I am also pretty sure it can be escaped to point at the wrong device file (think ../../../dev/sda0). That said, I am jumping to conclusions as I am at the mid-cycle and haven't had a chance to take a look at the code closely yet.", 
            "date_created": "2016-01-26 13:37:22.301229+00:00", 
            "author": "https://api.launchpad.net/1.0/~mikal"
        }, 
        {
            "content": "You know, we were pretty sure that this was a problem at the mid-cycle this morning, but I can't find any problem usages in imagebackend.py for any supported release. This might be a non-issue.", 
            "date_created": "2016-01-26 13:45:35.553023+00:00", 
            "author": "https://api.launchpad.net/1.0/~mikal"
        }, 
        {
            "content": "I couldn't reproduce this bug with 2015.1.1... In nova.conf:\nimages_type=lvm\nimages_volume_group=cinder-volumes   # to reuse pvs of cinder\n\nThen create a vm like this:\nnova boot --image cirros --flavor m1.tiny \"te|st\\\\';';\\\\\\\";\\\";touch /tmp/toto;\"\n\nIndeed characters are not escaped, nova list shows:\nte|st\\';';\\\";\";touch /tmp/toto;\n\nBut LVM volume name is based on ${UUID}_disk:\n# lvs\n  LV                                        VG             Attr       LSize Pool Origin Data%  Meta%  Move Log Cpy%Sync Convert\n  a1094f37-bb8e-4d1a-b8fb-cda137a645a4_disk cinder-volumes -wi-ao---- 1.00g        \n\nFinally there is no files named \"*toto*\" in /tmp or /dev...\n\n\nMichael, how can I get LVM to uses the instance name as the LVM device name ?", 
            "date_created": "2016-01-26 15:07:49.584278+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "Any progress on that ? If it's not easily reproducible, could we make this bug report public ?", 
            "date_created": "2016-02-15 15:22:20.920649+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "@mikal - update here? Because this seems like less of a bug than a buglet thought. Before having a bunch of people investigate this we should know that there is a real issue here.", 
            "date_created": "2016-02-17 15:11:52.329020+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }, 
        {
            "content": "So, I've had a poke around and I can't find an example of this being an actual problem. We all seemed so certain at the mid-cycle, but I think we did a better job here than we realized. I think we can close this as not a bug.", 
            "date_created": "2016-02-25 21:16:25.985324+00:00", 
            "author": "https://api.launchpad.net/1.0/~mikal"
        }, 
        {
            "content": "Removed the OSSA task and opened the bug. Will leave it to the Nova PTL to close. ", 
            "date_created": "2016-02-25 22:17:00.971945+00:00", 
            "author": "https://api.launchpad.net/1.0/~gmurphy"
        }, 
        {
            "content": "Closing this out as invalid, as highlighted already in the bug we only use the UUID and escaped disk name when creating LVs locally.", 
            "date_created": "2016-04-18 12:32:27.532880+00:00", 
            "author": "https://api.launchpad.net/1.0/~lyarwood"
        }
    ], 
    "closed": "2016-04-18 12:32:29.515309+00:00"
}