{
    "status": "Won't Fix", 
    "last_updated": "2014-10-22 19:44:33.243897+00:00", 
    "description": "AWS provides a scenario to expand volumes of an instance (http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ebs-expand-volume.html). It consist of:\n1 Stop the instance\n2 Create a snapshot of the volume\n3 Create a new volume from the snapshot\n4 Detach the old volum\n5 Attach the new volume using the same device name\n6 Start the instance\n\nIn Nova this works for non-root devices, but doesn't for a root device.\n\nNow in current version (Juno) since https://review.openstack.org/#/c/75552/ was merged it's not able to detach root volume at all.\n\n$ nova volume-detach inst 02f60d80-47ee-47ed-a795-cb4d05f5103e\nERROR (Forbidden): Can't detach root device volume (HTTP 403) (Request-ID: req-e25134dc-1330-4fe1-9d21-abc274e75a1d)\n\nBefore this commit it was able, but it was unable to attach the root volume back.", 
    "tags": [
        "ec2"
    ], 
    "importance": "Medium", 
    "heat": 12, 
    "link": "https://bugs.launchpad.net/nova/+bug/1370384", 
    "owner": "None", 
    "id": 1370384, 
    "index": 4048, 
    "openned": "2014-09-17 08:18:53.653459+00:00", 
    "created": "2014-09-17 08:18:53.653459+00:00", 
    "title": "Cannot expand root volume by EC2 API", 
    "comments": [
        {
            "content": "AWS provides a scenario to expand volumes of an instance (http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ebs-expand-volume.html). It consist of:\n1 Stop the instance\n2 Create a snapshot of the volume\n3 Create a new volume from the snapshot\n4 Detach the old volum\n5 Attach the new volume using the same device name\n6 Start the instance\n\nIn Nova this works for non-root devices, but doesn't for a root device.\n\nNow in current version (Juno) since https://review.openstack.org/#/c/75552/ was merged it's not able to detach root volume at all.\n\n$ nova volume-detach inst 02f60d80-47ee-47ed-a795-cb4d05f5103e\nERROR (Forbidden): Can't detach root device volume (HTTP 403) (Request-ID: req-e25134dc-1330-4fe1-9d21-abc274e75a1d)\n\nBefore this commit it was able, but it was unable to attach the root volume back.", 
            "date_created": "2014-09-17 08:18:53.653459+00:00", 
            "author": "https://api.launchpad.net/1.0/~ftersin"
        }, 
        {
            "content": "My initial approximation of this issue, is that we should update the changes made under https://review.openstack.org/#/c/75552/  (Don't detach root device volume) to take into account the server state.\n\nThat is, if the server (VM) is stopped, then permit the root device detach. If the server is running, then do not permit the root device detach.\n\nComments on this approach are welcome.", 
            "date_created": "2014-10-07 18:23:29.083441+00:00", 
            "author": "https://api.launchpad.net/1.0/~boden"
        }, 
        {
            "content": "@ftersin -- the current implementation of nova's resize supports disk resize as part of the resize operation / workflow. That is; if you resize the server to a flavor which has a larger disk, the resize operation will handle it. IMHO this workflow is much cleaner and more user friendly than a 6 step manual process outlined in the description.\n\nWith that in mind it's not clear to me why a 6 step manual process is needed (as per description of this bug) -- is this for AWS parity?\n\nIf you feel we need to support the manual root disk resize (e.g. detach root disk + snapshot... + reattach root disk) then to me this is grounds for a blueprint and I would suggest you open a nova blueprint (https://blueprints.launchpad.net/nova) for the requested functionality.\n\nThe current nova implementation does not currently handle root disk detach (checked at API layer), nor does it handle root disk attach (compute layer). With a few quick hacks I was able to make this work w/libvirt KVM. However from a user perspective I believe we'd need to think about how this would work / look; something similar to the existing nova resize; or perhaps as an option in resize.\n\nI'm going to close this as will not fix based on my above comments. If you feel this is an incorrect state feel free to re-open.\n\nThanks", 
            "date_created": "2014-10-16 14:35:52.912742+00:00", 
            "author": "https://api.launchpad.net/1.0/~boden"
        }, 
        {
            "content": "@boden\n>> is this for AWS parity?\nExactly!\n\nIf we claim AWS compatibility, typical AWS scenarios should work fine. This resizing scenario is declared by AWS.\nAs i understand, the compatibility means, that an end user EC2 script with this scenario should do it's work properly as it is against OpenStack. But now it's not the case.\n\nMoreover there is no other way to resize a root volume by EC2 API.\n\nAs you mentioned above we can allow to detach root disk when an instance is stopped. I guess that current prohibition is not the result of deep digging, but the result of easy fixing of https://bugs.launchpad.net/nova/+bug/1279300 (detach boot device volume without warning).\n\nAlso for attaching a root device back - as i see, the problem is inspired by usage of block_device.instance_block_mapping to get all current device names. But block_device.instance_block_mapping returns root device even though it isn't attached (and this is used in other case when it's  called).\n\nThus Nova doesn't contain explicit restrictions to reattach a root device. Nova architecture allows this, but certain minor parts of code prevent it. So i reopen the bug. I hope it can be resolved.", 
            "date_created": "2014-10-16 16:43:03.627295+00:00", 
            "author": "https://api.launchpad.net/1.0/~ftersin"
        }, 
        {
            "content": "but how can i reopen it? i don't see statuses other than 'wan't fix' in the combobox", 
            "date_created": "2014-10-16 16:51:52.498979+00:00", 
            "author": "https://api.launchpad.net/1.0/~ftersin"
        }, 
        {
            "content": "Regarding changing the status -- I think you have to be a member of the nova bugs LP group to do that: https://launchpad.net/~nova-bugs\n\nW/R/T the technicals of this request; IMHO this is still grounds for a blueprint. It's unclear to me if all hypervisors would support attaching a root disk and if so if the current constructs would facilitate it. That said I'd rather see this come through as a blueprint to get the nova team on the same page through that process. However that's just my 2 cents.", 
            "date_created": "2014-10-22 19:44:32.304383+00:00", 
            "author": "https://api.launchpad.net/1.0/~boden"
        }
    ], 
    "closed": "2014-10-16 14:36:16.432558+00:00"
}