{
    "status": "Invalid", 
    "last_updated": "2016-03-11 14:34:26.169857+00:00", 
    "description": "The following bug fix takes care of copying the configdrive to the resize target, but it does not attach it to the instance. https://bugs.launchpad.net/nova/+bug/1250324", 
    "tags": [
        "hyper-v"
    ], 
    "importance": "Low", 
    "heat": 10, 
    "link": "https://bugs.launchpad.net/nova/+bug/1301368", 
    "owner": "https://api.launchpad.net/1.0/~avladu", 
    "id": 1301368, 
    "index": 1230, 
    "openned": "2014-04-02 13:05:48.608188+00:00", 
    "created": "2014-04-02 13:05:48.608188+00:00", 
    "title": "Hyper-V configdrive is not atatched after resizing an instance", 
    "comments": [
        {
            "content": "The following bug fix takes care of copying the configdrive to the resize target, but it does not attach it to the instance. https://bugs.launchpad.net/nova/+bug/1250324", 
            "date_created": "2014-04-02 13:05:48.608188+00:00", 
            "author": "https://api.launchpad.net/1.0/~alexpilotti"
        }, 
        {
            "content": "We use milestones only at the very end of the milestone to track bugs that should block the release of the milestone. Please use tags not milestones to track bugs, try things like: my_bug_topic_milestone_name", 
            "date_created": "2014-06-10 11:21:40.329179+00:00", 
            "author": "https://api.launchpad.net/1.0/~johngarbutt"
        }, 
        {
            "content": "Hi Sean and Adrian, \nI saw this is confirmed as a bug. So there is any progress now? \nFor I met a problem, and I am not sure whether there is something related to this bug.\n\nMy issue is: On hyper-v environment, after the action resize of a vm windows 2008 Standard the vm is not accessible via Remote Desktop, so I logged via Hyper-v console and i issued the ipconfig command and i noted that the network is not more configured.\nAnd I doubt it is something related to config drive. Could you give me some advice?\nMany thanks.", 
            "date_created": "2015-11-30 09:18:12.930602+00:00", 
            "author": "https://api.launchpad.net/1.0/~wlwwang"
        }, 
        {
            "content": "Did a resize, configdrive is attached. Looking through the code,  this should not be an issue, the config drive is attached on finish_migration (also called in case of a cold resize): [1]. This is included even in Kilo. The only reason why the instance wouldn't have the config drive attached is if it isn't required by the instance. Even then, there's the config option force_config_drive that can be set to True. Even if there is no config drive, metadata can still be fetched through the network. Reopen if I'm wrong in any way.\n\n@Li Wei, that's a bit strange. It is unrelated to the config drive though. There might a couple of reason why that happened: the neutron dhcp server didn't respond, or network issues, or the neutron-hyperv-agent was dead when you performed the resize, thus, the neutron ports were not bound to the VM's NICs.\n\n[1] https://github.com/openstack/nova/blob/master/nova/virt/hyperv/migrationops.py#L295", 
            "date_created": "2016-03-11 14:34:14.312861+00:00", 
            "author": "https://api.launchpad.net/1.0/~cbelu"
        }
    ], 
    "closed": "2016-03-11 14:34:24.579139+00:00"
}