{
    "status": "Incomplete", 
    "last_updated": "2017-06-27 15:58:55.374361+00:00", 
    "description": "Apologies for vague bug report but I think this should be reported anyway:\n\nWhen for some reason iSCSI attachment fails Cinder (or Nova) throws detailed iSCSI information including cloud internal Cinder volume IP address and volume details.\nObserved this while operating on Nova instances with Cinder volumes using Horizon.\nOpenStack Liberty or Mitaka.\n\nSuch detailed iSCSI message reported to end user through Horizon UI is considered as a security violation.", 
    "tags": [
        "openstack-version.liberty"
    ], 
    "importance": "Undecided", 
    "heat": 10, 
    "link": "https://bugs.launchpad.net/nova/+bug/1644554", 
    "owner": "None", 
    "id": 1644554, 
    "index": 7822, 
    "openned": "2017-05-24 15:42:18.390182+00:00", 
    "created": "2016-11-24 13:14:34.617414+00:00", 
    "title": "Cinder throws detailed iSCSI information in case of failure", 
    "comments": [
        {
            "content": "Apologies for vague bug report but I think this should be reported anyway:\n\nWhen for some reason iSCSI attachment fails Cinder throws detailed iSCSI information including cloud internal Cinder volume IP address and volume details.\nObserved this while operating on Nova instances with Cinder volumes using Horizon.\nOpenStack Liberty or Mitaka.\n\nSuch detailed iSCSI message reported to end user through Horizon UI is considered as a security violation.", 
            "date_created": "2016-11-24 13:14:34.617414+00:00", 
            "author": "https://api.launchpad.net/1.0/~aheczko-mirantis"
        }, 
        {
            "content": "Since this report concerns a possible security risk, an incomplete security advisory task has been added while the core security reviewers for the affected project or projects confirm the bug and discuss the scope of any vulnerability along with potential solutions.\n\nWhat are the information leaked with the volume details? Can you please provide an example error message with the relevant log detail to help us diagnose this issue?", 
            "date_created": "2016-11-24 23:08:52.664844+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "Adding cinder-coresec to triage this bug report.", 
            "date_created": "2017-03-15 02:37:46.358037+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "Volume attachments can fail at many different points.  They can fail in Cinder, Nova or os-brick.   Can we get some more specific information here that shows a stack trace with some filtered output?  If there is a place in os-brick that needs to be addressed, the stack will help me here.\n\nThe log files seems like an ok place to have this information dumped, or an admin will never be able to determine what went wrong.\n\nHorizon shouldn't ever show this error information.  Do we have screenshots of these examples?\n", 
            "date_created": "2017-03-15 16:15:20.387329+00:00", 
            "author": "https://api.launchpad.net/1.0/~walter-boring"
        }, 
        {
            "content": "This example message is displayed as pop up in Horizon, Mitaka release:\nError: Failed to perform requested operation on instance \"osbackup\", the instance has an error status: Please try again later [Error: Unexpected error while running command. Command: sudo nova-rootwrap /etc/nova/rootwrap.conf scsi_id --page 0x83 --whitelisted /dev/disk/by-path/ip-172.31.1.16:3260-iscsi-iqn.2010-10.org.openstack:volume-a0069ddf-f99d-48bf-932f-fe2ad5a7aa2e-lun-1 Exit code].   \n", 
            "date_created": "2017-03-17 15:06:07.111359+00:00", 
            "author": "https://api.launchpad.net/1.0/~aheczko-mirantis"
        }, 
        {
            "content": "While this pop up could be trimmed, I don't think it warrants an advisory nor to be kept private. I suggest a class C1 or D according to VMT's taxonomy ( https://security.openstack.org/vmt-process.html#incident-report-taxonomy ).\n", 
            "date_created": "2017-03-17 16:08:42.038834+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "If all that's being exposed is internal implementation architecture of the iSCSI environment and not sensitive credentials, I agree this looks like a security hardening opportunity. If nobody objects before Friday of this week, we should switch it to public.", 
            "date_created": "2017-03-20 14:19:24.714044+00:00", 
            "author": "https://api.launchpad.net/1.0/~fungi"
        }, 
        {
            "content": "no objection from me, agree with above two views. ", 
            "date_created": "2017-03-20 14:23:02.393664+00:00", 
            "author": "https://api.launchpad.net/1.0/~lhinds"
        }, 
        {
            "content": "Switched to public and closed the OSSA task based on above comments.\n", 
            "date_created": "2017-05-24 04:30:28.670439+00:00", 
            "author": "https://api.launchpad.net/1.0/~tristan-cacqueray"
        }, 
        {
            "content": "That horizon error message is bubbling up from Nova, so I think this would need to be addressed there to not include the underlying os-brick error details.", 
            "date_created": "2017-05-24 15:42:49.848797+00:00", 
            "author": "https://api.launchpad.net/1.0/~sean-mcginnis"
        }, 
        {
            "content": "What is an \"osbackup\" operation? Nova doesn't support creating backups of volume-backed instances so I don't think it would be that.\n\nI have no idea where this is failing in nova, especially if it's liberty or mitaka w/o logs. Are there details on a recreate here or some logs to help with this?\n\nIs Horizon pulling the 'fault' information out of the instance and exposing that? The fault should only be viewable for admins by default.\n\nI'm going to mark this as incomplete as I really need more information here about what was being done and logs if at all possible.", 
            "date_created": "2017-05-26 15:53:29.846785+00:00", 
            "author": "https://api.launchpad.net/1.0/~mriedem"
        }, 
        {
            "content": "Automatically discovered version liberty in description. If this is incorrect, please update the description to include 'nova version: ...'", 
            "date_created": "2017-06-27 15:58:53.409300+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }
    ]
}