{
    "status": "Confirmed", 
    "last_updated": "2016-02-12 13:01:22.008631+00:00", 
    "description": "I do a live-migration from host1 to host2. If during live migration nova-compute service stops operating it will leave things in messy state. Even when live migration ends successfully from hypervisor perspective, nova does not update VM's host to new one. It also leaves VIFs and volume connections on source host.\n\nnova list show that the instance is still active (actually it is because live migration has completed. However, nova loses track of a VM)\n\ntaget@liyong:~/devstack$ nova list\n+--------------------------------------+-------+--------+------------+-------------+----------------------+\n| ID                                   | Name  | Status | Task State | Power State | Networks             |\n+--------------------------------------+-------+--------+------------+-------------+----------------------+\n| 1d114104-9a62-49ba-b209-6a42beff4133 | test1 | ACTIVE | -          | NOSTATE     | private_net=10.0.0.9 |\n\n'nova show test1' shows that this instance is still on host1 (because service nova-compute on host1 crashed and it had no chance to update it).\n\nAfter that any nova operation on this instance fails because nova tries to execute every operation on old host (after such fail nova changes instance state to error).", 
    "tags": [
        "live-migration"
    ], 
    "importance": "Low", 
    "heat": 26, 
    "link": "https://bugs.launchpad.net/nova/+bug/1437154", 
    "owner": "None", 
    "id": 1437154, 
    "index": 1650, 
    "openned": "2015-03-27 05:29:30.418155+00:00", 
    "created": "2015-03-27 05:29:30.418155+00:00", 
    "title": "instance's host isn't updated if nova-compute stops operating during live-migration", 
    "comments": [
        {
            "content": "I do a live-migration from host1 to host2\nlive-migration successfully to but the instance's host is not set back to host2 yet before host1's nova-compute service crash(ctrl+c to stop it)\n\nnova list show that the instance is still active(actually , it is done the migration and I can see it host2 by virsh list)\n\ntaget@liyong:~/devstack$ nova list\n+--------------------------------------+-------+--------+------------+-------------+----------------------+\n| ID                                   | Name  | Status | Task State | Power State | Networks             |\n+--------------------------------------+-------+--------+------------+-------------+----------------------+\n| 1d114104-9a62-49ba-b209-6a42beff4133 | test1 | ACTIVE | -          | NOSTATE     | private_net=10.0.0.9 |\n\nshow this instance, the instance's host is still host1(due to host1's compute crashed an no chance to set it yet).\n\nafter that. do a reboot on this instance, failed due to the instance can not be found from host1 host(yes, it is)\n\nand nova set it to error status(but the instance is still running on host2)", 
            "date_created": "2015-03-27 05:29:30.418155+00:00", 
            "author": "https://api.launchpad.net/1.0/~taget-9"
        }, 
        {
            "content": "I think for this issue, currently there isn't any good solution sto fix this issue since the status is mainly controled by the source host,\nif source host is crashed/or be killed by mistake /or lose power.\n\nso, I am thinking if we can add some logic in periodic task to correct instance's state per compute's real state??\n", 
            "date_created": "2015-07-23 13:56:55.524537+00:00", 
            "author": "https://api.launchpad.net/1.0/~taget-9"
        }, 
        {
            "content": "Eli, \n\nYou  \"nova list\" the VM  on destination  host, did you do more actions to check  anything about the migrated VM works well?\n\nSo what do you expect?  Just update the  instance 's state on source host? ", 
            "date_created": "2015-07-29 02:40:20.346971+00:00", 
            "author": "https://api.launchpad.net/1.0/~shaohef"
        }, 
        {
            "content": "Shaohe, this issue is not only about instance's host not being updated in database. After successful live migration it also leaves volume connection open to both, source host and destination host. Basically it needs to run post live migration operations on source host and destination host.", 
            "date_created": "2015-08-10 10:44:38.988333+00:00", 
            "author": "https://api.launchpad.net/1.0/~pawel-koniszewski"
        }, 
        {
            "content": "yeah, pawel , you are right, so this  isn't a easy fix, what I am thinking about is we need a \"supervisor\" or \"task flow\" (maybe in conductor to watch the whole process of live-migration.", 
            "date_created": "2015-08-11 00:36:16.547211+00:00", 
            "author": "https://api.launchpad.net/1.0/~taget-9"
        }, 
        {
            "content": "another blue print is working on https://blueprints.launchpad.net/nova/+spec/manager-restart-during-migration", 
            "date_created": "2015-08-12 00:41:36.945525+00:00", 
            "author": "https://api.launchpad.net/1.0/~taget-9"
        }
    ]
}