{
    "status": "Invalid", 
    "last_updated": "2014-02-07 18:10:39.909450+00:00", 
    "description": "Using some special scheduler filter like SimpleCIDRAffinityFilter, JsonFilter.\nIf user pass in a invalid CIDR string (Using SimpleCIDRAffinityFilter); or invalid json (Using JsonFilter).nova will return 202, then going to schedule the instance. But the instance will go to ERROR, which will confuse user. The only way to debug\nwhy instance is ERROR is that ask sysadmin to check log of nova-scheduler to find\nout what happened.\n\nI have two work around in head.\n\n1. Return 400(bad request) when user pass in a invalid scheduler-hint. Means we need to let nova-api know which filters the scheduler is using, and using the validator of these filters to validate user request.\n2. Still let instance going to ERROR, but expose a API to user to check the reason why the instance is ERROR.\nNow there is a API named 'action-list', but not include the fault information about the instance.", 
    "tags": [
        "scheduler"
    ], 
    "importance": "Undecided", 
    "heat": 8, 
    "link": "https://bugs.launchpad.net/nova/+bug/1231890", 
    "owner": "None", 
    "id": 1231890, 
    "index": 4129, 
    "created": "2013-09-27 09:31:44.332651+00:00", 
    "title": "should report detail reason when passin invalid scheduler hint", 
    "comments": [
        {
            "content": "When using some special scheduler filter like SimpleCIDRAffinityFilter, JsonFilter.\nAnd user passin a invalid CIDR string (Using SimpleCIDRAffinityFilter); or invalid json (Using JsonFilter).\nnova will return 202, and going to schedule the instance. But the instance will go to ERROR, which will\nconfuse user.\n\nI have two work around in head.\n\n1. Return 400(bad request) when user passin a invalid scheduler-hint. Means we need to let nova-api know \n    which filters the scheduler is using, and using the validater of these filters to validate user request.\n2. Still let instance going to ERROR, but expose a API to user to check the reason why the instance is ERROR.\n    Because now there are a API named 'action-list', but some contains the faults information.", 
            "date_created": "2013-09-27 09:31:44.332651+00:00", 
            "author": "https://api.launchpad.net/1.0/~gtt116"
        }, 
        {
            "content": "Is the instance fault in the database?  If so, it's probably not showing up due to bug 1212915.", 
            "date_created": "2013-09-28 18:54:08.164190+00:00", 
            "author": "https://api.launchpad.net/1.0/~mriedem"
        }, 
        {
            "content": "This is just the expected behavior of the nova API right now.\n\nThere is an active blueprint right now where we're adding the concept of tasks to the API.  Hopefully this will give us a place in the API to provide better details about which part of the process failed, and why.", 
            "date_created": "2014-02-07 18:10:25.804799+00:00", 
            "author": "https://api.launchpad.net/1.0/~russellb"
        }
    ]
}