{
    "status": "Opinion", 
    "last_updated": "2014-10-01 18:05:22.068834+00:00", 
    "description": "The glance plugin tries to upload for invalid auth token.\nIn nova/image/glance, the X-Auth-Token is taken from the context, and passed on to upload. And in the upload_tarball method, the plugin starts to put the headers and upload the image, and only after all the chunks are uploaded it will receive an UnAuthorized response.\n\nSuggested fix:\nSuggested approach: Have a \"HEAD\" call made with the X-Auth-Token. If that returns a 401, then abandon the upload process.\nOtherwise, continue with the upload.", 
    "tags": [], 
    "importance": "Wishlist", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1238393", 
    "owner": "None", 
    "id": 1238393, 
    "index": 1431, 
    "created": "2013-10-11 04:08:22.357487+00:00", 
    "title": "Xenapi glance plugin should not try uploading when the auth token in invalid", 
    "comments": [
        {
            "content": "The glance plugin tries to upload for invalid auth token.", 
            "date_created": "2013-10-11 04:08:22.357487+00:00", 
            "author": "https://api.launchpad.net/1.0/~sridevik"
        }, 
        {
            "content": "Good catch, after talking with basha in irc I know you found this problem in LOG and can't exactly know of the scenarios which caused these, so IMO the first thinking is let's try to reproduce this issue and make sure what's root cause about it? and then make sure why nova using a wrong token to upload image? Is it just since image upload operation take a long time and token expired during the progress? Thanks.", 
            "date_created": "2013-10-11 10:00:10.514042+00:00", 
            "author": "https://api.launchpad.net/1.0/~lzy-dev"
        }, 
        {
            "content": "Zhi,\n\nOne of the common scenarios in which this occurs is when an image upload is retried.\nFor eg. \n1 Upload returns a 500 and raises a retry able error.\n2 While retrying, the auth token has expired. But, it's not identified before hand. Only after the whole upload process finishes, it raises a Unauthorised response.\n ", 
            "date_created": "2013-10-24 09:47:31.463307+00:00", 
            "author": "https://api.launchpad.net/1.0/~sridevik"
        }, 
        {
            "content": "\"Dead hack is a dead hack\" https://review.openstack.org/#/c/51132/\n", 
            "date_created": "2014-09-09 22:55:24.371215+00:00", 
            "author": "https://api.launchpad.net/1.0/~jogo"
        }, 
        {
            "content": "There is actually an ML thread now about the general architecture issue here. It's way more complicated than a simple bug and probably a bit change to keystone auth protocol", 
            "date_created": "2014-09-18 12:39:23.537429+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }, 
        {
            "content": "Change abandoned by Dan Prince (<email address hidden>) on branch: master\nReview: https://review.openstack.org/51132", 
            "date_created": "2014-10-01 18:05:20.804819+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }
    ]
}