{
    "status": "Expired", 
    "last_updated": "2016-07-05 09:54:29.065196+00:00", 
    "description": "Environment: OpenStack Juno release/Ubuntu 14.04/480 compute nodes/8 cloud controllers/40,000 instances +\n\nThe change made in:\n\n  https://github.com/openstack/nova/commit/baabab45e0ae0e9e35872cae77eb04bdb5ee0545\n\nswitches power state reporting from being a serial process for each instance on a hypervisor to being a parallel thread for every instance; for clouds running high instance counts, this has quite an impact on the conductor processes as they try to deal with N instance refresh calls in parallel where N is the number of instances running on the cloud.\n\nIt might be better to throttle this to a configurable parallel level so that period RPC load can be managed effectively in a larger cloud, or to continue todo this process in series but outside of the main thread.\n\nThe net result of this activity is that it places increase demands on the message broker, which has to deal with more parallel connections, and the conductors as they try to consume all of the RPC requests; if the message broker hits its memory high water mark it will stop publishers publishing any more messages until the memory usage drops below the high water mark again - this might not be achievable if all conductor processes are tied up with existing RPC calls try to send replies, resulting in a message broker lockup and collapse of all RPC in the cloud.", 
    "tags": [
        "juno", 
        "scale-testing"
    ], 
    "importance": "Undecided", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1388077", 
    "owner": "None", 
    "id": 1388077, 
    "index": 5252, 
    "created": "2014-10-31 12:58:29.949040+00:00", 
    "title": "Parallel periodic instance power state reporting from compute nodes has high impact on conductors and message broker", 
    "comments": [
        {
            "content": "The change made in:\n\n  https://github.com/openstack/nova/commit/baabab45e0ae0e9e35872cae77eb04bdb5ee0545\n\nSwitches power state reporting from being a serial process on each instance on a hypervisor to being a parallel thread for every instance; for clouds running high instance densities, this has quite an impact on the conductor processes as they try to deal with N instance refresh calls in parallel where N is the number of instances running on the cloud.\n\nIt might be better to throttle this to a configurable parallel level so that period RPC load can be managed effectively in a larger cloud, or to continue todo this process in series but outside of the main thread.", 
            "date_created": "2014-10-31 12:58:29.949040+00:00", 
            "author": "https://api.launchpad.net/1.0/~james-page"
        }, 
        {
            "content": "Fix proposed to branch: master\nReview: https://review.openstack.org/132263", 
            "date_created": "2014-10-31 14:24:28.247539+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Change abandoned by Joe Gordon (<email address hidden>) on branch: master\nReview: https://review.openstack.org/132263\nReason: This review is > 4 weeks without comment, and failed Jenkins the last time it was checked. We are abandoning this for now. Feel free to reactivate the review by pressing the restore button and leaving a 'recheck' comment to get fresh test results.", 
            "date_created": "2015-05-13 17:21:16.784663+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "\nThis is an automated cleanup. This bug report has been closed because it\nis older than 18 months and there is no open code change to fix this.\nAfter this time it is unlikely that the circumstances which lead to\nthe observed issue can be reproduced.\n\nIf you can reproduce the bug, please:\n* reopen the bug report (set to status \"New\")\n* AND add the detailed steps to reproduce the issue (if applicable)\n* AND leave a comment \"CONFIRMED FOR: <RELEASE_NAME>\"\n  Only still supported release names are valid (LIBERTY, MITAKA, OCATA, NEWTON).\n  Valid example: CONFIRMED FOR: LIBERTY\n", 
            "date_created": "2016-07-05 09:54:28.079673+00:00", 
            "author": "https://api.launchpad.net/1.0/~mzoeller"
        }
    ]
}