{
    "status": "Fix Released", 
    "last_updated": "2011-04-21 07:15:19.984958+00:00", 
    "description": "When the host is rebooted, all the guests disappear (at least when using libvirt + KVM)", 
    "tags": [], 
    "importance": "Medium", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/742115", 
    "owner": "None", 
    "id": 742115, 
    "index": 2326, 
    "created": "2011-03-24 22:29:21.995258+00:00", 
    "title": "Guests lost on host reboot", 
    "comments": [
        {
            "content": "When the host is rebooted, all the guests disappear (at least when using libvirt + KVM)", 
            "date_created": "2011-03-24 22:29:21.995258+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "Uh.. We talked about this earlier. To the best of my knowledge we agreed that this was exactly what was expected by consumers of the EC2 API and that we'd extend the metadata model to have a \"persistent\" flag of some sort for instances. What changed?", 
            "date_created": "2011-04-08 12:26:51.918641+00:00", 
            "author": "https://api.launchpad.net/1.0/~soren"
        }, 
        {
            "content": "I proposed the more complete patch, but it was too late in the cycle\nto get it accepted.\n\nSo I just did a bugfix that just did the minimal fix - it updates the\nstate of machines in the DB, if the host crashes it won't restart\nthem, but it won't delete them either so they're easy to bring back\nup.  There is a flag that lets you specify that you'd like guests to\nauto-restart if you want.\n\nSlow progress, but progress none the less.\n", 
            "date_created": "2011-04-08 16:55:48+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "I realise it's probably somewhat of a academic problem at this point, but if the instance is kept and charged for, an unknowing consumer of the EC2 api may be surprised to find that they're being charged for an intance that is shut off. Alternatively, if the provider chooses to not charge for intances in this state, ressources are spent on keeping them around, but cannot be charged for.\n\nI don't think I care enough to argue about this. I was just rather surprised to see a, to me, pretty significant (albeit intentional and, by some, desired) change in behaviour so late in the cycle.", 
            "date_created": "2011-04-08 20:50:15.175700+00:00", 
            "author": "https://api.launchpad.net/1.0/~soren"
        }, 
        {
            "content": "I believe that it was because it was so late in the cycle that we had\nto do the minimal fix.\n\nThe situation with libvirt was that machines would be deleted when the\nhost restarted (e.g. power loss, kernel update etc).  EC2 does that,\nRackspace doesn't, but irrespective we knew that it would hit some\npeople really hard.\n\nI agree that it would have been nice to have the flexibility to\naddress the issue more completely.\n", 
            "date_created": "2011-04-08 22:40:56+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }
    ]
}