{
    "status": "Opinion", 
    "last_updated": "2014-06-06 00:15:32.886568+00:00", 
    "description": "I have a use case which requires a Nova VM to have multiple interfaces in the same Quantum network.\n\nThe current Nova implementation does not allow that.\nThis happens regardless of whether network or port is specified. \n\nThis behavior is enforced by the code in nova/network/quantumv2/api.py", 
    "tags": [
        "nfv"
    ], 
    "importance": "Undecided", 
    "heat": 28, 
    "link": "https://bugs.launchpad.net/nova/+bug/1166110", 
    "owner": "https://api.launchpad.net/1.0/~hareesh-puthalath", 
    "id": 1166110, 
    "index": 3577, 
    "created": "2013-04-08 10:03:17.389079+00:00", 
    "title": "Multiple nics on same network not allowed", 
    "comments": [
        {
            "content": "I have a use case which requires a Nova VM to have multiple interfaces in the same Quantum network.\n\nThe current Nova implementation does not allow that.\nThis happens regardless of whether network or port is specified. \n\nThis behavior is enforced by the code in nova/network/quantumv2/api.py", 
            "date_created": "2013-04-08 10:03:17.389079+00:00", 
            "author": "https://api.launchpad.net/1.0/~hareesh-puthalath"
        }, 
        {
            "content": "Fix proposed to branch: master\nReview: https://review.openstack.org/26370", 
            "date_created": "2013-04-08 12:55:05.089013+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Responding here since that's what ijw-ubuntu requested.\n\nWhy do you want to do this? So to take the case of the controlplane and dataplane on the same network, you can just create two networks in quantum that both have the same interface as the output interface. So on the hyperwiser you have just eth0 that goes into the ovs-integration bridge that then the ovs flows take the 2 separate networks, and outputs them on the same physical network.\n\nThe argument against is really one of simplicity, the end user (the one spinning up instances) should not have to care about the underlying infrastructure, that is the responsibility of the cloud operator, ie the burden of setup is on the cloud operator to configure their hyperwisers and ovs/quantum appropriately to support the network configurations required by the images they support.\n\nNova currently does not support multiple interfaces on the same network. Its all up to the driver on how to interpret the network model, and explicitly disallowed by drivers that use the legacy format, so really this is a feature request that should be a blueprint not a bug, the discussion of the merits should probably move there.", 
            "date_created": "2013-04-10 20:06:59.671898+00:00", 
            "author": "https://api.launchpad.net/1.0/~jason-koelker"
        }, 
        {
            "content": "I could not have put it better myself. I have yet to see a use case which can't be solved with Openstack supported hypervisor configuration. Jason had a great comment in the merge proposition that I don't think he put in his comment above: \"Nova is a cloud system not a virtual datacenter\"", 
            "date_created": "2013-04-10 20:17:34.965029+00:00", 
            "author": "https://api.launchpad.net/1.0/~tr3buchet"
        }, 
        {
            "content": "this isn't in progress any more and this  more of a new feature then a bug per se.", 
            "date_created": "2014-06-06 00:15:32.218939+00:00", 
            "author": "https://api.launchpad.net/1.0/~jogo"
        }
    ]
}