{
    "status": "Invalid", 
    "last_updated": "2015-03-30 12:45:20.264235+00:00", 
    "description": "using nova.network.manager.FlatDHCPManager:\n\nfixed pool 192.168.0.0/24\nfloating-ip 9.3.11.240\n\ni create 2 VMs, both are assigned IPs from the fixed IP pool.  i assign one VM the 9.3.11.240 address from the floating pool.  from the host machine ((and the other VM)), i can ping and SSH to the VM on the 9.3.11.240 address.  However, on the machine which is assigned the 9.3.11.240 address I can't ping or ssh back to itself on that address.\n\nthis is a problem for some of the Bosh and Cloudfoundry applications who run services that may want to talk-back to themselves on the assigned floating ip.\n\n\nI'm running folsom on ubuntu 12.04.  i've attached my nova.conf.", 
    "tags": [], 
    "importance": "Low", 
    "heat": 26, 
    "link": "https://bugs.launchpad.net/nova/+bug/1076119", 
    "owner": "None", 
    "id": 1076119, 
    "index": 5603, 
    "created": "2012-11-07 20:20:40.798157+00:00", 
    "title": "VM can't connect to itself on it's own floating IP", 
    "comments": [
        {
            "content": "using nova.network.manager.FlatDHCPManager:\n\nfixed pool 192.168.0.0/24\nfloating-ip 9.3.11.240\n\ni create 2 VMs, both are assigned IPs from the fixed IP pool.  i assign one VM the 9.3.11.240 address from the floating pool.  from the host machine ((and the other VM)), i can ping and SSH to the VM on the 9.3.11.240 address.  However, on the machine which is assigned the 9.3.11.240 address I can't ping or ssh back to itself on that address.\n\nthis is a problem for some of the Bosh and Cloudfoundry applications who run services that may want to talk-back to themselves on the assigned floating ip.\n\n\nI'm running folsom on ubuntu 12.04.  i've attached my nova.conf.", 
            "date_created": "2012-11-07 20:20:40.798157+00:00", 
            "author": "https://api.launchpad.net/1.0/~lameleopard"
        }, 
        {
            "content": "", 
            "date_created": "2012-11-07 20:20:40.798157+00:00", 
            "author": "https://api.launchpad.net/1.0/~lameleopard"
        }, 
        {
            "content": "I was helping brad troubleshoot the issue. \n\nThe problem was fixed by changing the 'nova-network-float-snat' rule in iptables from:\n\nSNAT       all  --  any    eth0    192.168.0.8          anywhere             to:9.3.11.224\n\n\nTo\n\nSNAT       all  --  any    any 192.168.0.8          anywhere             to:9.3.11.224\n\nAfter this change I was able to SSH, curl, etc to the floating IP for the instance, from inside the instance OS. \n\nSo this seems like a problem with the firewall rules that nova-network puts in place", 
            "date_created": "2012-11-07 20:25:53.124806+00:00", 
            "author": "https://api.launchpad.net/1.0/~locke105"
        }, 
        {
            "content": "Yeah, I don't think that changing from a specific interface to any is a reasonable approach. That could cause traffic that's destined for another private bridge or network to be SNAT'd to something we don't want.\n\nIf anything, I think that a new NAT rule to rewrite traffic destined for the floating IP back to the private one would be better, although that gets a little icky.\n\nImportance-wise, this seems like it would only affect situations where the host itself is running part of the application-layer bits, so I'd tend to rank it fairly low. Any sort of agent-like functionality running on the host itself should understand the networking topology and be using the private IP addresess, right?", 
            "date_created": "2012-11-09 17:25:35.161584+00:00", 
            "author": "https://api.launchpad.net/1.0/~danms"
        }, 
        {
            "content": "Well, I have a bunch of setups from Essex that rely on an instance being able to talk to itself on the floating IP...\n\nThis was where I got the idea to change the 'out' interface on the firewall rule. In Essex it uses 'any'. I need to do some research into originally why this was changed.", 
            "date_created": "2012-11-09 19:54:24.422420+00:00", 
            "author": "https://api.launchpad.net/1.0/~locke105"
        }, 
        {
            "content": "This new configuration causes issues with some of the Windows installations I have. Most notably Exchange. I wonder what the correct solution would be.", 
            "date_created": "2013-01-14 17:15:29.472698+00:00", 
            "author": "https://api.launchpad.net/1.0/~bolke-de-bruin"
        }, 
        {
            "content": "This seems to be a regression from: https://bugs.launchpad.net/nova/+bug/933640 , which also describes the reasons why this should work. I'm using the work around to nat the packet when it goes to itself, but I'm not sure if that is the right approach.", 
            "date_created": "2013-01-17 22:31:48.101312+00:00", 
            "author": "https://api.launchpad.net/1.0/~bolke-de-bruin"
        }, 
        {
            "content": "Hi,\n\nIm facing problem in assigning the floating ip to VM's created by users. I tried setting the auto assign floating ip function but it seem to not work. The floating ip option in dashboard does not show any ip to be selected. Please advice on how i can solve this issue.", 
            "date_created": "2013-03-02 13:25:57.537644+00:00", 
            "author": "https://api.launchpad.net/1.0/~ddmax90"
        }, 
        {
            "content": "This bit me trying to run devstack on a vm and access the nova api from outside the vm network. devstack uses the same ip to go in the keystone catalog and do some local install operations. Is this problem also in neutron?", 
            "date_created": "2013-07-24 15:59:26.488690+00:00", 
            "author": "https://api.launchpad.net/1.0/~david-kranz"
        }, 
        {
            "content": "I don't have this issue, when I create an instance and and assign a floating ip. I can ping the floating ip from within the instance. Verified this with the latest devstack.", 
            "date_created": "2013-11-14 04:52:26.543540+00:00", 
            "author": "https://api.launchpad.net/1.0/~sammiestoel"
        }, 
        {
            "content": "Very old bug that seems to not have a current reproduce. Putting to invalid for now, it's definitely not triaged.", 
            "date_created": "2015-03-30 12:45:18.742281+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }
    ]
}