{
    "status": "Invalid", 
    "last_updated": "2012-09-27 14:58:21.970113+00:00", 
    "description": "Currently the Create Flavor dialog in the SysPanel has an editable Flavor ID field.  It should not be displayed.\n\n=====UPDATE (gabriel)=====\n\nAs per conversation with Vish on IRC: The reason the flavor ID field is exposed is because it's really a misnomer. The \"id\" field there is not the internal auto-incremented ID for the flavor, but in fact a user-facing reference ID. It is editable so that an admin can \"delete\" (set delete=1 in the DB) a flavor and replace it with a new flavor of the same id, thereby allowing the admin to effectively \"replace\" a flavor without disassociating the flavor from existing instances.\n\nAs such, the best UX Horizon can offer is to cheat, and make the behavior described above an \"edit\" interface which does a delete-and-create-with-same-id behind the scenes. The create form can then simply auto-generate an ID and hide the field.", 
    "tags": [], 
    "importance": "Undecided", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/952657", 
    "owner": "None", 
    "id": 952657, 
    "index": 2675, 
    "created": "2012-03-12 01:18:13.123799+00:00", 
    "title": "Create Flavor dialog should not have a Flavor ID field", 
    "comments": [
        {
            "content": "Currently the Create Flavor dialog in the SysPanel has an editable Flavor ID field.  It should not be displayed.", 
            "date_created": "2012-03-12 01:18:13.123799+00:00", 
            "author": "https://api.launchpad.net/1.0/~devcamcar"
        }, 
        {
            "content": "Flavor ID is a required field which used to initialize to a blank value, however, to improve the UX we are now providing an ID on the client-side by taking the highest flavor ID and adding 1. Not sure why flavor ID isn't handled by nova, however, that's another conversation. Are you sure we want to remove the field given given that this is something we are calculating? The use case would be: a user creates a flavor with ID 100 via the CLI even though there are only 5 other flavors with IDs 1-5. If a user tries to create a new flavor via the UI the flavor will have an ID of 101 (instead of 6) and the user will have no way of changing that (if the field is hidden).\n\nThoughts?", 
            "date_created": "2012-03-12 01:31:37.981641+00:00", 
            "author": "https://api.launchpad.net/1.0/~tres"
        }, 
        {
            "content": "In that case, I'd consider this a bug in nova first and horizon second.  I have marked this bug as affecting nova as well.  I don't have any idea why Flavor IDs would be handled differently than everything else in nova?", 
            "date_created": "2012-03-12 01:36:02.457341+00:00", 
            "author": "https://api.launchpad.net/1.0/~devcamcar"
        }, 
        {
            "content": "This doesn't seem like an RC blocker.", 
            "date_created": "2012-03-13 17:42:16.426181+00:00", 
            "author": "https://api.launchpad.net/1.0/~tres"
        }, 
        {
            "content": "Definitely not a blocker. If we want to do anything with it for the RC, we can make the field either non-editable or hidden.", 
            "date_created": "2012-03-13 18:07:38.664480+00:00", 
            "author": "https://api.launchpad.net/1.0/~gabriel-hurley"
        }, 
        {
            "content": "For previous stated reasons I would prefer not to hide this field until the underlying assignment is fixed. Let's punt.", 
            "date_created": "2012-03-13 21:08:08.716475+00:00", 
            "author": "https://api.launchpad.net/1.0/~tres"
        }, 
        {
            "content": "ID should not be editable.  Allowing them to edit this behavior and modify the primary key directly is ugly at best and a security vulnerability at worst.\n\nWhat happens if you change it to the PK of an existing flavor? \n\nIt seems quite impractical to have to even consider these questions.  I suggest we hide the field entirely from the new flavor screen.\n\nNormally I wouldn't consider something like this a release blocker, but this behavior is quite inelegant and is too clumsy to call a final version. ", 
            "date_created": "2012-03-14 00:35:30.825718+00:00", 
            "author": "https://api.launchpad.net/1.0/~devcamcar"
        }, 
        {
            "content": "^^^ \nTL;DR: Hide the flavor ID field from new flavor creation in essex.  When nova solves this issue, we'll fix it properly for folsom.", 
            "date_created": "2012-03-14 00:36:16.842241+00:00", 
            "author": "https://api.launchpad.net/1.0/~devcamcar"
        }, 
        {
            "content": "Just found Gabriel's edited notes in the case.  Given it's the case that Flavor ID does not represent the actual row id from nova, I'm happy to leave this implementation as is for essex.", 
            "date_created": "2012-03-14 00:39:10.209195+00:00", 
            "author": "https://api.launchpad.net/1.0/~devcamcar"
        }, 
        {
            "content": "This is related to blueprint https://blueprints.launchpad.net/horizon/+spec/edit-flavor-ui for Horizon and probably can be untargeted from Nova.", 
            "date_created": "2012-04-05 19:51:21.001641+00:00", 
            "author": "https://api.launchpad.net/1.0/~gabriel-hurley"
        }, 
        {
            "content": "Moving to folsom-2 to match blueprint", 
            "date_created": "2012-05-10 01:27:10.207856+00:00", 
            "author": "https://api.launchpad.net/1.0/~gabriel-hurley"
        }, 
        {
            "content": "My understanding is that nothing needs to be done on Nova's side anymore... Please set back to New or confirmed if you disagree.", 
            "date_created": "2012-06-07 09:30:25.303828+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "Bumping to F3 to match the associated blueprint.", 
            "date_created": "2012-06-26 19:02:12.551445+00:00", 
            "author": "https://api.launchpad.net/1.0/~gabriel-hurley"
        }, 
        {
            "content": "Fix for horizon: https://review.openstack.org/#/c/11254/", 
            "date_created": "2012-08-13 04:31:42.235565+00:00", 
            "author": "https://api.launchpad.net/1.0/~gabriel-hurley"
        }
    ]
}