{
    "status": "Confirmed", 
    "last_updated": "2017-06-23 16:31:31.716870+00:00", 
    "description": "Steps to reproduce:\n\n1. Boot a VM from the volume\n2. Shutoff the VM\n3. Try to migrate the volume between different storages of the same type  (cinder retype with --migration-policy on-demand )\n4. The process fails in Nova with the libvirt error in blockRebase, because libvirt can't find a VM instance.\n\nExpected result:\n\nThe volume should move to another storage.", 
    "tags": [
        "libvirt", 
        "volumes"
    ], 
    "importance": "Low", 
    "heat": 28, 
    "link": "https://bugs.launchpad.net/nova/+bug/1454252", 
    "owner": "None", 
    "id": 1454252, 
    "index": 463, 
    "created": "2015-05-12 13:19:18.311719+00:00", 
    "title": "Support volume retype (volume migration) of attached volumes when VM is inactive", 
    "comments": [
        {
            "content": "Steps to reproduce:\n\n1. Boot a VM from the volume\n2. Shutoff the VM\n3. Try to migrate the volume between different storages of the same type  (cinder retype with --migration-policy on-demand )\n4. The process fails in Nova with the libvirt error in blockRebase, because libvirt can't find a VM instance.\n\nExpected result:\n\nThe volume should move to another storage.", 
            "date_created": "2015-05-12 13:19:18.311719+00:00", 
            "author": "https://api.launchpad.net/1.0/~sgotliv"
        }, 
        {
            "content": "Today when Cinder understands that the volume is attached to VM it calls Nova's\nswap_volume feature to migrate a volume. The problem is that swap_volume uses libvirt's blockRebase which fails if libvirt doesn't find a VM and that's exactly what happens in this case because VM is shutoff so the qemu process for this VM doesn't exist.\n\nIn order to fix it we probably have to change the flow. Nova should detect that VM is off and instead of calling blockRebase it has to attach a new volume to compute node and perform simple copy (dd) as Cinder does in generic case. Once it done, Nova must update a path to the new volume in all relevant places. Important to mention that VM must be locked during the process to prevent the user to run it.", 
            "date_created": "2015-05-12 13:21:14.495398+00:00", 
            "author": "https://api.launchpad.net/1.0/~sgotliv"
        }, 
        {
            "content": "[Some notes from an IRC discussion with Virt developers Dan Berrange,  Matthew Booth and\nPeter Krempa.]\n\nlibvirt's 'blockRebase' API works only (and that's not a bug) when the\nguest is online -- the main functionality of blockRebase is that it\nallows the guest to concurrently read/write while the copy is taking\nplace. So the behavior of libvirt (blockRebase API, to be precise)\nthrowing an error when it doesn't see a running domain (guest) is\nexpected.\n\n  - It is pointless to allow blockRebase to work when a guest is\n    offline, because one can use more efficient methods like `dd` (or\n    similar) to perform a copy.\n\n  - Matthew Booth tried to explore an idea where libvirt driver could\n    try to create an ephemeral (transient) domain (guest in libvirt's\n    parlance) to do a block migration. To However that's might not be\n    acceptable in a 'Cloud environment', rationale from libvirt\n    developers:\n\n      - Creating a guest consumes resources from the host whic his not\n        acceptable if the guest is supposed to be shutoff. We've\n        previously rejected this as an approach for migrating offline\n        guests for this reason.\n\n      - Allowing blockRebase to work offline probably will require to\n        spawn a instance of QEMU anyway, so it will be rather ugly to\n        implement.\n", 
            "date_created": "2015-05-12 15:41:46.128336+00:00", 
            "author": "https://api.launchpad.net/1.0/~kashyapc"
        }
    ]
}