{
    "status": "Invalid", 
    "last_updated": "2015-04-01 14:31:13.630580+00:00", 
    "description": " I ran a few tests, and here’s the results:\n\n \n\nLower-case key-pair name with no dash and no number in the name:  success\n\nLower-case key-pair name with dash and no number in the name:  success\n\nLower-case key-pair name with dash and number in the name: success\n\nUpper-case key-pair name with no dash and no number in the name: success\n\nUpper-case key-pair name with dash and no number in the name: success\n\nUpper-case key-pair name with dash and number in the name:  fail\n\n \n\nCombinations tested:  keytest, key-test, key-test1, KeyTest, Key-Test, Key-Test1, Intel-Test2\n\n \n\nLooks like I ran across the only combination that fails reliably.", 
    "tags": [
        "access", 
        "failure", 
        "key-pair"
    ], 
    "importance": "Undecided", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1417814", 
    "owner": "None", 
    "id": 1417814, 
    "index": 5420, 
    "created": "2015-02-03 23:33:51.840128+00:00", 
    "title": "Login to a Nova Compute Instance using an SSL Key FAILS if the Key File Name contains dashes and numbers", 
    "comments": [
        {
            "content": " I ran a few tests, and here’s the results:\n\n \n\nLower-case key-pair name with no dash and no number in the name:  success\n\nLower-case key-pair name with dash and no number in the name:  success\n\nLower-case key-pair name with dash and number in the name: success\n\nUpper-case key-pair name with no dash and no number in the name: success\n\nUpper-case key-pair name with dash and no number in the name: success\n\nUpper-case key-pair name with dash and number in the name:  fail\n\n \n\nCombinations tested:  keytest, key-test, key-test1, KeyTest, Key-Test, Key-Test1, Intel-Test2\n\n \n\nLooks like I ran across the only combination that fails reliably.", 
            "date_created": "2015-02-03 23:33:51.840128+00:00", 
            "author": "https://api.launchpad.net/1.0/~bmathews-l"
        }, 
        {
            "content": "Bruce,\n\nIs there any error in any of the logs?\n\nthanks,\ndims", 
            "date_created": "2015-02-04 01:47:21.124737+00:00", 
            "author": "https://api.launchpad.net/1.0/~dims-v"
        }, 
        {
            "content": "Hi Dims,\n\nUnfortunately, I do not have access to log information, but below is the information from the customer on the email thread:\n\nThanks very much.  That’s what I thought, and I tried that username, but I keep getting “Permission denied” when I try to ssh to a new instance.\n\nI tried to start a new instance with Unbuntu 12.04 to see if that might work for me.  I used the same key-pair that I had been using for my RHEL 6.6 instances, and I got the same error message (Permission denied).\n\nI used the –vvv option every time I was unable to login to each instance.  It never showed any hint of why the permission was denied.\n\nThis is all of the information that I was provided except for the tests that succeeded and failed...\n\nThe Best!\n\nBruce", 
            "date_created": "2015-02-04 04:48:30.255964+00:00", 
            "author": "https://api.launchpad.net/1.0/~bmathews-l"
        }, 
        {
            "content": "Bruce, i just setup a fresh devstack on a brand new machine and tried the scenarios. I can't recreate the problem unfortunately.\n\nIntel-Test2 and Intel-Test2X work fine. fyi, the guest vm(s) were fedora20. the devstack uses config drives (and not nova metadata service).\n\nCan't help without more information :(\n\nthanks,\ndims", 
            "date_created": "2015-02-04 19:41:49.508863+00:00", 
            "author": "https://api.launchpad.net/1.0/~dims-v"
        }
    ]
}