{
    "status": "Opinion", 
    "last_updated": "2015-03-30 12:39:37.343614+00:00", 
    "description": "cleanup_running_deleted_instances should likely be refactored so that said function is not needed in the first place, since in a ideal world an instance does not have the capability to be running when it is deleted (said deletion should fail in that case).", 
    "tags": [], 
    "importance": "Wishlist", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1173430", 
    "owner": "None", 
    "id": 1173430, 
    "index": 1357, 
    "created": "2013-04-26 23:59:03.940656+00:00", 
    "title": "cleanup_running_deleted_instances should not be needed", 
    "comments": [
        {
            "content": "cleanup_running_deleted_instances should likely be refactored so that said function is not needed in the first place, since in a ideal world an instance does not have the capability to be running when it is deleted (said deletion should fail in that case).", 
            "date_created": "2013-04-26 23:59:03.940656+00:00", 
            "author": "https://api.launchpad.net/1.0/~harlowja"
        }, 
        {
            "content": "running_deleted_instances is also connected to this :(", 
            "date_created": "2013-04-27 00:00:31.782707+00:00", 
            "author": "https://api.launchpad.net/1.0/~harlowja"
        }, 
        {
            "content": "What about the case where the compute node is offline when the instance is deleted? Wouldn't we end up with the hypervisor being out of sync (and therefore needing cleanup) in that case?", 
            "date_created": "2013-05-08 05:48:49.167351+00:00", 
            "author": "https://api.launchpad.net/1.0/~mikal"
        }, 
        {
            "content": "So that case is a very interesting one, lets say that if a running compute node never gets out of sync, due to some conductor or elsewhere making sure that when it is running that tasks that get requested of said compute node happen in a transcational manner (so therefore they happen or don't). \n\nNow if its offline and an instance is deleted, it almost seems like in said transcational world that it shouldn't be possible to perform that delete (since said delete would have transcational logic) operation in the first place. Likely there would need to be a 2 phase commit on said delete to ensure this. Having said logic would ensure that you can't delete vm's until a hypervisor/compute node has acknowledged the deletion. A compute node being offline would be unable to 'ack' and would therefore not allow deletion. ", 
            "date_created": "2013-05-09 06:20:17.216734+00:00", 
            "author": "https://api.launchpad.net/1.0/~harlowja"
        }
    ]
}