{
    "status": "Expired", 
    "last_updated": "2016-12-06 20:09:58.426711+00:00", 
    "description": "I've been experiencing dangerous issue that my backing files located on shared storage in _base folder are being removed by nova-compute. It's being happen on Juno, Kilo and Liberty releases. The shared storage mount /var/lib/nova/instances are configured on NFSv3. Backing image ids exists in /var/lib/nova/instances/locks/ folder for affected files. I don't know for sure, how the mechanism preventing _base files from deletion works - if it depends on locks folder or if it depends on locking files on shared storage, but from my point of view this is bug by design and the mechanism should be redesigned to not rely on client which is actually compute node. It causes many impacts on stability and security of users data!\nI want to ask for considering some new cleaning system, because current cleaning worker is designed for indepenent compute nodes without shared storage and it looks like it was not well adapted for configurations with shared storage. Maybe developers should consider some central mechanism and fetching data about used and unused _base files from database, not relying what is running on not on compute node locally.\nI can't reproduce this problem anymore because I had to disable cleaning unused base images and deploy own, secure worker.", 
    "tags": [
        "compute", 
        "image-cache", 
        "libvirt", 
        "nfs"
    ], 
    "importance": "Undecided", 
    "heat": 12, 
    "link": "https://bugs.launchpad.net/nova/+bug/1620341", 
    "owner": "None", 
    "id": 1620341, 
    "index": 6414, 
    "created": "2016-09-05 14:52:42.171489+00:00", 
    "title": "Removing unused base images removes backing files of active instances", 
    "comments": [
        {
            "content": "I've been experiencing dangerous issue that my backing files located on shared storage in _base folder are being removed by nova-compute. It's being happen on Juno, Kilo and Liberty releases. The shared storage mount /var/lib/nova/instances are configured on NFSv3. Backing image ids exists in /var/lib/nova/instances/locks/ folder for affected files. I don't know for sure, how the mechanism preventing _base files from deletion works - if it depends on locks folder or if it depends on locking files on shared storage, but from my point of view this is bug by design and the mechanism should be redesigned to not rely on client which is actually compute node. It causes many impacts on stability and security of users data!\nI want to ask for considering some new cleaning system, because current cleaning worker is designed for indepenent compute nodes without shared storage and it looks like it was not well adapted to configurations with shared storage. Maybe developers should consider some central mechanism and fetching data about used and unused _base files from database, not relying what is running on not on compute node locally.\nI can't reproduce this problem anymore because I had to disable cleaning unused base images and deploy own, secure worker.", 
            "date_created": "2016-09-05 14:52:42.171489+00:00", 
            "author": "https://api.launchpad.net/1.0/~jacolex"
        }, 
        {
            "content": "There's not a lot to go on here, unfortunately. The problem of image cache manager deleting things that are still in use is well known, and in fact we have workarounds elsewhere in the code for it. Out of interest I'd be curious to know how this impacts users, because it also means that the workaround code is broken and/or incomplete.\n\nThe underlying problem is obviously image cache manager itself. Without anything more specific to go on I can throw up a patch which fixes a couple of races I was vaguely aware of but hadn't gotten round to addressing. I can't guarantee it will fix your problem, but it might.", 
            "date_created": "2016-09-06 15:30:58.229760+00:00", 
            "author": "https://api.launchpad.net/1.0/~mbooth-9"
        }, 
        {
            "content": "So, I was answering this in the context of master, but looking again at change I376cc951922c338669fdf3f83da83e0d3cea1532, that didn't land until Mitaka, and you only mention up to Liberty. There's a decent chance that's the specific issue you're hitting. You'll have to upgrade to get it though, obviously.", 
            "date_created": "2016-09-06 15:52:56.488796+00:00", 
            "author": "https://api.launchpad.net/1.0/~mbooth-9"
        }, 
        {
            "content": "Backport was rejected here: https://review.openstack.org/#/c/278928/", 
            "date_created": "2016-09-06 15:53:59.507141+00:00", 
            "author": "https://api.launchpad.net/1.0/~mbooth-9"
        }, 
        {
            "content": "Some races fixed in this patch: https://review.openstack.org/366239\n\nAs above, though, I suspect your problem is more likely to be resolved by change I376cc951.", 
            "date_created": "2016-09-07 09:27:51.442658+00:00", 
            "author": "https://api.launchpad.net/1.0/~mbooth-9"
        }, 
        {
            "content": "Given the problem is related to Liberty, and possible resolution could have been made by Mitaka, could you please try to reproduce the problem with ideally the master branch (or at least Newton) to see whether the problem is still existing ?\n", 
            "date_created": "2016-09-07 10:14:09.349559+00:00", 
            "author": "https://api.launchpad.net/1.0/~sylvain-bauza"
        }, 
        {
            "content": "Ok, I'll try to reproduce problem on the Newton branch", 
            "date_created": "2016-09-07 11:23:24.619488+00:00", 
            "author": "https://api.launchpad.net/1.0/~jacolex"
        }, 
        {
            "content": "[Expired for OpenStack Compute (nova) because there has been no activity for 60 days.]", 
            "date_created": "2016-11-07 04:17:28.229657+00:00", 
            "author": "https://api.launchpad.net/1.0/~janitor"
        }, 
        {
            "content": "Change abandoned by Michael Still (<email address hidden>) on branch: master\nReview: https://review.openstack.org/366239\nReason: This patch has been sitting unchanged for more than 12 weeks. I am therefore going to abandon it to keep the nova review queue sane. Please feel free to restore the change if you're still working on it.", 
            "date_created": "2016-12-06 20:09:57.448131+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }
    ]
}