{
    "status": "Fix Released", 
    "last_updated": "2016-01-21 17:59:43.439389+00:00", 
    "description": "Instance name set in horizon is not set in VMware vCenter. In vCenter the name of the instance is the id (in UUID format) of the instance. This makes it difficult for the administrator to locate the instance in vCenter using the name displayed in horizon.", 
    "tags": [
        "vmware"
    ], 
    "importance": "Medium", 
    "heat": 40, 
    "link": "https://bugs.launchpad.net/nova/+bug/1330873", 
    "owner": "https://api.launchpad.net/1.0/~garyk", 
    "id": 1330873, 
    "index": 3929, 
    "created": "2014-06-17 08:33:08.167046+00:00", 
    "title": "Instance name set in horizon is not set in VMware vCenter", 
    "comments": [
        {
            "content": "Instance name set in horizon is not set in VMware vCenter. In vCenter the name of the instance is the id (in UUID format) of the instance. This makes it difficult for the administrator to locate the instance in vCenter using the name displayed in horizon.", 
            "date_created": "2014-06-17 08:33:08.167046+00:00", 
            "author": "https://api.launchpad.net/1.0/~kiran-kumar-vaddi"
        }, 
        {
            "content": "This issue was discussed on IRC and the decision was to\n1. Have the name in <name>-<uuid> format\n2. Make this a configurable option\n3. Add a docImpact flag and add adequate documentation\n4. Since vCenter allows instances with only unique names, there will not be additional checks introduced in the driver. Instead the task will fail if the instance with the same name exists.", 
            "date_created": "2014-06-17 08:36:07.246303+00:00", 
            "author": "https://api.launchpad.net/1.0/~kiran-kumar-vaddi"
        }, 
        {
            "content": "@Kiran,\n\nSeems like older versions ended up truncating the vm names at least the directory names to 32 chars. Are these restrictions no longer applicable to 5.x?\n\nhttp://kb.vmware.com/selfservice/microsites/search.do?cmd=displayKC&externalId=2051649\n\nthanks,\ndims", 
            "date_created": "2014-06-17 13:13:47.657288+00:00", 
            "author": "https://api.launchpad.net/1.0/~dims-v"
        }, 
        {
            "content": "@Davanum Srinivas,\n\nThe KB indicates that the name restriction has been increased to 80 characters starting from vCenter versions 5.0.\nFor vCenter versions before 5.0, it is 32 characters. So for vCenters 4.x the <name>-<uuid> might not be the solution for all versions, just having the <name> should be fine for both versions", 
            "date_created": "2014-06-17 15:38:27.335530+00:00", 
            "author": "https://api.launchpad.net/1.0/~kiran-kumar-vaddi"
        }, 
        {
            "content": "My concern with this is that the name needs to be unique on the ESX. In Nova the name does not need to be unique. There may be cases, real edge cases, that the user chooses long names and these have the same prefix.\nThis will cause an error when creating the config spec. ", 
            "date_created": "2014-06-19 12:04:41.331483+00:00", 
            "author": "https://api.launchpad.net/1.0/~garyk"
        }, 
        {
            "content": "i think we would like this change in kilo  - as customers have all complained about this. If multiple instances are booted, the name is already be <name>-<uuid>, so we need to check for this and only append the uuid if it is not already there.\n\nKiran are you still going to work on this?  It's not been updated since june.  If you are not, please let someone else take this.  ", 
            "date_created": "2014-11-06 12:59:51.277571+00:00", 
            "author": "https://api.launchpad.net/1.0/~tjones-i"
        }, 
        {
            "content": "https://review.openstack.org/#/c/166608/", 
            "date_created": "2015-03-30 14:44:06.276122+00:00", 
            "author": "https://api.launchpad.net/1.0/~garyk"
        }, 
        {
            "content": "I'm concerned about this behavior. If the instance name must be unique, and it's truncated at any level, then if we specify the display_name as long enough, we can cause a name clash in vmware. I understand that conventional vmware ops are used to seeing human-readable names in vcenter, but this is cloud. It's one thing if we set the display_name in metadata somewhere for tracking, but the unique bits should be generated, and are for the other drivers AFAIK. IMHO, we should use nothing other than the uuid for the instance name.", 
            "date_created": "2015-03-30 14:55:33.746406+00:00", 
            "author": "https://api.launchpad.net/1.0/~danms"
        }, 
        {
            "content": "I think the point of using UUID for instance names is probably spot on. Marking as Opinion, because it seems like for consistency it should be done that way.", 
            "date_created": "2015-03-30 14:57:35.030609+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }, 
        {
            "content": "This is a very sensitive issue for customers, so I really would like to see it solved. \n\nAbout the trunking problem, if the limit is 80 characters that means it will be possible to create instance with names up to 43 characters... who would give so long name to instances?\n\nIn any case this is not a good reason to ignore the issue: a simple solution could be a check on resulting name length and force a trunking of the <name> part while keeping the <uuid> part untouched.", 
            "date_created": "2015-04-29 11:51:20.880050+00:00", 
            "author": "https://api.launchpad.net/1.0/~pasquale-porreca"
        }, 
        {
            "content": "FYI, we are targeting this for Mitaka with the following blueprint: https://blueprints.launchpad.net/nova/+spec/vmware-better-display-names", 
            "date_created": "2015-10-06 10:23:37.833637+00:00", 
            "author": "https://api.launchpad.net/1.0/~rgerganov"
        }, 
        {
            "content": "Reviewed:  https://review.openstack.org/166608\nCommitted: https://git.openstack.org/cgit/openstack/nova/commit/?id=47e3a4e96189486b53d3f8f0aac0ea56931adac8\nSubmitter: Jenkins\nBranch:    master\n\ncommit 47e3a4e96189486b53d3f8f0aac0ea56931adac8\nAuthor: Gary Kotton <email address hidden>\nDate:   Sun Mar 22 06:57:09 2015 -0700\n\n    VMware: improve instance names on VC\n    \n    Up until now the instance name of the VM on the VC was the UUID of\n    the instance. This is very confusing for administrators and they\n    would like some context for the VM.\n    \n    This will now be:\n     <display-name> (<instance-uuid>)\n    \n    Once the the instance is created we will perform a rename. The reason\n    for this is that the disks are all stored under a folder on the datastore\n    that has the name of the instance UUID.\n    \n    NOTE: this is only for the display on the VC. The search for the VM's\n          is done via the instanceUUID configured on the VM. If that fails\n          then the nvp.uuid extra spec is used for the search.\n    \n    This completed the blueprint vmware-better-display-names\n    \n    Closes-bug: #1330873\n    \n    Change-Id: Ibeb000f4c1d88fa296390143b0cf98e05e735086\n", 
            "date_created": "2016-01-21 17:59:42.901116+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }
    ]
}