{
    "status": "Invalid", 
    "last_updated": "2011-03-14 13:38:18.423833+00:00", 
    "description": "The OpenStack 1.0 API specification says that \"Content-Encoding: gzip\" is supported for requests and responses to the OpenStack API. Currently we don't do anything with Content-Encoding or Accept-Encoding, which is breaking the current API specification.\n\nFrom the specification:\n\nRequest and response body data may be encoded with gzip compression in order to\naccelerate interactive performance of API calls and responses. This is controlled using the\nAccept-Encoding header on the request from the client and indicated by the Content-\nEncoding header in the server response. Unless the header is explicitly set, encoding defaults\nto disabled.", 
    "tags": [], 
    "importance": "Medium", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/726569", 
    "owner": "https://api.launchpad.net/1.0/~blamar", 
    "id": 726569, 
    "index": 2296, 
    "created": "2011-02-28 14:55:13.125751+00:00", 
    "title": "gzip content encoding", 
    "comments": [
        {
            "content": "The OpenStack 1.0 API specification says that \"Content-Encoding: gzip\" is supported for requests and responses to the OpenStack API. Currently we don't do anything with Content-Encoding or Accept-Encoding, which is breaking the current API specification.\n\nFrom the specification:\n\nRequest and response body data may be encoded with gzip compression in order to\naccelerate interactive performance of API calls and responses. This is controlled using the\nAccept-Encoding header on the request from the client and indicated by the Content-\nEncoding header in the server response. Unless the header is explicitly set, encoding defaults\nto disabled.", 
            "date_created": "2011-02-28 14:55:13.125751+00:00", 
            "author": "https://api.launchpad.net/1.0/~blamar"
        }, 
        {
            "content": "I don't know that the correct place to have this feature is in Python. Many installations/deployments of OpenStack will be behind proxies such as Nginx and Apache. Both Nginx and Apache can provide this functionality much more efficiently than I will be able to with the simple implementation I have chosen.\n\nOptions:\n1) Rackspace and anyone else will be able to provide gzip compatibility to meet spec through proxies such as Apache/Nginx.\n\n2) Implement gzip compression as middleware in Nova, but don't implement streaming gzip support. All input and output would need to be buffered into memory, compressed, and returned. I believe this breaks PEP-333 spec (http://www.python.org/dev/peps/pep-0333/#middleware-handling-of-block-boundaries).\n\n3) Implement gzip compression as middleware in Nova and support streaming. This implementation is quite complicated and could very well block other features from getting into the API. I don't believe this feature to be a critical one, so I could see this being taken out of the OpenStack API and be deployment-oriented.\n\nAnyone give me a thought one way or the other?", 
            "date_created": "2011-03-01 19:33:36.448526+00:00", 
            "author": "https://api.launchpad.net/1.0/~blamar"
        }, 
        {
            "content": "Beware that \"Opinion\" is a closing status in LP, so it basically makes your bug disappear from the lists :) I've set it back to \"Incomplete\" so that it stays open until you get the external opinion you're looking for. You can also raise the question in the open discussion at the team meeting, or as a mailing-list thread...", 
            "date_created": "2011-03-01 20:32:33.677116+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "After asking the mailing list and conferring with others, this sort of thing is best handled at another level (other than the nova code base).", 
            "date_created": "2011-03-14 13:38:17.429445+00:00", 
            "author": "https://api.launchpad.net/1.0/~blamar"
        }
    ]
}