{
    "status": "Fix Released", 
    "last_updated": "2012-09-27 15:38:06.314546+00:00", 
    "description": "These changes should be included in RC (for a reason see first comments to https://review.openstack.org/4906 ):\n\nhttps://review.openstack.org/4937\nhttps://review.openstack.org/4961\nhttps://review.openstack.org/5316\nhttps://review.openstack.org/4499", 
    "tags": [], 
    "importance": "Wishlist", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/956457", 
    "owner": "None", 
    "id": 956457, 
    "index": 1219, 
    "created": "2012-03-15 21:17:19.251492+00:00", 
    "title": "Code cleanups, HACKING compliance  before RC", 
    "comments": [
        {
            "content": "These changes should be included in RC (for a reason see first comments to https://review.openstack.org/4906 ):\n\nhttps://review.openstack.org/4937\nhttps://review.openstack.org/4961\nhttps://review.openstack.org/5316\nhttps://review.openstack.org/4499", 
            "date_created": "2012-03-15 21:17:19.251492+00:00", 
            "author": "https://api.launchpad.net/1.0/~yorik-sar"
        }, 
        {
            "content": "Not convinced (again) that the last days before release are the time for large non-bugfix changes. If that landed two weeks ago, that would have been ~ok, but now is really not the time to risk regression just for cosmetic reasons.", 
            "date_created": "2012-03-15 22:19:38.847460+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "And, once again, we can get a lot of merging trouble if we land it after release. The point is not only a good look, but also an easier support for this code that should become an LTS.\n\nActually, everything is almost merged:\nhttps://review.openstack.org/4961 - just made it\nhttps://review.openstack.org/4937 - needed only an approve, all +1s were gathered\nhttps://review.openstack.org/5316 - Joe seemed to be almost convinced, and I believe will be with new patchset, needs only a higher bless\nhttps://review.openstack.org/4499 - had 2 core +1s but Johannes declined it before there were the previous one around\n\nAnd one more pro: these changes touch code very slightly, but the third one enforces lots of good rules. There is no point for regression left, all too scary parts have been merged already.", 
            "date_created": "2012-03-15 22:41:37.832013+00:00", 
            "author": "https://api.launchpad.net/1.0/~yorik-sar"
        }, 
        {
            "content": "I regret that this \"too scary parts\" patch went in.\n\nThere is *always* a regression risk when you push a patch. When you are a few days before release, the benefit of simplifying future backports  is completely outweighed by that risk. That's why ONLY BUGFIXES should be allowed in now.\n\nAs release manager, it is my job to enforce those rules. There was a time in the cycle for such changes. That's the previous 5 months.\n\nI understand that it's frustrating for you given the level of effort that was put in this, but the rules are there to try to increase the chances of having a successful release. Every exception to the rule decreases the likeliness of a successful outcome.", 
            "date_created": "2012-03-16 10:59:16.495730+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "I don't understand why there's more merging trouble if it lands after release?\n\nI also don't think this is a good idea. Every change carries a risk of regressions.  We should be focusing on bug fixing, nothing else. I applaud the effort, I really do, but this is not the right time for it.\n", 
            "date_created": "2012-03-16 11:07:46.715858+00:00", 
            "author": "https://api.launchpad.net/1.0/~soren"
        }, 
        {
            "content": "The one with \"scary parts\" from this series is https://review.openstack.org/4906\nIt has landed a while ago (9 days now), so if there were any regressions, they're already caught and processed.\n\nWhy these changes can not give any regression to other code (in the order in the description):\n\n1. Touches only HACKING.rst and tools/hacking.py that are in no way referenced from anywhere except optional flag for run_tests.sh\n2. Touches only comments and nothing else (landed yesterday).\n3. Switches from pep8 call to tools/hacking.py call, has impact on gate but not on other code.\n4. Touches localized strings and one test, no possible impact on other code.\n\nI still believe that these changes can not make problems and can be treated as bugfixes (noncompliance with HACKING is a bug, not a feature).", 
            "date_created": "2012-03-16 11:21:54.530236+00:00", 
            "author": "https://api.launchpad.net/1.0/~yorik-sar"
        }, 
        {
            "content": "I still stand by my general rule, but maybe you're right that some of them are self-contained enough to be granted an EXCEPTION to the rule :) I'll review them in more detail.\n\nThe devil is in the details though: changing localized strings may be safe, but doing it at this point breaks the work of translators and doc writers, for example. Those need as much stability as they can get.", 
            "date_created": "2012-03-16 11:39:36.991885+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "Looking closely at the localization \"fix\", I see that after Johannes' effort my change changes only 4 localization strings: two in bin/nova-all, one in nova/api/validator.py and one in tools/esx/guest_tool.py. Other changes are just syntactical. So the central point of that change is in  moving l12n testing to the static checker (where it should take place).\n\nSoren,\nfor example, some changes that were introduced in https://review.openstack.org/4906 change the way to access some classes so if we backport code that uses \"new\" way to the \"old\" branch, there obviously will appear non-obvious merge conflicts or test failures.", 
            "date_created": "2012-03-16 12:06:15.253880+00:00", 
            "author": "https://api.launchpad.net/1.0/~yorik-sar"
        }, 
        {
            "content": "Oh, right, *backporting* is more difficult. I see what you mean. I don't really see how that's unique to this (sort of) change(s), though.", 
            "date_created": "2012-03-16 12:33:36.696321+00:00", 
            "author": "https://api.launchpad.net/1.0/~soren"
        }, 
        {
            "content": "Ok, all changes landed after the release.", 
            "date_created": "2012-04-10 19:16:45.741408+00:00", 
            "author": "https://api.launchpad.net/1.0/~yorik-sar"
        }
    ]
}