{
    "status": "Fix Released", 
    "last_updated": "2011-02-07 13:55:05.586036+00:00", 
    "description": "Looks like we now need to run manually \"nova-manage db sync\" to initially create the database. Ideally that would automatically be taken care of by the Ubuntu packaging.", 
    "tags": [
        "ubuntu"
    ], 
    "importance": "High", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/705073", 
    "owner": "None", 
    "id": 705073, 
    "index": 333, 
    "created": "2011-01-19 19:25:42.455467+00:00", 
    "title": "Ubuntu packaging should create DB automatically", 
    "comments": [
        {
            "content": "Looks like we now need to run manually \"nova-manage db sync\" to initially create the database. Ideally that would automatically be taken care of by the Ubuntu packaging.", 
            "date_created": "2011-01-19 19:25:42.455467+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "I'm not sure if this is the right solution.  We currently require users to create admin users manually and get images manually.  It isn't a huge burden to have them initialize the database as well,  and it might prevent some misconfiguration.  The current approach we are using for testing at anso is to have the packaging not start the services by default (via a setting /etc/default/nova-common), so a user would be responsible for creating the db and then enabling and running the services.  This is a bit of extra work, but it ensures services aren't trampling on each other and creating databases silently.\n\nVish\n\nOn Jan 19, 2011, at 11:25 AM, Thierry Carrez wrote:\n\n> Public bug reported:\n> \n> Looks like we now need to run manually \"nova-manage db sync\" to\n> initially create the database. Ideally that would automatically be taken\n> care of by the Ubuntu packaging.\n> \n> ** Affects: nova\n>     Importance: Undecided\n>         Status: New\n> \n> ** Affects: nova (Ubuntu)\n>     Importance: Undecided\n>         Status: New\n> \n> ** Also affects: nova (Ubuntu)\n>   Importance: Undecided\n>       Status: New\n> \n> -- \n> You received this bug notification because you are a member of Nova Bug\n> Team, which is subscribed to OpenStack Compute (nova).\n> https://bugs.launchpad.net/bugs/705073\n> \n> Title:\n>  Ubuntu packaging should create DB automatically\n> \n> Status in OpenStack Compute (Nova):\n>  New\n> Status in “nova” package in Ubuntu:\n>  New\n> \n> Bug description:\n>  Looks like we now need to run manually \"nova-manage db sync\" to\n>  initially create the database. Ideally that would automatically be\n>  taken care of by the Ubuntu packaging.\n> \n> \n\n", 
            "date_created": "2011-01-19 19:58:43+00:00", 
            "author": "https://api.launchpad.net/1.0/~vishvananda"
        }, 
        {
            "content": "Currently the packaging starts up the services at install-time, which leads to tons of error messages in logs. You are right that one way to fix it is to *not* start services at install-time and document the need to initialize the DB. That can be done using some START=0 in /etc/default/nova that the upstart jobs would source.\r\n\r\nThat's not the Debian way though: if possible, we should just initialize a local DB (in the debian maintainer scripts in packaging) and start the services.\r\n\r\nIn all cases, we need to change the way it currently works :)", 
            "date_created": "2011-01-20 08:15:52.256688+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "How about changing this to a documentation bug? Pointing out in the wiki/docs that we need to create those tables as a first step would suffice.\nAlso, it'd be nice if we added a command to nova.sh tool to create them, something like \"./nova.sh db-sync\" .\nThoughts?", 
            "date_created": "2011-01-20 08:19:56.764488+00:00", 
            "author": "https://api.launchpad.net/1.0/~rcarrillocruz"
        }, 
        {
            "content": "[ sidenote: we also need to decide where we put bugs that affect Ubuntu packaging of Nova. It's not really a nova bug (and most nova-core devs can't fix it), but it's not a bug in Ubuntu either, since they don't carry the package in official archives. A separate project sounds a bit overkill... So far I've been opening two tasks, but maybe we should just keep it in Nova with a specific official tag. ]", 
            "date_created": "2011-01-20 08:21:09.880562+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "Oh, and ofc, nova.sh should also not drop the database every time is launched, otherwise the tables created \"nova-manage db sync\" will disappear.", 
            "date_created": "2011-01-20 08:29:20.334112+00:00", 
            "author": "https://api.launchpad.net/1.0/~rcarrillocruz"
        }, 
        {
            "content": "2011/1/19 Vish Ishaya <email address hidden>:\n> I'm not sure if this is the right solution.  We currently require users\n> to create admin users manually and get images manually.  It isn't a huge\n> burden to have them initialize the database as well,\n\nComments about slippery slopes aside, the difference here is that the\ndaemons will fail to start and  respawn at a very high rate until the\nDB is created. I don't really see the danger in creating the database\nin the packaging on the initial install. Packages should generally\ncome with a usable, safe default config and be enabled by default. The\ndefault config doesn't interfere with existing system services or the\nsurrounding network.\n\n-- \nSoren Hansen <email address hidden>\nSystems Architect, The Rackspace Cloud\nUbuntu Developer\n", 
            "date_created": "2011-01-20 10:32:33+00:00", 
            "author": "https://api.launchpad.net/1.0/~soren"
        }, 
        {
            "content": "On Thu, Jan 20, 2011 at 5:32 AM, Soren Hansen <email address hidden> wrote:\n> 2011/1/19 Vish Ishaya <email address hidden>:\n>> I'm not sure if this is the right solution.  We currently require users\n>> to create admin users manually and get images manually.  It isn't a huge\n>> burden to have them initialize the database as well,\n>\n> Comments about slippery slopes aside, the difference here is that the\n> daemons will fail to start and  respawn at a very high rate until the\n> DB is created. I don't really see the danger in creating the database\n> in the packaging on the initial install. Packages should generally\n> come with a usable, safe default config and be enabled by default. The\n> default config doesn't interfere with existing system services or the\n> surrounding network.\n\nAs discussed with Vish yesterday on IRC, I share Soren's opinion on this one.\n\n-jay\n", 
            "date_created": "2011-01-20 15:57:15+00:00", 
            "author": "https://api.launchpad.net/1.0/~jaypipes"
        }, 
        {
            "content": "I'm confused about how this would work for a multi-node setup.  Which package would create the database, and how would you be sure it wasn't installed on every node?  Would there be a debconf flag that would tell it to not install the database for some nodes?", 
            "date_created": "2011-01-20 19:56:18.855167+00:00", 
            "author": "https://api.launchpad.net/1.0/~xtoddx"
        }, 
        {
            "content": "I would assume that it would work the same way as any other package\nthat can be installed on multiple nodes:\n\n* Install the database on the node as if the installation is only on this node\n* Admin goes and edits the configuration file to point, say, the\ndatabase to a central location\n* Admin restarts services\n\n-jay\n\nOn Thu, Jan 20, 2011 at 2:56 PM, Todd Willey <email address hidden> wrote:\n> I'm confused about how this would work for a multi-node setup.  Which\n> package would create the database, and how would you be sure it wasn't\n> installed on every node?  Would there be a debconf flag that would tell\n> it to not install the database for some nodes?\n>\n> --\n> You received this bug notification because you are a member of Nova Bug\n> Team, which is subscribed to OpenStack Compute (nova).\n> https://bugs.launchpad.net/bugs/705073\n>\n> Title:\n>  Ubuntu packaging should create DB automatically\n>\n", 
            "date_created": "2011-01-20 20:26:58+00:00", 
            "author": "https://api.launchpad.net/1.0/~jaypipes"
        }, 
        {
            "content": "I've added a snippet to nova-common's postinst that creates the database if it's a fresh install.\nI haven't sorted out upgrades yet, but I expect it'll involve checking if there's an sql_connection set in nova.conf. If so, show a help screen explaining that a db sync is needed and that it has to be synced between the components that share the data store. If no custom sql_connection is set, just do the upgrade.\n\nI need to add a way to check if an upgrade is due, though. I only want to be showing the help text if there's actually an upgrade that needs to be done.", 
            "date_created": "2011-01-20 21:18:37.057979+00:00", 
            "author": "https://api.launchpad.net/1.0/~soren"
        }, 
        {
            "content": "Soren, that sounds like a reasonable solution to me.", 
            "date_created": "2011-01-20 23:30:45.967032+00:00", 
            "author": "https://api.launchpad.net/1.0/~jaypipes"
        }
    ]
}