{
    "status": "Invalid", 
    "last_updated": "2014-09-17 12:23:03.941911+00:00", 
    "description": "When using XEN over libvirt, emulated network drivers (rtl8139,e1000) will not work as the interface name is too long.\n\nBy default XEN when running VMs in HVM creates two interfaces on host system:\n\nvifX.X (for PV drivers)\nvifX.X-emu (for emulated drives)\n\n-emu suffix combined with 14 characters long tap interface name is too long for a linux system and it results that vifX.X-emu can't be renamed to openstack standard.\n\nAdditionally openstack expects tap interface to be without -emu suffix and all security groups settings will not also cover this interface (even if we will shortcut its name).", 
    "tags": [], 
    "importance": "Undecided", 
    "heat": 16, 
    "link": "https://bugs.launchpad.net/nova/+bug/1202199", 
    "owner": "None", 
    "id": 1202199, 
    "index": 3853, 
    "created": "2013-07-17 13:40:49.536323+00:00", 
    "title": "Emulated network driver is not working when using xen over libvirt", 
    "comments": [
        {
            "content": "When using XEN over libvirt emulated network drives (rtl8139,e1000) will not work as the interface name is to long.\n\nBy default XEN when running VMS in HVM creates two interfaces on host system:\n\nvifX.X (for PV drivers)\nvifX.X-emu (for emulated drives)\n\n-emu suffix combined with 14 characters long tap interface name is to long for a linux system and it results that vifX.X-emu can't be renamed to openstack standard.\n\nAdditionally openstack excpects tap interface to be without -emu suffix and all security groups settings will not also cover this interface (even if we will shortcut it's name).", 
            "date_created": "2013-07-17 13:40:49.536323+00:00", 
            "author": "https://api.launchpad.net/1.0/~tpaszkowski"
        }, 
        {
            "content": "Fix proposed to branch: master\nReview: https://review.openstack.org/37477", 
            "date_created": "2013-07-17 13:56:03.754097+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Fix proposed to branch: master\nReview: https://review.openstack.org/37547", 
            "date_created": "2013-07-17 18:26:01.875727+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "I got some valuable info on this from our resident Xen / libvirt\nexpert Jim Fehlig:\n\nFor better or worse, Xen defers preferred network device selection to\nthe guest OS in the case of HVM domains.  The Xen toolstack will\ncreate both emulated and PV devices, and let the guest OS decide which\nto use.  If the guest OS contains an appropriate PV driver, it will\nclaim the device and tell qemu to unplug the emulated one.  If the\nguest OS has no appropriate PV driver, the PV device will be ignored\nas unkown/unconfigured hardware, but the guest will still have a\nnetwork device via the emulated one.  This is all fine except when it\ncomes to device naming.  Only one device name can be specified in the\ndomain configuration, from which two devices are created internally -\nhence the *-emu device.\n\nSome would argue this a user-friendly approach accommodating guest\nOSes that have no PV driver.  Others would argue that this approach\nwreaks havoc higher toolstacks that should determine such policy.\nMost OSes have PV device drivers these days, but it may not be\npossible to change this default behavior since there are many older\nHVM configs in the wild with a model-less vif, e.g.\n\n    vif=[ 'mac=aa:bb:cc:dd:ee:ff,bridge=br0', ]\n\nwhere the guest OS does not have PV drivers.  Providing only the PV\ndevice, avoiding the *-emu one, would break networking in such guests.\n\nBTW, sounds as though nova generates a maximum length vif name, which\nXen exceeds by appending '-emu'.  Is that correct?  Hmm, not to mention\nbreaking any filtering rules based on the nova generated name...\n\nJim is open to any suggestions on ways to fix this in the Xen\ntoolstack without introducing regressions.  This issue should\ndisappear with the move to Xen's new libxl toolstack, where these\ntypes of policy decisions have been removed.\n\nJim also pointed out that the only good reason *not* to prefer using\nthe PV network device is if the guest OS has no driver for it.", 
            "date_created": "2013-10-29 14:17:28.449144+00:00", 
            "author": "https://api.launchpad.net/1.0/~adam.spiers"
        }, 
        {
            "content": "It seems that the maximum size allowed in Linux is 16:\n\n  #define IFNAMSIZ        16\n\n  -- http://lxr.linux.no/linux+v3.11.6/include/uapi/linux/if.h#L26\n\nso I think the question becomes, why do we need tap interface names which are 14  bytes long in the first place?", 
            "date_created": "2013-10-29 14:53:48.421442+00:00", 
            "author": "https://api.launchpad.net/1.0/~adam.spiers"
        }, 
        {
            "content": "Related patch https://review.openstack.org/#/c/37477/4 ", 
            "date_created": "2014-07-10 01:05:38.263621+00:00", 
            "author": "https://api.launchpad.net/1.0/~jogo"
        }, 
        {
            "content": "I think this is an upstream xen issue and it's not clear we should be working around it based on the patch commentary", 
            "date_created": "2014-09-17 12:23:03.007272+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }
    ]
}