{
    "status": "Invalid", 
    "last_updated": "2014-09-08 11:57:41.725676+00:00", 
    "description": "When a certificate is revoked (using nova-manage for example), a new payload with an updated crl is not generated.  This means that the cloudpipe vpn will need to be restarted to to pick up new information.\n\nThe revoke should update the user data with a new payload.  That way the cloudpipe instance can periodically check for a new crl and update it.  This would allow revokation without needing to restart the vpn.", 
    "tags": [
        "network"
    ], 
    "importance": "Wishlist", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/757772", 
    "owner": "None", 
    "id": 757772, 
    "index": 1043, 
    "created": "2011-04-11 17:16:04.411011+00:00", 
    "title": "Cloudpipe doesn't update the crl in userdata when a cert is revoked", 
    "comments": [
        {
            "content": "When a certificate is revoked (using nova-manage for example), a new payload with an updated crl is not generated.  This means that the cloudpipe vpn will need to be restarted to to pick up new information.\n\nThe revoke should update the user data with a new payload.  That way the cloudpipe instance can periodically check for a new crl and update it.  This would allow revokation without needing to restart the vpn.", 
            "date_created": "2011-04-11 17:16:04.411011+00:00", 
            "author": "https://api.launchpad.net/1.0/~vishvananda"
        }, 
        {
            "content": "For anyone interested in picking this up, see the code in pipelib.py:launch_vpn_instance()\n\nThe crl is included in a base64 zipfile stuff into user_data. The idea is to regenerate the user_data when you do a 'nova-manage user revoke'\n\nIt's a little odd, because I don't think we allow user_data to be changed anywhere else post-launch", 
            "date_created": "2012-02-02 16:00:25.662958+00:00", 
            "author": "https://api.launchpad.net/1.0/~markmc"
        }, 
        {
            "content": "I've been trying to get to the point where cloudpipes can be done separately.  They currently require four sets of special code:\n\na) relaxed security rules (spoofing ips for machines on the other end of the vpn)\n\nI think we could do this with a special list of images to relax spoofing rules.  Administrator has to be careful to disable ssh login for users on these machines so they probably have to ignore injected files as well\n\nb) port forward from network host\n\nThis may not be required since you can use floating ips, but it might be nice to expose some port forwarding magic to an admin api\n\nc) cert retrieval\n\nThis is in with the cert refactor\n\nd) cert revokation\n\nI think we can expose this in an admin api.  It is supported internally\n\ne) crl retrieval\n\n(relevant to this bug) We can expose this directly to metadata instead of the hacky updating of a zipfile.\n\nAll of these will go into a blueprint for F  ", 
            "date_created": "2012-02-06 17:38:24.742747+00:00", 
            "author": "https://api.launchpad.net/1.0/~vishvananda"
        }, 
        {
            "content": "looks like we don't have any \"cloudpipe\" code in Nova any more. marking as invalid", 
            "date_created": "2014-09-08 11:57:30.453596+00:00", 
            "author": "https://api.launchpad.net/1.0/~dims-v"
        }
    ]
}