{
    "status": "Invalid", 
    "last_updated": "2013-03-14 21:49:12.267617+00:00", 
    "description": "If a baremetal deployment operation is interrupted, the nova.compute_nodes record may stop receiving updates. If the user subsequently issues \"nova delete <uuid>\",  servicegroup_api.service_is_up() will return False and nova.compute.api will call _local_delete() instead of calling down to driver.destroy().", 
    "tags": [
        "baremetal"
    ], 
    "importance": "Undecided", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1117783", 
    "owner": "https://api.launchpad.net/1.0/~devananda", 
    "id": 1117783, 
    "index": 3387, 
    "created": "2013-02-06 23:01:33.477301+00:00", 
    "title": "baremetal driver.destroy might not be called", 
    "comments": [
        {
            "content": "Description\n----------------\nIf a baremetal deployment operation is interrupted and the nova instance is marked as deleted, it is possible that the baremetal node is left in a bad state -- it remains associated to an instance UUID that has been deleted, and can not be provisioned again. There is presently no way to remedy this, short of running mysql commands by hand, eg.: mysql nova_bm -e \"update bm_nodes set uuid=NULL where id=X\". \n\n\nProposed solution\n-------------------------\nI'm not clear on why the nova instance's error state isn't being propagated to the baremetal driver. Figuring that out may lead to a solution.\n\nAnother option would be to add an extra check in resource_tracker.py:update_available_resource which finds nodes that have a deleted instance uuid assigned to them, and then updates the bm_nodes record by clearing the instance uuid. This seems like a good thing to do anyway.", 
            "date_created": "2013-02-06 23:01:33.477301+00:00", 
            "author": "https://api.launchpad.net/1.0/~devananda"
        }, 
        {
            "content": "Setting this to Incomplete. Many bugs in the baremetal deploy process were fixed before grizzly-3. This needs to be verified again.", 
            "date_created": "2013-02-26 23:46:14.082874+00:00", 
            "author": "https://api.launchpad.net/1.0/~devananda"
        }
    ]
}