{
    "status": "Expired", 
    "last_updated": "2016-07-05 09:41:25.512810+00:00", 
    "description": "network/model.py converts new-style models to old ones.\n\nWhen it's trying to identify the IP address of a DHCP server, it uses the DHCP server address, if set, and the gateway if not.  DHCP filtering is only turned off completely (i.e. all DHCP packets are denied) if neither a DHCP server nor a gateway are set.\n\nThere's no documentation of this functionality in the code, so I don't know why it's there.  However, I believe the DHCP server address should always be set to the correct address and, if it's unset, then there is no DHCP server  - so the fallback should be removed from the code.  (I'd appreciate someone confirming that.)\n\nThis bug will affect the libvirt driver (which at present uses legacy()-style models) and anything that uses virt/firewall.py (which converts new models to legacy form).", 
    "tags": [], 
    "importance": "Undecided", 
    "heat": 8, 
    "link": "https://bugs.launchpad.net/nova/+bug/1045248", 
    "owner": "None", 
    "id": 1045248, 
    "index": 3074, 
    "created": "2012-09-03 09:52:45.222249+00:00", 
    "title": "dhcp server defaults to gateway for filtering when unset", 
    "comments": [
        {
            "content": "network/model.py converts new-style models to old ones.\n\nWhen it's trying to identify the IP address of a DHCP server, it uses the DHCP server address, if set, and the gateway if not.\n\nThere's no documentation of this functionality in the code, so I don't know why it's there.  However, I believe the DHCP server address should always be set to the correct address and, if it's unset, then there is no DHCP server  - so the fallback should be removed from the code.  (I'd appreciate someone confirming that.)\n\nThis bug will affect the libvirt driver (which at present uses legacy()-style models) and anything that uses virt/firewall.py (which converts new models to legacy form).", 
            "date_created": "2012-09-03 09:52:45.222249+00:00", 
            "author": "https://api.launchpad.net/1.0/~ijw-ubuntu"
        }, 
        {
            "content": "The line of code you reference was added in this commit, which isn't specific to adding the gateway fallback:\n\n\ncommit 345439f86a9ac8bd95cc7f382a3890d86f794b62\nAuthor: Trey Morris <email address hidden>\nDate:   Fri Mar 30 10:14:08 2012 -0500\n\n    update xen to use network_model\n    \n    blueprint xenapi-network-info-model\n    \n    updated xenapi to use the new network info models\n    \n    also:\n    updated virt firewall to handle both old version and new hotness\n    made a few minor changes to the network info model\n    moved the legacy converstion shim from compute/utils to the model itself\n    wharrgarbl'd a few of the tests\n    \n    NOTE: no unittests were skipped during the creation of this patch\n    \n    Change-Id: Ib77dd2bf4f0a525b73800441f19013e842c77f98\n\n\nThe fallback does seem kind of odd to me at first glance, but I haven't dug into in great detail.  I'll confirm the bug since this does seem worth looking into and determining whether it is really desirable.", 
            "date_created": "2012-09-17 18:38:35.387547+00:00", 
            "author": "https://api.launchpad.net/1.0/~russellb"
        }, 
        {
            "content": "\nThis is an automated cleanup. This bug report has been closed because it\nis older than 18 months and there is no open code change to fix this.\nAfter this time it is unlikely that the circumstances which lead to\nthe observed issue can be reproduced.\n\nIf you can reproduce the bug, please:\n* reopen the bug report (set to status \"New\")\n* AND add the detailed steps to reproduce the issue (if applicable)\n* AND leave a comment \"CONFIRMED FOR: <RELEASE_NAME>\"\n  Only still supported release names are valid (LIBERTY, MITAKA, OCATA, NEWTON).\n  Valid example: CONFIRMED FOR: LIBERTY\n", 
            "date_created": "2016-07-05 09:41:24.884333+00:00", 
            "author": "https://api.launchpad.net/1.0/~mzoeller"
        }
    ]
}