{
    "status": "Invalid", 
    "last_updated": "2011-04-12 15:26:32.241748+00:00", 
    "description": "Setting up nova-common (2011.2~gamma2~bzr978-0ubuntu0ppa1~lucid1) ...\n\nConfiguration file `/etc/nova/nova.conf'\n ==> Modified (by you or by a script) since installation.\n ==> Package distributor has shipped an updated version.\n   What would you like to do about it ?  Your options are:\n    Y or I  : install the package maintainer's version\n    N or O  : keep your currently-installed version\n      D     : show the differences between the versions\n      Z     : background this process to examine the situation\n The default action is to keep your current version.\n*** nova.conf (Y/I/N/O/D/Z) [default=N] ?\n\nSince this is a configuration file, this should likely not occur. It makes it difficult to handle via puppet and other automated means.", 
    "tags": [], 
    "importance": "Undecided", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/758170", 
    "owner": "None", 
    "id": 758170, 
    "index": 2108, 
    "created": "2011-04-11 22:45:23.232210+00:00", 
    "title": "nova-common package tries to update /etc/nova/nova.conf", 
    "comments": [
        {
            "content": "Setting up nova-common (2011.2~gamma2~bzr978-0ubuntu0ppa1~lucid1) ...\n\nConfiguration file `/etc/nova/nova.conf'\n ==> Modified (by you or by a script) since installation.\n ==> Package distributor has shipped an updated version.\n   What would you like to do about it ?  Your options are:\n    Y or I  : install the package maintainer's version\n    N or O  : keep your currently-installed version\n      D     : show the differences between the versions\n      Z     : background this process to examine the situation\n The default action is to keep your current version.\n*** nova.conf (Y/I/N/O/D/Z) [default=N] ?\n\nSince this is a configuration file, this should likely not occur. It makes it difficult to handle via puppet and other automated means.", 
            "date_created": "2011-04-11 22:45:23.232210+00:00", 
            "author": "https://api.launchpad.net/1.0/~rlane"
        }, 
        {
            "content": "On 04/11/2011 05:45 PM, Ryan Lane wrote:\n> Configuration file `/etc/nova/nova.conf'\n>  ==> Modified (by you or by a script) since installation.\n>  ==> Package distributor has shipped an updated version.\n>    What would you like to do about it ?  Your options are:\n>     Y or I  : install the package maintainer's version\n>     N or O  : keep your currently-installed version\n>       D     : show the differences between the versions\n>       Z     : background this process to examine the situation\n>  The default action is to keep your current version.\n> *** nova.conf (Y/I/N/O/D/Z) [default=N] ?\n> \n> Since this is a configuration file, this should likely not occur. It\n> makes it difficult to handle via puppet and other automated means.\n\nSince this is a configuration file, the package *did not* overwrite your\nexisting configuration and asked for your attention to look at the\ndifferences, etc.\n\nAlthough I am not sure what the changes were in the default\nconfiguration files, sometimes it is necessary to update config files to\ninclude new and different environment variables, or new and different\naccepted options, etc.  While your old configuration file might work\nfine with a newer version of the software, sometimes this is not the\ncase and the system administrator *needs* to review those changes and\ntake appropriate action.\n\nIf you are automating deployments, then you did see this in your staging\nenvironment, right?\n\nFor a quickie (I've done this many times after seeing trivial config\nprompts like this), echo \"N\\n\" to your run to answer the question.\n\nFor how to never get prompted (at your own risk), take a look at the\nnice article Raphael Hertzog wrote on the topic - it should give you\ngood understanding of what is happening and a couple ideas for making\nthe system do what you want:\n\nhttp://raphaelhertzog.com/2010/09/21/debian-conffile-configuration-file-managed-by-dpkg/\n\ndpkg did the right thing in your example - it did not hose your\nconfiguration.  My suggestion is that this bug be closed - it's the\nsystem administrator's job to understand this dpkg behavior and act\naccordingly.\n\n-- \nKind regards,\nMichael\n", 
            "date_created": "2011-04-11 23:05:05+00:00", 
            "author": "https://api.launchpad.net/1.0/~mshuler"
        }, 
        {
            "content": "Puppet does not give you options on how to handle dpkg, as far as I know. This behavior is out of the ordinary for packages, btw. For instance, I've never seen this occur with Apache configuration. It is essentially *never* correct to overwrite a config file. You shouldn't even ask. It should be assumed the administrator has read the upgrade guide before upgrading, and will adjust their configuration file accordingly.\n\nThere is no situation in which the distro's default configuration file will ever be correct for my systems.", 
            "date_created": "2011-04-11 23:25:15.014541+00:00", 
            "author": "https://api.launchpad.net/1.0/~rlane"
        }, 
        {
            "content": "On 04/11/2011 06:25 PM, Ryan Lane wrote:\n> Puppet does not give you options on how to handle dpkg, as far as I\n> know. This behavior is out of the ordinary for packages, btw. For\n> instance, I've never seen this occur with Apache configuration. It is\n> essentially *never* correct to overwrite a config file. You shouldn't\n> even ask. It should be assumed the administrator has read the upgrade\n> guide before upgrading, and will adjust their configuration file\n> accordingly.\n\nPuppet gives you complete control over your systems - that's the point.\n You can run arbitrary commands and manage configuration files.\n\nSo what's in your /etc/apt/apt.conf.d/local configuration file?  The\narticle I posted clearly gives you several methods to not see config\nfile prompts and to continue to use your custom ones.\n\nThose config file prompts are absolutely common, expected, and very\nhelpful to the system admin humans that see them.  In fact, I just got\ntwo of them yesterday for dnsmasq and sudoers on upgrades of those\npackages.  They *have* to exist per packaging policy to facilitate both\nfresh installs and upgrades - here's why:\n\nThe 'foo' package provides the following files, and there is a marked\nconfig file:\n\n/usr/bin/foo\n/etc/foo.conf\n\nOn a fresh install, the system admin has to adjust foo.conf in order for\nthe software to function.  There is zero prompting in this install.\nEdit to your needs.\n\nOn an upgrade, the package does not overwrite the config and the system\nadmin gets asked what to do - keep old, use new, see diff, etc...\n\nYou, as the system administrator have full control over the system's\nbehavior of that prompting.  Read the article...\n\n> There is no situation in which the distro's default configuration file\n> will ever be correct for my systems.\n\nThen learn how to configure your systems to your own needs.  This is\nabsolutely the proper behavior of the package doing precisely what\npackaging policy states.\n\n-- \nKind regards,\nMichael\n", 
            "date_created": "2011-04-11 23:45:24+00:00", 
            "author": "https://api.launchpad.net/1.0/~mshuler"
        }, 
        {
            "content": "Meh. It seems puppet does give an option to keep or replace. So it looks like this isn't an issue.\n\nI still feel that it is poor behavior to give a prompt where giving anything other than the default ensures you have a broken system. The behavior I normally see is for packages to automatically write to .dpkg-dist files for configuration files unless the file has been modified.\n\nYou can mark this as invalid. I'll use the other methods mentioned to ensure this behavior on my systems.", 
            "date_created": "2011-04-12 00:08:58.144200+00:00", 
            "author": "https://api.launchpad.net/1.0/~rlane"
        }, 
        {
            "content": "2011/4/12 Ryan Lane <email address hidden>:\n> Public bug reported:\n>\n> Setting up nova-common (2011.2~gamma2~bzr978-0ubuntu0ppa1~lucid1) ...\n>\n> Configuration file `/etc/nova/nova.conf'\n>  ==> Modified (by you or by a script) since installation.\n>  ==> Package distributor has shipped an updated version.\n>   What would you like to do about it ?  Your options are:\n>    Y or I  : install the package maintainer's version\n>    N or O  : keep your currently-installed version\n>      D     : show the differences between the versions\n>      Z     : background this process to examine the situation\n>  The default action is to keep your current version.\n> *** nova.conf (Y/I/N/O/D/Z) [default=N] ?\n>\n> Since this is a configuration file, this should likely not occur. It\n> makes it difficult to handle via puppet and other automated means.\n\nThis happens exactly *because* it's a configuration file.\n\nJust make puppet override it?\n", 
            "date_created": "2011-04-12 12:30:20+00:00", 
            "author": "https://api.launchpad.net/1.0/~soren"
        }, 
        {
            "content": "2011/4/12 Ryan Lane <email address hidden>:\n> Puppet does not give you options on how to handle dpkg, as far as I\n> know. This behavior is out of the ordinary for packages, btw.\n\nIt most certainly is not. This is how Debian and derivatives handle\nconfiguration files. If and only if a package contains a changed\nversion of a configuration file (compared to the most recently\ninstalled version) *AND* the local configuration file does not match\nwhat was in the previous version of the package, you will see this\nprompt.  If you believe that you are being prompted under different\ncircumstances, I'd be happy to help you debug that.\n\n> For instance, I've never seen this occur with Apache configuration.\n\nIf you have changed e.g. /etc/apache2/ports.conf and a new apache\nversion comes along with an update to that file, you will see an\nidentical (apart from the file names, of course) prompt. It's standard\ndpkg practice.\n\n> It is essentially *never* correct to overwrite a config file.\n\nIndeed. That's why it's prompting rather than just overwriting.\n\n> You shouldn't even ask.\n\nYes, you should. That's the only way administrators will know that\ne.g. defaults have changed or perhaps even that the syntax of the\nconfiguration file has changed since the most recently installed\nversion.\n\nOccasionally, security updates consist exclusively of a change to a\nconfiguration file. Without this prompt, you'd never know, and you'd\nremain vulnerable to the security issue in question.\n\n> It should be assumed the administrator has read the upgrade\n> guide before upgrading, and will adjust their configuration file\n> accordingly.\n\nThe default should be \"don't break anything\". That (for better or\nworse) requires asking a question. The config file you had may not\neven be valid anymore.\n\n> There is no situation in which the distro's default configuration file\n> will ever be correct for my systems.\n\nI honestly doubt that you have changed every single configuration file\nshipped by your distro. Even if you did, you'd be the (very!) special\ncase.\n\n\n-- \nSoren Hansen        | http://linux2go.dk/\nUbuntu Developer    | http://www.ubuntu.com/\nOpenStack Developer | http://www.openstack.org/\n", 
            "date_created": "2011-04-12 12:39:34+00:00", 
            "author": "https://api.launchpad.net/1.0/~soren"
        }
    ]
}