{
    "status": "Invalid", 
    "last_updated": "2012-09-12 13:58:39.478635+00:00", 
    "description": "On an Essex cluster, after creating an instance, doing 'nova reboot server' took the following times. \n\nfirst time: 16s\nsecond time: 158s\nthird time: 16s\nfourth time: 165s\nfith time: 163s\n\nDoing this with devstack trunk always takes around 160s. Doing a hard reboot is much faster. I takes 5s with the devstack and 16s with Essex cluster. These were all on the same hardware using Ubuntu precise and kvm.", 
    "tags": [], 
    "importance": "Undecided", 
    "heat": 8, 
    "link": "https://bugs.launchpad.net/nova/+bug/1013747", 
    "owner": "None", 
    "id": 1013747, 
    "index": 2889, 
    "created": "2012-06-15 16:05:27.990579+00:00", 
    "title": "Soft reboot can be incredibly slow", 
    "comments": [
        {
            "content": "On an Essex cluster, after creating an instance, doing 'nova reboot server' took the following times. \n\nfirst time: 16s\nsecond time: 158s\nthird time: 16s\nfourth time: 165s\nfith time: 163s\n\nDoing this with devstack trunk always takes around 160s. Doing a hard reboot is much faster. I takes 5s with the devstack and 16s with Essex cluster. These were all on the same hardware using Ubuntu precise and kvm.", 
            "date_created": "2012-06-15 16:05:27.990579+00:00", 
            "author": "https://api.launchpad.net/1.0/~david-kranz"
        }, 
        {
            "content": "Soft reboot requires guest support (acpid on linux), so reboot will attempt to do a soft reboot, wait for a timeout, and then switch to hard.  I don't know why the same guest would respond sometimes and not others. We need to check to see if the guest is ignoring the soft reboot or if nova/libvirt is not detecting the shutdown properly.\n\nThe only way to do this would be to be sshed into the vm when you perform the reboot and check if the reboot happens immediately or if is waiting for the timeout.", 
            "date_created": "2012-06-15 17:47:03.515296+00:00", 
            "author": "https://api.launchpad.net/1.0/~vishvananda"
        }, 
        {
            "content": "OK. I did as you suggest and the reboot does not happen any time soon on devstack. I guess this is expected since it is using cirros which I presume does not have the necessary support. The non-devstack case was using the precise cloud img. ", 
            "date_created": "2012-06-15 19:32:59.827707+00:00", 
            "author": "https://api.launchpad.net/1.0/~david-kranz"
        }, 
        {
            "content": "So in the non-devstack case, the 5 tries are done on identical instances ? Pristine precise cloud img ? What happens if you ssh into /those/ and ask for soft reboot ?", 
            "date_created": "2012-07-12 13:23:19.941051+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "I tried this on the same pristine precise image, and also a snapshot. When I ssh in and reboot it is fast always. When I reboot from nova it (seemingly) randomly takes about 10s or 2.5 minutes. This image definitely has acpid running.", 
            "date_created": "2012-07-19 17:03:54.069479+00:00", 
            "author": "https://api.launchpad.net/1.0/~david-kranz"
        }, 
        {
            "content": "David could you include nova compute debug logs showing what's going on here? The corresponding api log would be good too\n\nAlso, with the pristine precise image, could you try vish's suggestion of SSHing into the instance and seeing if the ACPI shutdown is always immediately received by the guest?\n\nTrying with another distro image would be worthwhile too\n\nIt sounds to me like the guest just isn't always shutting down quickly - if Nova is delivering the shutdown message quickly, but the guest is slow to shutdown ... there's not much we can do about it", 
            "date_created": "2012-09-11 16:07:53.349137+00:00", 
            "author": "https://api.launchpad.net/1.0/~markmc"
        }, 
        {
            "content": "Well, I tried this again both on essex and folsom from a few weeks ago and could not reproduce this problem. I have no explanation for that but I guess this ticket should be closed.", 
            "date_created": "2012-09-12 13:39:57.385694+00:00", 
            "author": "https://api.launchpad.net/1.0/~david-kranz"
        }, 
        {
            "content": "Thanks David", 
            "date_created": "2012-09-12 13:58:38.984350+00:00", 
            "author": "https://api.launchpad.net/1.0/~markmc"
        }
    ]
}