{
    "status": "Fix Released", 
    "last_updated": "2013-03-08 18:29:30.379021+00:00", 
    "description": "Although the nova.conf file's permissions are restricted to 640, giving every compute server the MySQL root password, as according to the cactus documentation, does not follow the principle of least privilege.\n\nDocuments that refer to root MySQL password on compute servers:\nhttp://docs.openstack.org/cactus/openstack-compute/admin/content/configuring-multiple-compute-nodes.html\nhttp://docs.openstack.org/cactus/openstack-compute/admin/content/setting-flags-in-nova-conf-file.html\n\nIf an attacker successfully exploits a flaw in the hypervisor (as have been found in KVM and XEN in the past), the attacker can easily tamper with the MySQL database, wreaking havoc on the OpenStack Cloud.\n\nAn attack on the hypervisor should be limited in scope to individual compute servers.", 
    "tags": [], 
    "importance": "Wishlist", 
    "heat": 10, 
    "link": "https://bugs.launchpad.net/nova/+bug/823000", 
    "owner": "None", 
    "id": 823000, 
    "index": 1094, 
    "created": "2011-08-08 23:08:11.419475+00:00", 
    "title": "nova-compute should not address DB directly (a.k.a. root SQL password in conf)", 
    "comments": [
        {
            "content": "Although the nova.conf file's premissions are restricted to 640, giving every compute server the MySQL root password, as according to the cactus documentation, does not follow the principle of least privilege. \n\nDocuments that refer to root MySQL password on compute servers:\nhttp://docs.openstack.org/cactus/openstack-compute/admin/content/configuring-multiple-compute-nodes.html\nhttp://docs.openstack.org/cactus/openstack-compute/admin/content/setting-flags-in-nova-conf-file.html\n\nIf an attacker succsesfully exploits a flaw in the hypervisor (as have been found in KVM and XEN in the past), the attacker can easily tamper with the MySQL database, wreaking havoc on the OpenStack Cloud.\n\nAn attack on the hypervisor should be limited in scope to indivual compute servers.", 
            "date_created": "2011-08-08 23:08:11.419475+00:00", 
            "author": "https://api.launchpad.net/1.0/~jogo"
        }, 
        {
            "content": "I don't see how this is a bug, much less a security vulnerability. There is nothing that can/should be done in the code to prevent this  so I'm guessing your beef is with the openstack-manuals project. Feel free to submit this bug report there?", 
            "date_created": "2011-08-17 14:18:11.891879+00:00", 
            "author": "https://api.launchpad.net/1.0/~blamar"
        }, 
        {
            "content": "@Joe: how do you suggest we improve that ? get every database call through a queue and get the queries picked up by some database action listener ? Narrow down permissions so that the DB user used by nova-compute can't do as much damage ?\n\nThis is a pretty well-known situation, and not really a directly-exploitable vulnerability (but rather something that can be improved in the architecture for more resilience). Do you agree to open this bug publicly ?", 
            "date_created": "2011-11-25 14:09:24.686571+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "@Thierry: I think both are good options, perhaps moving the DB call to work through a queue can allow for other services to subscribe to specific DB updates?  While it looks like the easier option is to narrow the nova-compute DB user's permission the question is what is the better solution in the long term?\n\nYes, I do agree this should be bug should be made public.", 
            "date_created": "2011-11-28 23:32:29.931647+00:00", 
            "author": "https://api.launchpad.net/1.0/~jogo"
        }, 
        {
            "content": "Relevant blueprint here: https://blueprints.launchpad.net/nova/+spec/no-db-compute", 
            "date_created": "2012-06-07 09:23:04.282033+00:00", 
            "author": "https://api.launchpad.net/1.0/~markmc"
        }, 
        {
            "content": "Since we've got this covered by a blueprint that is well underway and scheduled to be done in Grizzly, I think we can just close this bug out.", 
            "date_created": "2012-11-02 18:16:24.745557+00:00", 
            "author": "https://api.launchpad.net/1.0/~russellb"
        }, 
        {
            "content": "This blueprint has been implemented", 
            "date_created": "2013-03-08 18:29:25.102353+00:00", 
            "author": "https://api.launchpad.net/1.0/~russellb"
        }
    ]
}