{
    "status": "Fix Released", 
    "last_updated": "2014-07-18 14:51:47.182269+00:00", 
    "description": "We require minor changes to any RPCAPI to be backwards compatible (http://docs.openstack.org/developer/nova/api/nova.rpc.dispatcher.html) to help make rolling upgrades possible ( for example to allow a grizzly scheduler talk to a havana compute), but we have no testing mechanism in place to make sure this works.  Since this kind of backwards compatibility is tricky and we have no testing for it there is a very very small probability that it works at all.\n\nA test for this would require setting up a devstack environment with two copies of the nova source tree and running some services from the latest patch and some from the oldest nova version that supports the same major RPCAPI version.  Although to start with perhaps we should just test the most recent release versus trunk.\n\nAnother option is to test against HEAD^ and test the continuous deploy case, where each patch is pushed out one by one.", 
    "tags": [
        "testing"
    ], 
    "importance": "Undecided", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1214683", 
    "owner": "https://api.launchpad.net/1.0/~jogo", 
    "id": 1214683, 
    "index": 3992, 
    "created": "2013-08-21 02:41:15.364781+00:00", 
    "title": "RPC compatibility required across minor RPC changes but not tested", 
    "comments": [
        {
            "content": "We require minor changes to any RPCAPI to be backwards compatible (http://docs.openstack.org/developer/nova/api/nova.rpc.dispatcher.html) to help make rolling upgrades possible ( for example to allow a grizzly scheduler talk to a havana compute), but we have no testing mechanism in place to make sure this works.  Since this kind of backwards compatibility is tricky and we have no testing for it there is a very very small probability that it works at all.\n\nA test for this would require setting up a devstack environment with two copies of the nova source tree and running some services from the latest patch and some from the oldest nova version that supports the same major RPCAPI version.\n\nbut this won't be possible until we have db objects, as the DB schema are different.  So until then the test can compare to the oldest nova commit that has the same schema.", 
            "date_created": "2013-08-21 02:41:15.364781+00:00", 
            "author": "https://api.launchpad.net/1.0/~jogo"
        }, 
        {
            "content": "We now test this with the partial-ncpu job.", 
            "date_created": "2014-07-18 14:50:46.457138+00:00", 
            "author": "https://api.launchpad.net/1.0/~jogo"
        }
    ]
}