{
    "status": "Invalid", 
    "last_updated": "2011-10-27 20:31:57.200605+00:00", 
    "description": "Xapi sessions can disappear or become unusable for a variety of reasons, and need to be recreated. Current code doesn't appear to support this. Ideally it should recreate the session without interrupting ongoing operations or missing out or repeating steps.\n\nConnection should also handle the HOST_IS_SLAVE error.\n\nRevno:446", 
    "tags": [], 
    "importance": "Medium", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/692994", 
    "owner": "None", 
    "id": 692994, 
    "index": 2224, 
    "created": "2010-12-21 13:52:36.004123+00:00", 
    "title": "nova-compute will not recover from loss of its xapi session", 
    "comments": [
        {
            "content": "Xapi sessions can disappear or become unusable for a variety of reasons, and need to be recreated. Current code doesn't appear to support this. Ideally it should recreate the session without interrupting ongoing operations or missing out or repeating steps.\n\nConnection should also handle the HOST_IS_SLAVE error.\n\nRevno:446", 
            "date_created": "2010-12-21 13:52:36.004123+00:00", 
            "author": "https://api.launchpad.net/1.0/~armando-migliaccio"
        }, 
        {
            "content": "Unfortunately I've been unable to reproduce the failure so far. \nIf nothing comes up, I will provide a small patch for dealing with the HOST_IS_SLAVE error.\n", 
            "date_created": "2011-03-18 11:24:18.127128+00:00", 
            "author": "https://api.launchpad.net/1.0/~salvatore-orlando"
        }, 
        {
            "content": "@Salvatore: are you still working on that ? If not, we should unassign you to let someone else potentially have a shot at it...", 
            "date_created": "2011-05-02 14:56:55.717270+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "Hi Thierry, \nI tried to reproduce this failure several times but I have been unsuccessful so far. \nEven if I can provide a patch which automatically tries to recreate the connection if it becomes invalid, I think a good understanding of the failure behaviour will help us implementing a better fix. \nI will decide the best course of action ASAP.\n\nAs for the HOST_IS_SLAVE error, I will create a different bug report, as it is a different issue, which occurs if nova-compute connects to a non-master member of a pool. \n\nSalvatore", 
            "date_created": "2011-05-03 14:28:56.899136+00:00", 
            "author": "https://api.launchpad.net/1.0/~salvatore-orlando"
        }, 
        {
            "content": "I have unfortunately been unable to reproduce the failure so far:\n\nIt seems the xenapi library is able to reconnect to xapi automatically and restore the session. \nTests performed:\n\n- Temporarily interrupting transport between nova-compute and xapi daemon\n- Stop/Start xapi daemon on server while VM spawn operation in progress\n- No operation on session for 24 hours in order to allow it to expire\n\nUnassigning myself, hope somebody else will have more luck.", 
            "date_created": "2011-06-01 09:54:07.365742+00:00", 
            "author": "https://api.launchpad.net/1.0/~salvatore-orlando"
        }, 
        {
            "content": "Might be time to get rid of this bug, it's based on rev 446 and has been unable to be reproduced. Unless someone can provide recent tracebacks, I'll delete the issue and assume that we solved it accidentally along the way.", 
            "date_created": "2011-09-27 02:53:29.653861+00:00", 
            "author": "https://api.launchpad.net/1.0/~blamar"
        }, 
        {
            "content": "I'm going to close this out. XenAPI will automatically relogin if its session is invalid.\n\nSince no one has seen this problem in almost a year, it's likely not a problem anymore.\n\nIf someone sees something related again, open up a new bug please.", 
            "date_created": "2011-10-27 20:31:39.805003+00:00", 
            "author": "https://api.launchpad.net/1.0/~johannes.erdfelt"
        }
    ]
}