{
    "status": "Fix Released", 
    "last_updated": "2011-09-22 16:55:48.658871+00:00", 
    "description": "The OpenStack API, when returning XML, do not specify the namespace.\n\nValidation against the schema therefore fails immediately.", 
    "tags": [], 
    "importance": "Medium", 
    "heat": 8, 
    "link": "https://bugs.launchpad.net/nova/+bug/740576", 
    "owner": "https://api.launchpad.net/1.0/~justin-fathomdb", 
    "id": 740576, 
    "index": 2319, 
    "created": "2011-03-22 23:09:14.160934+00:00", 
    "title": "No XML namespace in OpenStack API", 
    "comments": [
        {
            "content": "The OpenStack API, when returning XML, do not specify the namespace.\n\nValidation against the schema therefore fails immediately.", 
            "date_created": "2011-03-22 23:09:14.160934+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "Please only link branches that are actually fixing the bug, since our tools use the link to assess priority. I removed the \"related\" ones.", 
            "date_created": "2011-03-25 15:26:10.078320+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "ttx: I wish you hadn't unlinked the branches.. The priority of those related branches should also be boosted, because those branches are doing testing of this issue.  It's also confusing because those branches are no longer linked to this issue, so it's difficult to know what those branches are about.\n\nBranches:\nbug740576 fixes the immediate problem, and has minimal unit testing\nadd-xsd includes the spec that we want to follow\njava-api is a binding that works off the spec\n\"future-branch\" will actually use that binding to test this properly\n\nLP calls them related branches, and they are related branches.  Perhaps if there's more than one branch, if one of them is called bugNNNNN, then the tools could infer that is the immediate bugfix, and the others are merely related.\n\nCan I add \"add-xsd\" and \"java-api\" back in as related branches?", 
            "date_created": "2011-03-25 20:05:42.983437+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "After reading your explanation, I agree that add-xsd is definitely part of the bugfix, so I added it back (and removed the requirement for FFe on that branch). I am a bit more unsure about java-bindings, which IIUC is not part of the bugfix, but rather one way to test the XML namespace (among others)... You can still mention the bug in the description (LP will autolink it so people are still able to follow the link).", 
            "date_created": "2011-03-26 14:22:22.007418+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "@Justin: Where are we on add-xsd ? Is it still desirable ?", 
            "date_created": "2011-05-30 09:59:19.262121+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "xmlns is now returned on all entities", 
            "date_created": "2011-07-11 21:59:10.175423+00:00", 
            "author": "https://api.launchpad.net/1.0/~bcwaldon"
        }
    ]
}