{
    "status": "Expired", 
    "last_updated": "2016-07-05 09:42:58.572729+00:00", 
    "description": "In a cell setup each cell has its own DB. When an instance is created using the nova api running in the parent cell the DB in this cell is updated and the request goes to the child cell. If the child DB fails to be updated or multiple cells are available in the setup the instance ID will be different.\nThe domain name in the compute nodes is created using the instance ID in the child cell.\nWhen querying the parent cell for instance details the EXT-SRV-ATTR:instance_name reflects the ID of the parent cell DB.", 
    "tags": [
        "cells"
    ], 
    "importance": "Undecided", 
    "heat": 36, 
    "link": "https://bugs.launchpad.net/nova/+bug/1211022", 
    "owner": "None", 
    "id": 1211022, 
    "index": 3944, 
    "created": "2013-08-11 16:10:20.588554+00:00", 
    "title": "In a cell setup when querying instance details using nova api in the parent cell OS-EXT-SRV-ATTR:instance_name could be wrong", 
    "comments": [
        {
            "content": "In a cell setup each cell has it’s own DB. When an instance is created using the nova api running in the parent cell the DB in this cell is updated and the request goes to the child cell. If the child DB fails to be updated or multiple cells are available in the setup the instance ID will be different.\nThe domain name in the compute nodes is created using the instance ID in the child cell.\nWhen querying the parent cell for instance details the EXT-SRV-ATTR:instance_name reflects the ID of the parent cell DB.", 
            "date_created": "2013-08-11 16:10:20.588554+00:00", 
            "author": "https://api.launchpad.net/1.0/~moreira-belmiro-email-lists"
        }, 
        {
            "content": "This can be addressed by not using id in the instance_name_template config option, which unfortunately the default does.  What is the issue that arises from this discrepancy between the child id and parent id?  That will help assess the impact and priority of this bug.", 
            "date_created": "2014-03-05 20:06:27.106152+00:00", 
            "author": "https://api.launchpad.net/1.0/~alaski"
        }, 
        {
            "content": "Ceilometer pollsters are using instance_name to get samples from the compute nodes (e.g. libvirt: https://github.com/openstack/ceilometer/blob/master/ceilometer/compute/virt/libvirt/inspector.py). Because of this, in our infrastructure, we had to deploy nova/keystone/glance api also in the child cells in order to get the correct value from the child cell databases. Same goes for libvirt logs and hyper-v console, in both cases you need the instance_name.", 
            "date_created": "2014-03-05 20:53:58.378432+00:00", 
            "author": "https://api.launchpad.net/1.0/~szilli"
        }, 
        {
            "content": "I would caution that it's not a good idea to query by instance name or store anything by instance name if it can be avoided.  It's a runtime generated value that could change at a deployers discretion.  Though I would caution them against that too :)\n\nAnyways, this is a legitimate issue that should be addressed.  Though I don't have a fix in mind at the moment.", 
            "date_created": "2014-03-05 21:24:28.766519+00:00", 
            "author": "https://api.launchpad.net/1.0/~alaski"
        }, 
        {
            "content": "I think it's horrible this is even exposed in an extension.  :)  But this is also solvable by making a real DB column in Instance for the data.", 
            "date_created": "2014-03-13 21:06:31.820774+00:00", 
            "author": "https://api.launchpad.net/1.0/~cbehrens"
        }, 
        {
            "content": "\nThis is an automated cleanup. This bug report has been closed because it\nis older than 18 months and there is no open code change to fix this.\nAfter this time it is unlikely that the circumstances which lead to\nthe observed issue can be reproduced.\n\nIf you can reproduce the bug, please:\n* reopen the bug report (set to status \"New\")\n* AND add the detailed steps to reproduce the issue (if applicable)\n* AND leave a comment \"CONFIRMED FOR: <RELEASE_NAME>\"\n  Only still supported release names are valid (LIBERTY, MITAKA, OCATA, NEWTON).\n  Valid example: CONFIRMED FOR: LIBERTY\n", 
            "date_created": "2016-07-05 09:42:57.835933+00:00", 
            "author": "https://api.launchpad.net/1.0/~mzoeller"
        }
    ]
}