{
    "status": "Invalid", 
    "last_updated": "2015-11-04 15:23:11.410955+00:00", 
    "description": "Resizing an instance which booted from a volume to a new flavor with a bigger disk will not cause the volume to resize accordingly. This can cause confusion among the users, which will expect to have instances with bigger storage.\n\nScenario:\n1. Have a glance image.\n2. Create a bootable volume from glance image.\n3. Create instance using volume and flavor having 10GB disk.\n4. Perform nova resize on instance to a new flavor having 20GB disk.\n5. After resize, see that the instance still has 10GB storage. Cinder volume still has the same size.\n\nThis issue has been discussed on #openstack-nova and it was agreed upon to fail the resize operation, if the given instance is booted from volume and the given new flavor has a different disk size.", 
    "tags": [
        "low-hanging-fruit", 
        "volumes"
    ], 
    "importance": "Undecided", 
    "heat": 10, 
    "link": "https://bugs.launchpad.net/nova/+bug/1412993", 
    "owner": "https://api.launchpad.net/1.0/~cbelu", 
    "id": 1412993, 
    "index": 5390, 
    "created": "2015-01-20 22:17:36.625078+00:00", 
    "title": "Nova resize for boot-from-volume instance does not resize volume", 
    "comments": [
        {
            "content": "Resizing an instance which booted from a volume to a new flavor with a bigger disk will not cause the volume to resize accordingly. This can cause confusion among the users, which will expect to have instances with bigger storage.\n\nScenario:\n1. Have a glance image.\n2. Create a bootable volume from glance image.\n3. Create instance using volume and flavor having 10GB disk.\n4. Perform nova resize on instance to a new flavor having 20GB disk.\n5. After resize, see that the instance still has 10GB storage. Cinder volume still has the same size.\n\nThis issue has been discussed on #openstack-nova and it was agreed upon to fail the resize operation, if the given instance is booted from volume and the given new flavor has a different disk size.", 
            "date_created": "2015-01-20 22:17:36.625078+00:00", 
            "author": "https://api.launchpad.net/1.0/~cbelu"
        }, 
        {
            "content": "I am not sure if this is the correct call, this is what I expect to be the correct behaviour, because the volume is independent in size to that of the flavor.\n\nI think we need to look at the block device mapping and flavor relationship much closer to work out the correct path here.", 
            "date_created": "2015-04-15 13:15:57.653901+00:00", 
            "author": "https://api.launchpad.net/1.0/~johngarbutt"
        }, 
        {
            "content": "Any discussion you had on #openstack-nova should be pasted in a comment here or followed up on the ML so the rest of us get to see what was discussed and can contribute to the debate.\n\nThe disk size in the flavor is not the disk size of the root disk when booting from a volume, so I agree with John: the behavior you describe is what you would expect.\n\nI don't really see the point of failing an operation that has no practical change. i.e. if my instance has flavor A and I want to resize of flavor B, I don't see why I would refuse to do it just because A and B have same values. I might be clever and implement the change to the instance as a noop, but I wouldn't refuse. I would say the same if the only change is the disk size when the instance boots from volume.\n\n\n", 
            "date_created": "2015-04-27 10:43:35.259589+00:00", 
            "author": "https://api.launchpad.net/1.0/~pmurray"
        }, 
        {
            "content": "Marking this as invalid, as I think this is the correct behaviour.\n\nThere was talk of adding the ability to resize a volume during resize using BDM, but thats a spec.", 
            "date_created": "2015-11-04 11:44:26.482553+00:00", 
            "author": "https://api.launchpad.net/1.0/~johngarbutt"
        }, 
        {
            "content": "Sure. Makes sense. Although this is bug-ish, it's implementation is more feature-ish.\n", 
            "date_created": "2015-11-04 15:23:10.730340+00:00", 
            "author": "https://api.launchpad.net/1.0/~cbelu"
        }
    ]
}