{
    "status": "Invalid", 
    "last_updated": "2014-06-05 02:15:42.225207+00:00", 
    "description": "This is a fresh install of Ubuntu 12.04 beta2, with 2012.1 Nova.  Following steps defined here: http://www.hastexo.com/resources/docs/installing-openstack-essex-4-ubuntu-1204-precise-pangolin\n\nwhen I issued the nova boot command the build failed during the network phase.  Now the instance is setting in an error state.  I run the nova delete command it sits there.  \n\nNothing new appears in the nova-api.log file.  \n\nnova-network is up and running.", 
    "tags": [], 
    "importance": "Medium", 
    "heat": 24, 
    "link": "https://bugs.launchpad.net/nova/+bug/985185", 
    "owner": "None", 
    "id": 985185, 
    "index": 2869, 
    "created": "2012-04-18 20:05:42.326625+00:00", 
    "title": "Can't delete instance if nova-network isn't responding", 
    "comments": [
        {
            "content": "This is a fresh install of Ubuntu 12.04 beta2, with 2012.1 Nova.  Following steps defined here: http://www.hastexo.com/resources/docs/installing-openstack-essex-4-ubuntu-1204-precise-pangolin\n\nwhen I issued the nova boot command the build failed during the network phase.  Now the instance is setting in an error state.  I run the nova delete command it sits there.  \n\nNothing new appears in the nova-api.log file.  \n\nnova-network is up and running.", 
            "date_created": "2012-04-18 20:05:42.326625+00:00", 
            "author": "https://api.launchpad.net/1.0/~bigjoe1008"
        }, 
        {
            "content": "Sometimes, I will meet the same error. I guess, it may be caused by the asynchronous invocation. \"nova delete\" will return success before the instance is actually deleted.\n\n", 
            "date_created": "2012-06-07 08:19:21.680383+00:00", 
            "author": "https://api.launchpad.net/1.0/~daisy-ycguo"
        }, 
        {
            "content": "I can only replicate this if the network worker is not recponding.  If the network worker is down, you cannot terminate an instance properly.  This is because compute attempts to get the network information from the network worker so it can tear down the network if it fails to communicate with the network worker.\n\nI'm not sure if we have a good solution for this except for hiding terminated instances from the user immediately. I don't think it is safe to actually delete the vm until we can communicate with the network worker.  This may also be partially resolved by the move of the relevant code up into the api.", 
            "date_created": "2012-06-07 21:41:15.614347+00:00", 
            "author": "https://api.launchpad.net/1.0/~vishvananda"
        }, 
        {
            "content": "The trouble is if someone deletes the network with nova-manage while an instance is still running in it.\n\nThen it seems the only way to terminate is create a new network, edit the DB to match the original network ID, and then terminate.", 
            "date_created": "2012-06-19 22:06:32.050844+00:00", 
            "author": "https://api.launchpad.net/1.0/~marrusl"
        }, 
        {
            "content": "I guess the simple answer is don't do that! I suppose we could do a consistency check in nova-manage network delete to be sure there are no vms in that network before allowing them to be deleted.  Really though deletes are never permanent, you could just set deleted=0 for the old network and its fixed ips in the db instead of creating a new one.", 
            "date_created": "2012-06-19 22:30:43.478335+00:00", 
            "author": "https://api.launchpad.net/1.0/~vishvananda"
        }, 
        {
            "content": "Marking this issue as invalid, as it is filed against Essex, and has not been updated in almost two years. If you believe this to be in error, please update this issue.", 
            "date_created": "2014-06-05 02:15:32.921724+00:00", 
            "author": "https://api.launchpad.net/1.0/~jshepher"
        }
    ]
}