{
    "status": "Confirmed", 
    "last_updated": "2017-06-23 16:32:10.253435+00:00", 
    "description": "Currently, the quota usage table doesn't contain UniqueConstraint policy. Although it has locks when writing data, but under extreme circumstance, for example: launching over 100 instances at the same time for a new tenant(user). In this condition,the quota usage table for this user is empty, and there might be a chance that multiple record are recorded for same resource and same user.\n\nAdding UniqueConstraint policy for this table can solve this problem.", 
    "tags": [
        "quotas"
    ], 
    "importance": "Medium", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1484343", 
    "owner": "None", 
    "id": 1484343, 
    "index": 4318, 
    "created": "2015-08-13 04:05:21.633676+00:00", 
    "title": "Multiple record for same user and resource in quota_usage table", 
    "comments": [
        {
            "content": "Currently, the quota usage table doesn't contain UniqueConstraint policy. Although it has locks when writing data, but nova-api allows multiple workers. Under extreme circumstance, for example: multiple api workers are trying to read and write the table at the same time, new record may be recorded to the list for the same user and same resources.", 
            "date_created": "2015-08-13 04:05:21.633676+00:00", 
            "author": "https://api.launchpad.net/1.0/~zhengzhenyu"
        }, 
        {
            "content": "Fix proposed to branch: master\nReview: https://review.openstack.org/217465", 
            "date_created": "2015-08-27 02:51:38.889513+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Change abandoned by Zhenyu Zheng (<email address hidden>) on branch: master\nReview: https://review.openstack.org/212908\nReason: Need to come up with new ideas.", 
            "date_created": "2016-01-30 01:51:06.025621+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Change abandoned by Sean McGinnis (<email address hidden>) on branch: master\nReview: https://review.openstack.org/217465\nReason: This review is > 4 weeks without comment and currently blocked by a core reviewer with a -2. We are abandoning this for now. Feel free to reactivate the review by pressing the restore button and contacting the reviewer with the -2 on this review to ensure you address their concerns.", 
            "date_created": "2016-04-19 20:20:47.960731+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Seems like a very good idea.\n\nGiven the use of first, I suspect that caused issues where we just update one copy, and leave the other. Not sure if the order is always deterministic.\n\nJust need to be sure to clean out duplicates, I think it's safe to delete the one we would not access using first. Need this in the script before adding the constraint, similar to what has been done for uuid constraints previously.", 
            "date_created": "2016-07-12 15:52:01.548534+00:00", 
            "author": "https://api.launchpad.net/1.0/~johngarbutt"
        }, 
        {
            "content": "@John Garbutt, thanks for the information, the clean up thing was actually what blocked this, could you provide more details about the example you talked about?", 
            "date_created": "2016-07-13 01:43:11.382159+00:00", 
            "author": "https://api.launchpad.net/1.0/~zhengzhenyu"
        }, 
        {
            "content": "@Zhenyu Zheng Can i work on this bug?", 
            "date_created": "2016-10-17 10:14:42.602338+00:00", 
            "author": "https://api.launchpad.net/1.0/~surbhisarda"
        }, 
        {
            "content": "This hasn't been touched for quite some time.  I think it can be moved to triaged.  Someone else could pick it up.", 
            "date_created": "2017-05-22 23:10:55.020776+00:00", 
            "author": "https://api.launchpad.net/1.0/~jsbryant"
        }
    ]
}