{
    "status": "Opinion", 
    "last_updated": "2017-07-25 14:22:55.805758+00:00", 
    "description": "I tested instance deferred delete function. I found that when a instance is SOFT_DELETED, I can detach volume from that instance. However I can't detach interface from a SOFT_DELETED instance. I think we should also allow interface detach operation when a instance is SOFT_DELETED.", 
    "tags": [], 
    "importance": "Low", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1566659", 
    "owner": "None", 
    "id": 1566659, 
    "index": 718, 
    "created": "2016-04-06 06:25:51.733648+00:00", 
    "title": "detach interface is not allowed when server is SOFT_DELETED", 
    "comments": [
        {
            "content": "we enabled instance deferred delete function. we found that when a instance is SOFT_DELETED, we can detach volume from that instance. However we can't detach interface from a SOFT_DELETED instance. I think we should also allow interface detach operation when a instance is SOFT_DELETED.", 
            "date_created": "2016-04-06 06:25:51.733648+00:00", 
            "author": "https://api.launchpad.net/1.0/~ljjjustin"
        }, 
        {
            "content": "Fix proposed to branch: master\nReview: https://review.openstack.org/302052", 
            "date_created": "2016-04-06 06:41:50.883434+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Not really sure we should accept to delete either volumes or network IFs when an instance is SOFT DELETED, but let's discuss that in the review change...", 
            "date_created": "2016-04-08 13:56:27.250149+00:00", 
            "author": "https://api.launchpad.net/1.0/~sylvain-bauza"
        }, 
        {
            "content": "Hi Sylvain, IMHO currently implementation of instance deferred delete function is strange.\n1, It seems that it's a admin only function, normal user can't see and restore the deleted instance.\n2, The operation of the resources associate with instance inconsistent. As a example: we can detach volume but we can't detach interface.\n3, There is DOS risk because there is interval between the quota reclaime and resource reclaim. https://bugs.launchpad.net/nova/+bug/1501808\n4,  If instance have one or more attached volume, the volume can't be detach and leave a volume detached to a none instance. we have to modify cinder database to fix this kind problem. https://bugs.launchpad.net/nova/+bug/1560300\nIMHO, we should refactor the instance deferred delete function.\n", 
            "date_created": "2016-06-02 08:38:25.828994+00:00", 
            "author": "https://api.launchpad.net/1.0/~ljjjustin"
        }, 
        {
            "content": "Change abandoned by Michael Still (<email address hidden>) on branch: master\nReview: https://review.openstack.org/302052\nReason: This patch has been sitting unchanged for more than 12 weeks. I am therefore going to abandon it to keep the nova review queue sane. Please feel free to restore the change if you're still working on it.", 
            "date_created": "2016-10-25 16:14:30.440118+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "There are no currently open reviews on this bug, changing the status back to the previous state and unassigning. If there are active reviews related to this bug, please include links in comments. ", 
            "date_created": "2017-06-27 19:21:48.300490+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }, 
        {
            "content": "This is working as designed. The soft_delete is for admins to save people's stuff, not for them to, and removing the interface makes the thing something they can't do.\n\nThere is no DOS vector if you don't enable soft_delete, which is disabled by default.", 
            "date_created": "2017-07-25 14:22:55.145763+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }
    ]
}