{
    "status": "Fix Released", 
    "last_updated": "2011-04-15 08:36:04.964522+00:00", 
    "description": "During the spawning of VM, a XenAPI.Failure NO_HOST_AVAILABLE may be returned. In such case the VM is left broken in shutdown state and a user must do euca-terminate-instance to clean it up.\n\nrevno 497", 
    "tags": [], 
    "importance": "Medium", 
    "heat": 10, 
    "link": "https://bugs.launchpad.net/nova/+bug/694935", 
    "owner": "https://api.launchpad.net/1.0/~salvatore-orlando", 
    "id": 694935, 
    "index": 2226, 
    "created": "2010-12-28 09:11:53.761681+00:00", 
    "title": "when using xenapi, there is no clean-up if a vm fails to spawn ", 
    "comments": [
        {
            "content": "During the spawning of VM, a XenAPI.Failure NO_HOST_AVAILABLE may be returned. In such case the VM is left broken in shutdown state and a user must do euca-terminate-instance to clean it up.\n\nrevno 497", 
            "date_created": "2010-12-28 09:11:53.761681+00:00", 
            "author": "https://api.launchpad.net/1.0/~armando-migliaccio"
        }, 
        {
            "content": "The porposed fix in the branch attached to this bug report puts the VM in a (new) 'FAILED' power state. It does not perform a clean-up.\nThis because the user needs to know what has happened to the VM he/she was trying to run. Normally, API users do not have access to log files. In this case, the only way for the user to know what happened to the instance is to query its state (e.g.: doing euca-describe-instances). If we perform a complete clean-up, no information about the instance which failed to spawn will be left. \n\nAs regards the NO_HOST_AVAILABLE error, which occurs when there is not enough RAM left on the host, the amount of available memory is now checked at the beginning of the spawn process. This way, if there is not enough RAM left on the host, the spawn process returns immediately, as there is no point in allocating an IP address and streaming the image if there is not enough memory to run the instance. \n\nA test case (spawn_not_enough_memory) has been added as well.", 
            "date_created": "2011-02-09 10:20:02.251107+00:00", 
            "author": "https://api.launchpad.net/1.0/~salvatore-orlando"
        }, 
        {
            "content": "Alternatively, we can perform a complete clean-up when a VM fails to spawn. However, in my opinion, we still need to provide a way to inform the user the VM has failed to spawn.", 
            "date_created": "2011-02-09 10:21:26.130438+00:00", 
            "author": "https://api.launchpad.net/1.0/~salvatore-orlando"
        }
    ]
}