{
    "status": "Invalid", 
    "last_updated": "2017-05-31 21:16:44.110112+00:00", 
    "description": "OS version is Ocata, with SSL enabled across the entire cloud.\n\nUsing the Keystone-LDAP charm to allow AD user authentication to the OS deployment. AD admin users can login, and have limited admin access.\n\nIf an AD user is added to a project on either the AD domain or the admin_default domain as an admin, they are able to request an instance but the instance creation errors out with: http://paste.ubuntu.com/24727101/\n\nThere is an associated error in nova-cloud-controller's apache2 nova-placement error log: http://paste.ubuntu.com/24727106/\n\nCreating an instance with a local administrator on the admin_domain domain on a project in the admin domain works without issue. However it does not work while logged in as a local administrator (who has admin rights added) on a project created in the AD domain.\n\nThe root of the issue seems to be communication between the nova scheduler and the nova placement api, specifically where if a token originates from the AD domain it has insufficient privileges to perform administrative action between services.", 
    "tags": [
        "adrastea"
    ], 
    "importance": "Undecided", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1694537", 
    "owner": "None", 
    "id": 1694537, 
    "index": 6868, 
    "created": "2017-05-30 21:02:05.700447+00:00", 
    "title": "Instance creation fails with SSL, keystone v3", 
    "comments": [
        {
            "content": "We can create volumes, networks, etc in an Ocata deployment using SSL, but launching an instance fails with the following error in horizon: https://pastebin.canonical.com/189552/ and an associated error in nova-cloud-controller's apache2 nova-placement error log: https://pastebin.canonical.com/189547/\n\nThis seems to be a communication issue between the nova scheduler and the nova placement api.\n\nSteps to remedy taken so far:\n- Clearing the rabbitmq queue\n- Bouncing the rabbitmq services\n- Bouncing the apache2 services on nova-c-c and keystone", 
            "date_created": "2017-05-30 21:02:05.700447+00:00", 
            "author": "https://api.launchpad.net/1.0/~mskalka"
        }, 
        {
            "content": "Ryan,\nPlease let us know what information is needed as this bug is set to incomplete.\n\nMichael,\nThanks for the bug report. Going forward please use https://paste.ubuntu.com/ and if necessary sanitize any sensitive data.\n\n-thanks,\nAntonio", 
            "date_created": "2017-05-31 03:01:57.820656+00:00", 
            "author": "https://api.launchpad.net/1.0/~arosales"
        }, 
        {
            "content": "The error appears to be from the nova placement API, with an SSL error communicating with keystone:\n\nSSLError: SSL exception connecting to https://keystone-ch2-g.xx.xx.yy:5000/v3/auth/tokens: (\"bad handshake: SysCallError(-1, 'Unexpected EOF')\",)\n", 
            "date_created": "2017-05-31 14:36:47.675542+00:00", 
            "author": "https://api.launchpad.net/1.0/~james-page"
        }, 
        {
            "content": "Agree @jamespage.  I believe there is more than one modified charm in play in the model, related to other SSL and/or ksv3 issues.\n\nWhat we're looking for is sanitized charm config options for nova-cloud-controller, nova-compute;  sanitized juju status;  what versions of the charms are deployed;  and any custom modifications or workarounds made to the charms or the units.", 
            "date_created": "2017-05-31 14:49:00.436847+00:00", 
            "author": "https://api.launchpad.net/1.0/~1chb1n"
        }, 
        {
            "content": "Keystone:\n    V: 11.0.1.dev17\n    Config: http://paste.ubuntu.com/24727238/\n\nNova-CC:\n    V: 15.0.2\n    Config: http://paste.ubuntu.com/24727258/\n\nNova-compute-KVM:\n    V: 15.0.2\n    Config: http://paste.ubuntu.com/24727260/\n\nJuju status pending retrieval and cleanup", 
            "date_created": "2017-05-31 15:18:44.595591+00:00", 
            "author": "https://api.launchpad.net/1.0/~mskalka"
        }, 
        {
            "content": "The root cause for this is HAProxy timing out and terminating the TCP session. The hint in the error was the EOF:\n\nSSLError: SSL exception connecting to https://keystone-<CUSTOMER_DOMAIN>.net:5000/v3/auth/tokens: (\"bad handshake: SysCallError(-1, 'Unexpected EOF')\",)\n                                                                                                                                                                                                                                                                                                       Bumping up the haproxy-*-timeout values for the API charms resolved the issue for CLI driven instance create commands.\n                                                \nThere is still some question if instance creation via horizon has a remaining bug or timeout.\n                                              \nI am marking the nova-compute and nova-cloud-controller projects as invalid for this bug. If a horizon bug still remains we can add the openstack-dashboard project to this bug. ", 
            "date_created": "2017-05-31 21:16:42.498681+00:00", 
            "author": "https://api.launchpad.net/1.0/~thedac"
        }
    ]
}