{
    "status": "Invalid", 
    "last_updated": "2010-10-25 23:17:32.332249+00:00", 
    "description": "These were comments that vish sent me, but I'm pasting them as a bug for open discussion:\n\nI pushed a fix called mac-fix that stops persistent rules from being set by udev.  Probably will make that remove-udev rules param in your raw-disk-images obsolete.\n\nAlso, I hacked in the network injection really quickly.  I think the inject code should take an arbitrary list of dictionaries representing the file location, owner and group, and data.  Then you could pass whatever is needed in without adding to the list of parameters\n\nLastly, the logic for booting without kernel if it isn't specified may need to be changed.  We may need a flag to allow booting without specifying a kernel, perhaps global and/or per-image in the image store.\n", 
    "tags": [], 
    "importance": "Undecided", 
    "heat": 10, 
    "link": "https://bugs.launchpad.net/nova/+bug/609312", 
    "owner": "None", 
    "id": 609312, 
    "index": 1901, 
    "created": "2010-07-23 21:23:26.923259+00:00", 
    "title": "Comments on raw-disk-image branch", 
    "comments": [
        {
            "content": "These were comments that vish sent me, but I'm pasting them as a bug for open discussion:\n\nI pushed a fix called mac-fix that stops persistent rules from being set by udev.  Probably will make that remove-udev rules param in your raw-disk-images obsolete.\n\nAlso, I hacked in the network injection really quickly.  I think the inject code should take an arbitrary list of dictionaries representing the file location, owner and group, and data.  Then you could pass whatever is needed in without adding to the list of parameters\n\nLastly, the logic for booting without kernel if it isn't specified may need to be changed.  We may need a flag to allow booting without specifying a kernel, perhaps global and/or per-image in the image store.\n\nSide note: I reworked volume code in the twisted-volume patch, so when that hits you may have to modify your iscsi patch a bit.", 
            "date_created": "2010-07-23 21:23:26.923259+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "mac-fix makes remove-udev unnecessary:\n\nThanks... I think the remove-udev rules bit was probably more because I made a mistake bundling the image (leaving the old rules file), and found it much easier to fix this way.  I've been advised I should simply have deleted the network udev rule file as part of image construction.\n\nThis is therefore probably part of a much larger debate about what should be done in the image, and what by the 'launch VM' stage.  The launch VM stage is convenient for me right now, but it won't cope with other OSes or probably even other distros.\n\nOne possibility is to have a script that can fix common mistakes, that could be run just before image uploading.  This could even do really sneaky stuff, like figuring out the exact byte offsets to change so that we can inject data into filesystems that we don't really understand (e.g. Windows?)\n\nIf you agree, I might move some of my more questionable functionality into a new script.  For instance, I don't really think that module loading necessarily belongs in there; it's just me fixing up my own mistakes.  But others will make the same mistakes, so it does need to be easy.\n\n===\n\nFile injection into images is messy:\n\nI agree that I've probably pushed that function to its limits in terms of number of parameters :-)\n\nWhat isn't clear to me is whether this OS/distro-specific knowledge should be exposed beyond the disk injection function.  Maybe in an ideal world this mapping would be provided as part of the image upload.  Any auto-detection code is likely to get messy fast, so it makes sense to contain that mess in a single class / group of classes.\n \n===\n\nLastly, the logic for booting without kernel if it isn't specified may need to be changed.  We may need a flag to allow booting without specifying a kernel, perhaps global and/or per-image in the image store.\n\n\nYeah, this was just a hack so that I could get it to work with the euca- tools.  Any ideas on a better side-channel to use with the euca- tools (until we get our own)?  Right now it's not too bad... if you don't specify a kernel at either the image registration or the instance launching, it'll presume there's no kernel and so it's a whole disk image.\n\nIs there a \"requirements\" problem with the way I've done it, or is it just that it's a bit of a hack?\n", 
            "date_created": "2010-07-23 21:26:51.889800+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "I think we should move this into a blueprint.  Vish, Justin?", 
            "date_created": "2010-07-26 15:05:03.608248+00:00", 
            "author": "https://api.launchpad.net/1.0/~jaypipes"
        }, 
        {
            "content": "Done: https://blueprints.launchpad.net/nova/+spec/raw-disk-images\n\nShould the specification pages be wiki pages or etherpad pages?", 
            "date_created": "2010-07-26 17:04:04.742215+00:00", 
            "author": "https://api.launchpad.net/1.0/~justin-fathomdb"
        }, 
        {
            "content": "I think the discussion should be in etherpad.  The whiteboard on the\nblueprint pages isn't good enough.  We should link to the relevent etherpad,\nthen we can copy in to whiteboard when the discussion is complete.\n\nOn Mon, Jul 26, 2010 at 10:04 AM, justinsb <email address hidden>wrote:\n\n> Done: https://blueprints.launchpad.net/nova/+spec/raw-disk-images\n>\n> Should the specification pages be wiki pages or etherpad pages?\n>\n> --\n> Comments on raw-disk-image branch\n> https://bugs.launchpad.net/bugs/609312\n> You received this bug notification because you are a member of Nova\n> Bugs, which is subscribed to OpenStack Compute (nova).\n>\n> Status in OpenStack Compute (Nova): New\n>\n> Bug description:\n> These were comments that vish sent me, but I'm pasting them as a bug for\n> open discussion:\n>\n> I pushed a fix called mac-fix that stops persistent rules from being set by\n> udev.  Probably will make that remove-udev rules param in your\n> raw-disk-images obsolete.\n>\n> Also, I hacked in the network injection really quickly.  I think the inject\n> code should take an arbitrary list of dictionaries representing the file\n> location, owner and group, and data.  Then you could pass whatever is needed\n> in without adding to the list of parameters\n>\n> Lastly, the logic for booting without kernel if it isn't specified may need\n> to be changed.  We may need a flag to allow booting without specifying a\n> kernel, perhaps global and/or per-image in the image store.\n>\n>\n>\n>\n", 
            "date_created": "2010-07-26 17:18:10+00:00", 
            "author": "https://api.launchpad.net/1.0/~vishvananda"
        }, 
        {
            "content": "Agreed, discussion on Etherpad is perfect. Blueprint is for tracking progress on the task(s)", 
            "date_created": "2010-07-26 17:34:23.811872+00:00", 
            "author": "https://api.launchpad.net/1.0/~jaypipes"
        }, 
        {
            "content": "Now that it's been filed as a blueprint, would anyone mind if this bug was closed?", 
            "date_created": "2010-09-08 06:46:22.820597+00:00", 
            "author": "https://api.launchpad.net/1.0/~soren"
        }
    ]
}