{
    "status": "In Progress", 
    "last_updated": "2016-12-12 07:41:50.543009+00:00", 
    "description": "If you create an instance backup by passing rotation 0 to the backup api, nova creates an image and takes a snapshot of an instance and then deletes it immediately. Any malicious user can use this loophole by calling backup api for all instances belonging to his/her project causing consumption of glance and nova resources at the expense of service provider.\n\nSteps to reproduce:\n\n1. Create the instance\n\n$ nova boot --flavor <flavor_id> --image <image_id> <instance_name>\n\n2. Create the instance backup using the backup api by giving the rotation parameter value as 0\n\n$ nova backup <instance_id> <name> daily 0\n\n3. Check the glance image list\n\n$ glance image-list\n\nOutput:\nIn glance images you will not found backup image as it will be deleted immediately after creation.\n\nExpected result:\nIf user passes rotation 0, then nova shouldn’t create an image and take a snapshot of an instance and upload it to glance service or minimum value of rotation should be changed from 0 to 1.", 
    "tags": [], 
    "importance": "Wishlist", 
    "heat": 12, 
    "link": "https://bugs.launchpad.net/nova/+bug/1627597", 
    "owner": "https://api.launchpad.net/1.0/~bhagyashri-shewale", 
    "id": 1627597, 
    "index": 1828, 
    "created": "2016-09-26 05:54:36.809133+00:00", 
    "title": "Nova instance backup with rotation 0 creates backup and deletes it immediately", 
    "comments": [
        {
            "content": "If you create an instance backup by passing rotation 0 to the backup api, nova creates an image and takes a snapshot of an instance and then deletes it immediately. Any malicious user can use this loophole by calling backup api for all instances belonging to his/her project causing consumption of glance and nova resources at the expense of service provider.\n\nSteps to reproduce:\n\n1. Create the instance\n\n$ nova boot --flavor <flavor_id> --image <image_id> <instance_name>\n\n2. Create the instance backup using the backup api by giving the rotation parameter value as 0\n\n$ nova backup <instance_id> <name> daily 0\n\n3. Check the glance image list\n\n$ glance image-list\n\nOutput:\nIn glance images you will not found backup image as it will be deleted immediately after creation.\n\nExpected result:\nIf user passes rotation 0, then nova shouldn’t create an image and take a snapshot of an instance and upload it to glance service or minimum value of rotation should be changed from 0 to 1.", 
            "date_created": "2016-09-26 05:54:36.809133+00:00", 
            "author": "https://api.launchpad.net/1.0/~bhagyashri-shewale"
        }, 
        {
            "content": "Since this report concerns a possible security risk, an incomplete security advisory task has been added while the core security reviewers for the affected project or projects confirm the bug and discuss the scope of any vulnerability along with potential solutions.", 
            "date_created": "2016-09-26 06:12:26.015231+00:00", 
            "author": "https://api.launchpad.net/1.0/~mdrnstm"
        }, 
        {
            "content": "I'm not sure how much of a DoS threat this is compared to just writing a script on the client side that loops continually creating server snapshots and deleting the created image repeatedly.", 
            "date_created": "2016-09-26 18:47:38.341268+00:00", 
            "author": "https://api.launchpad.net/1.0/~mriedem"
        }, 
        {
            "content": "I agree, I am not convinced that this is anything more than a standard level of DOS that is doable with other API calls. As there is no API rate limiting built into OpenStack services any more, this is just something we leave for the operator to solve.", 
            "date_created": "2016-09-26 20:35:48.915784+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }, 
        {
            "content": "I've switched the security advisory to opinion state and subscribed the security team reviewers to see whether this falls into the scope of existing work taken on by the security note editors.", 
            "date_created": "2016-09-26 20:53:43.288880+00:00", 
            "author": "https://api.launchpad.net/1.0/~fungi"
        }, 
        {
            "content": "It is true that it's not a DOS attack and it won't bring any of the OpenStack services down (glance/nova). But any user can call backup instance passing rotation as 0 consuming CPU/memory/network/disk resources of glance and nova hosts at the expense of service provider. In this situation, user cannot be charged a cent for backing up instance even though it utilized valuable resources of service provider.\n", 
            "date_created": "2016-09-26 21:03:05.507113+00:00", 
            "author": "https://api.launchpad.net/1.0/~tpatil"
        }, 
        {
            "content": "An attacker bent on \"consuming CPU/memory/network/disk resources\" isn't going to care whether the (stolen) credit card they signed up with gets charged. A failure to be able to bill users for resources they consume, while possibly still a bug worth fixing, doesn't on its own constitute a security vulnerability.", 
            "date_created": "2016-09-26 21:16:38.067332+00:00", 
            "author": "https://api.launchpad.net/1.0/~fungi"
        }, 
        {
            "content": "I am not convinced this is a vulnerability, its a functional bug on a lack of input validation to filter out 0.", 
            "date_created": "2016-09-26 21:35:13.982394+00:00", 
            "author": "https://api.launchpad.net/1.0/~lhinds"
        }, 
        {
            "content": "Yeah, I agree, nothing here that isn't achievable with other API calls.", 
            "date_created": "2016-09-26 21:36:10.042370+00:00", 
            "author": "https://api.launchpad.net/1.0/~travis-mcpeak"
        }, 
        {
            "content": "Hi All,\n\nI want to propose 3 solution when rotation parameter is 0 while taking instance backup.  \n\nSolution 1: If user passed rotation 0 to create instance backup then avoid the backup image creation at api     side and delete all the previous backup images in api side itself. \n\nPros: 1. Solution 1 will require minimum changes in code and will not make call to the compute node.\n\nCons: 2. The drawback of this solution is, it might impact on the response time if there are too many backups for that instance.\n\nSolution 2: Avoid the backup image creation at api side and call the compute node by passing the image_id parameter as None and delete all the previous backup images at the compute node for the given instance.\n                                                \nCons : 1. This solution need maximum changes at several places.\n       2. Calling the compute node only for previous backup image deletion doesn't make any sense.\n                   \nSolution 3: Change the api-spec that rotation parameter value should be greater than 0.\n\nPros: 1. Minimal changes required\n\nCons: 1. User will need to delete the last backup image explicitly.\n\nTo get the backup images of the specific instance for the explicit deletion, user needs to find out by using the following command:\n\n$ glance image-list --property-filter <KEY=VALUE> \n\nFor example: $ glance image-list --property-filter instance_uuid=6d2b9b03-929e-4f9c-9977-05f3c2f3a47c\n\nI want to recommend solution 1 and 3 is better one out of the three solutions.\n\nPlease let me know your opinions about the same.\n", 
            "date_created": "2016-10-14 09:02:44.995415+00:00", 
            "author": "https://api.launchpad.net/1.0/~bhagyashri-shewale"
        }, 
        {
            "content": "My vote is Option 3.  Making '0' rotations magic and deleting stuff is overreach IMO.\n\nI feel like to can switch this to OSSN, and make it public.  We can then work this in the open.", 
            "date_created": "2016-10-16 21:26:55.886717+00:00", 
            "author": "https://api.launchpad.net/1.0/~o-tony"
        }, 
        {
            "content": "Please refer attached patch which resolves this issue.\n", 
            "date_created": "2016-10-18 10:16:44.949118+00:00", 
            "author": "https://api.launchpad.net/1.0/~bhagyashri-shewale"
        }, 
        {
            "content": "I agree, make this public so that this can just go into gerrit.\n\nIt's still a super minor issue. ", 
            "date_created": "2016-12-09 13:43:21.565077+00:00", 
            "author": "https://api.launchpad.net/1.0/~sdague"
        }, 
        {
            "content": "Consensus seems to be that this discussion does not need to continue under embargo. I'm treating it as a class D (potential security hardening opportunity) report, in case the Nova developers are willing to consider accepting a patch to implement some additional validation on the rotation field to reject 0. https://security.openstack.org/vmt-process.html#incident-report-taxonomy", 
            "date_created": "2016-12-09 14:03:00.404629+00:00", 
            "author": "https://api.launchpad.net/1.0/~fungi"
        }, 
        {
            "content": "Fix proposed to branch: master\nReview: https://review.openstack.org/409644", 
            "date_created": "2016-12-12 07:41:49.943946+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }
    ]
}