{
    "status": "Won't Fix", 
    "last_updated": "2013-07-18 17:04:15.569940+00:00", 
    "description": "Currently when the xenapi agent is used to inject the ssh keys, the host keys are not regenerated.\n\nWhile this should be done by the agent, when a snapshot is taken, the keys are already present, and so are not regenerated.\n\nA workaround for users is to delete the keys before taking the snapshot.\n\nHowever we could get nova to generate and inject host keys, but this might be overkill.\n\nSteps to Recreate:\n1. Take an image of an existing server.\n2. Build a new server from that image\nVerify the host keys are same on the new server.", 
    "tags": [
        "xenserver"
    ], 
    "importance": "Low", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1189838", 
    "owner": "None", 
    "id": 1189838, 
    "index": 5784, 
    "created": "2013-06-11 10:07:50.250205+00:00", 
    "title": "xenapi: when agent injects ssh key, host keys should also be regenerated", 
    "comments": [
        {
            "content": "Host keys in /etc/ssh/ are not getting regenerated when a server is built from an image. The ssh host keys are the same as the keys of the server from which the image was taken.\n\nSteps to Recreate: \n1. Take an image of an existing server. \n2. Build a new server from that image\nVerify the host keys are same on the new server.", 
            "date_created": "2013-06-11 10:07:50.250205+00:00", 
            "author": "https://api.launchpad.net/1.0/~aarti-kriplani"
        }, 
        {
            "content": "Approach: we could make the agent do it using file injection", 
            "date_created": "2013-06-11 10:09:21.777674+00:00", 
            "author": "https://api.launchpad.net/1.0/~aarti-kriplani"
        }, 
        {
            "content": "This problem is outside of the scope of nova.  I *really* don't think nova should be in the business of trying to fix this.  Feel free to bring it up on openstack-dev if you'd like to discuss further.", 
            "date_created": "2013-06-12 14:04:38.243856+00:00", 
            "author": "https://api.launchpad.net/1.0/~russellb"
        }, 
        {
            "content": "OK, this is quite an edge case, and as Russell says, maybe shouldn't be in nova.\n\nBut I have reworded things to make it a little clearer.", 
            "date_created": "2013-06-13 12:48:59.547272+00:00", 
            "author": "https://api.launchpad.net/1.0/~johngarbutt"
        }, 
        {
            "content": "The bug report issue is not really accurate.  The title should really say:\n\nnew ssh host keys should be regenerated when building from snapshot (or technically even first build of any image -- but your base images should really account for this).\n\nThe problem with building from snapshot is... the instance is NO IDEA to know whether it should re-generate host keys because it's the first boot of a new image.\n\nNova has to tell it somehow.  Either on/before boot...  or by wiping keys out of the snapshot.\n\nI think?", 
            "date_created": "2013-06-13 21:19:57.132059+00:00", 
            "author": "https://api.launchpad.net/1.0/~cbehrens"
        }, 
        {
            "content": "After thinking more... I guess it's maybe just an end-user problem?  If you build from a snap, there's probably a number of things you need to 'clean out'.  Making sure to re-gen ssh host keys could be included in that list.", 
            "date_created": "2013-06-13 21:24:07.578025+00:00", 
            "author": "https://api.launchpad.net/1.0/~cbehrens"
        }, 
        {
            "content": "Yep, this is either a nova agent issue, or a end-user issue.\n\nEither way, its not a Nova bug.", 
            "date_created": "2013-07-18 17:03:55.757600+00:00", 
            "author": "https://api.launchpad.net/1.0/~johngarbutt"
        }
    ]
}