{
    "status": "In Progress", 
    "last_updated": "2017-08-01 10:04:07.138871+00:00", 
    "description": "Almost all of the async operations would update the task state, but the confirm_resize does not.\n\nNot setting the task state causes problems for any applications that poll based on task state:\nThis would cause some trouble in Horizon such as: our timer in the browser updates the instances based on the task state until it becomes none, if the task state is none(all tasks are completed), we believe the status of an instance is stable, and there is no need to refresh the instance. But at the beginning of the confirm_resize, we did not update the task status, and the task state is still none, so it cause we cannot know when it's completed unless we poll all of the instances of any state.\n\nMoreover it should be at least consistent with the revert_resize,and the state RESIZE_CONFIRMING has been defined but not used.", 
    "tags": [], 
    "importance": "Undecided", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1515476", 
    "owner": "https://api.launchpad.net/1.0/~javaloveme", 
    "id": 1515476, 
    "index": 5840, 
    "created": "2015-11-12 04:07:53.607950+00:00", 
    "title": "Lack of task status updates at the beginning of the action 'confirm_resize'", 
    "comments": [
        {
            "content": "Almost all of the async operations will update the task state, but the confirm_resize does not.\n\nThat would cause some trouble: our timer in the browser updates the instances based on the task state until it becomes none,\nif the task state is none(any task is completed), we believe the status of an instance is stable, and there is no need to refresh the instance. But at the beginning of the confirm_resize, we did not update the task status, and the task state is still none,\nso it cause we cannot know when it's completed unless we poll all of the instances of any state.\n\nMoreover it should be at least consistent with the revert_resize,and the state RESIZE_CONFIRMING has been defined but not used.", 
            "date_created": "2015-11-12 04:07:53.607950+00:00", 
            "author": "https://api.launchpad.net/1.0/~javaloveme"
        }, 
        {
            "content": "Fix proposed to branch: master\nReview: https://review.openstack.org/244433", 
            "date_created": "2015-11-12 04:21:45.148714+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }, 
        {
            "content": "Change abandoned by Sean Dague (<email address hidden>) on branch: master\nReview: https://review.openstack.org/244433\nReason: This review is > 4 weeks without comment, and is not mergable in it's current state. We are abandoning this for now. Feel free to reactivate the review by pressing the restore button and leaving a 'recheck' comment to get fresh test results.", 
            "date_created": "2017-08-01 10:04:06.490885+00:00", 
            "author": "https://api.launchpad.net/1.0/~hudson-openstack"
        }
    ]
}