{
    "status": "Invalid", 
    "last_updated": "2017-06-29 22:54:36.371332+00:00", 
    "description": "Spam description removed", 
    "tags": [], 
    "importance": "Undecided", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/1701368", 
    "owner": "None", 
    "id": 1701368, 
    "index": 6925, 
    "created": "2017-06-29 21:15:58.414175+00:00", 
    "title": "Spam title removed", 
    "comments": [
        {
            "content": " Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\n Quatero*1-800 919 0992 quickbooks tech phone number\nuickbℴℴks nical support contact number, Intuit Quickbℴℴks support phone number, Intuit Quickbℴℴks Enterprise support phone number. Intuit Quickbℴℴks Enterprise customer support phoneIntuit Quickbℴℴks Toll Free, Intuit@(+1.8oo.919.o992)@-: Intuit Quickbℴℴks Support Phone Number provides helpline solution for all USA/CANADA clients. For any help of query call 1 8oo to get all Intuit Quickbℴℴks account solution. @@Call, +1.8oo.919.o992for all type help by Intuit Quickbℴℴks support phone number, Intuit Quickbℴℴks Support Phone Number, Intuit Quickbℴℴks Help Desk Phone Number, Intuit Quickbℴℴks support number, Intuit Quickbℴℴks nical support phone number,@@@ Intuit Quickbℴℴks phone number, Intuit Quickbℴℴks nical support number, Intuit Quickbℴℴks support phone number, Intuit Quickbℴℴks nical support, Intuit Quickbℴℴks Customer Service Phone Number, Intuit Quickbℴℴks Customer Service Number, Intuit Quickbℴℴks Customer Support Phone Number, Intuit Quickbℴℴks Customer Support Number,helpline Intuit Quickbℴℴks Customer Service Helpline Number, Intuit Quickbℴℴks Customer Care Number, Intuit Quickbℴℴks support team phone number, helpline Intuit Quickbℴℴks help number-Intuit Quickbℴℴks Helpline Number; Intuit Quickbℴℴks help phone number-Intuit Quickbℴℴks Helpline Number, Intuit Quickbℴℴks SupportToll free Number, Intuit Quickbℴℴks Support Telephone Number, Intuit Quickbℴℴks Support Telephone number, Intuit Quickbℴℴks Support contact number, Intuit Quickbℴℴks support contact number, Intuit Quickbℴℴks nical support contact number. Call, Intuit Quickbℴℴks support phone number, Intuit Quickbℴℴks Support Phone Number, Intuit Quickbℴℴks Help Desk Phone Number, Intuit Quickbℴℴks support number, Intuit Quickbℴℴks nical support phone number, Intuit Quickbℴℴks phone number, Intuit Quickbℴℴks nical support number, Intuit Quickbℴℴks support phone number. It is very popular toll free number which provide by Intuit Quickbℴℴks nical support, Intuit Quickbℴℴks Customer Service Phone Number, Quickbooks support phone number Quickbooks support phone number Quickbooks support phone number Quickbooks support phone number Quickbooks support phone number Quickbooks support phone number Quickbooks support phone number Quickbooks support phone number Quickbooks support phone number", 
            "date_created": "2017-06-29 21:15:58.414175+00:00", 
            "author": ""
        }
    ]
}