{
    "status": "Fix Released", 
    "last_updated": "2013-04-08 11:10:14.746751+00:00", 
    "description": "If no nova-network service is available, the Access and Security page never loads and just hangs forever.  This is primarily an issue with nova hanging forever when attempting to fetch information about floating ip addresses.", 
    "tags": [], 
    "importance": "Low", 
    "heat": 38, 
    "link": "https://bugs.launchpad.net/nova/+bug/961761", 
    "owner": "None", 
    "id": 961761, 
    "index": 5387, 
    "created": "2012-03-21 23:13:35.416923+00:00", 
    "title": "If nova-network is down, Access and Security panel hangs", 
    "comments": [
        {
            "content": "If no nova-network service is available, the Access and Security page never loads and just hangs forever.  This is primarily an issue with nova hanging forever when attempting to fetch information about floating ip addresses.", 
            "date_created": "2012-03-21 23:13:35.416923+00:00", 
            "author": "https://api.launchpad.net/1.0/~devcamcar"
        }, 
        {
            "content": "It doesn't actually hang forever - it hangs for 60 seconds by default, as defined by FLAGS.rpc_response_timeout.  So after 60 seconds this happens:\n\nhttp://stsh.me/1Rh\n\nThough until recently, the timeout was actually set to an hour: https://bugs.launchpad.net/nova/+bug/938287\n\nGranted, 60 seconds may well be forever for some dash users :/\n", 
            "date_created": "2012-03-22 03:13:21.554477+00:00", 
            "author": "https://api.launchpad.net/1.0/~sleepsonthefloor"
        }, 
        {
            "content": "related bug, i'd say it's a duplicate \nhttps://bugs.launchpad.net/horizon/+bug/946337", 
            "date_created": "2012-03-22 07:54:46.016749+00:00", 
            "author": "https://api.launchpad.net/1.0/~andycjw"
        }, 
        {
            "content": "It's been a while and I need to re-read the floating ip code, but at first though I am confused why it needs to RPC just to get a list of floating ips?", 
            "date_created": "2012-03-22 21:45:03.484515+00:00", 
            "author": "https://api.launchpad.net/1.0/~devcamcar"
        }, 
        {
            "content": "May not be solvable in rc2 framework but it's worth investigating.", 
            "date_created": "2012-03-22 21:58:14.923879+00:00", 
            "author": "https://api.launchpad.net/1.0/~devcamcar"
        }, 
        {
            "content": "One option would be to only load the floating ips asynchronously once the page has loaded.  It would still timeout based on the RPC timeout but it wouldn't prevent the entire page from coming up.", 
            "date_created": "2012-03-22 22:14:44.865440+00:00", 
            "author": "https://api.launchpad.net/1.0/~devcamcar"
        }, 
        {
            "content": "As far as nova is concerned, there is absolutely 0 value in treating get_floating_ips as an RPC.  What it does now is:\n\n* make RPC call to nova-network 'get_floating_pools'\n* nova-network then picks up the RPC request and grabs the floating IPs from the database\n* nova-network then drops results into RPC response\n\nWhy go through all this trouble and not just have nova-api hit the database and skip the overhead of doing an RPC here?  Aside from being more efficient, it greatly improves the user experience for anyone trying to list floating IPs either with Horizon, novaclient or nova-manage.", 
            "date_created": "2012-03-22 22:18:29.235985+00:00", 
            "author": "https://api.launchpad.net/1.0/~devcamcar"
        }, 
        {
            "content": "I'm bumping this out of RC2... doing async loading for a single table is a very dangerous feature to shove in this late in the game. Especially since the real fix for this particular bug is upstream in nova. Doing async loading everywhere is a feature for Folsom.\r\n\r\nIt *is* unfortunate that the timeout in nova is so high, though. 60 seconds is a horribly long time to wait. Timeouts in other services are lower, but can still cause delays of 10-30 seconds before a failed request allows the page to load. Unfortunately I'd say it's just an implicit part of Horizon's interaction model for Essex.\r\n\r\nIf Devin feels this is important enough to still be a blocker for RC2/Essex final then he can bump it back in and ordain a solution :-)", 
            "date_created": "2012-03-27 22:46:37.673100+00:00", 
            "author": "https://api.launchpad.net/1.0/~gabriel-hurley"
        }, 
        {
            "content": "It does look like the use of rpc in this case is unnecessary.  All it's doing is getting the list out of the db on the other end.", 
            "date_created": "2012-06-07 17:47:28.028728+00:00", 
            "author": "https://api.launchpad.net/1.0/~russellb"
        }, 
        {
            "content": "Looks like this was fixed in the following commit:\n\ncommit 45e92d47038514fc05ae17a8a38dae1b337c15fe\nAuthor: Vishvananda Ishaya <email address hidden>\nDate:   Thu Jan 17 12:42:24 2013 -0800\n\n    Optimize network calls by moving them to api\n    \n    Now that quantumv2 replaces api, there is no need for many of the\n    network calls to go over rpc. This patch optimizes them by moving\n    the implementation into the api class. Note that the old methods\n    are left in place to keep rpcapi compatibility.\n    \n    This patch also adds api_deprecated in case anyone is using a\n    custom out-of-tree manager class. It is possible to set:\n    \n    network_api_class=nova.network.api_deprecated.API\n    \n    to get the old functionality.\n    \n    Part of blueprint optimize-nova-network\n    \n    Change-Id: I130908df060246e8a5f3711cf16d1c49ee3e2664\n", 
            "date_created": "2013-02-25 04:37:42.852888+00:00", 
            "author": "https://api.launchpad.net/1.0/~kspear"
        }
    ]
}