{
    "status": "Won't Fix", 
    "last_updated": "2011-03-16 10:43:59.059218+00:00", 
    "description": "There are a lot of exec calls to binaries like sudo without an absolute path (just sudo). I don't like this and I think it's better to use the absolute path of external binaries. I think this could be a security issue.", 
    "tags": [], 
    "importance": "Undecided", 
    "heat": 6, 
    "link": "https://bugs.launchpad.net/nova/+bug/714561", 
    "owner": "None", 
    "id": 714561, 
    "index": 2023, 
    "created": "2011-02-07 13:06:47.809396+00:00", 
    "title": "use absolute paths while calling external binaries", 
    "comments": [
        {
            "content": "There are a lot of exec calls to binaries like sudo without an absolute path (just sudo). I don't like this and I think it's better to use the absolute path of external binaries. I think this could be a security issue.", 
            "date_created": "2011-02-07 13:06:47.809396+00:00", 
            "author": "https://api.launchpad.net/1.0/~berendt"
        }, 
        {
            "content": "This is generally used with a sudoers file that lists absolute paths, so the security risk is rather limited. This setup allows to avoid hardcoding absolute paths for tools in Nova, which makes it a bit more distro-agnostic (since the sudoers file is provided by distro packaging).\r\n\r\nI'm not a fan of the sudoers setup but I don't think adding absolute paths to calls would be the right way of solving it. See bug 681774 for another way.", 
            "date_created": "2011-02-08 20:30:37.276444+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }, 
        {
            "content": "Closing as wontfix since the current model assumes you run under the nova user with a sudoers file that matches where the utilities are installed on your system. Specifying full path in code would make code fail on platforms that use slightly different locations for utilities.\r\n\r\nPlease set back to New if you disagree :)", 
            "date_created": "2011-03-16 10:43:55.659377+00:00", 
            "author": "https://api.launchpad.net/1.0/~ttx"
        }
    ]
}