{
    "status": "Won't Fix", 
    "last_updated": "2014-08-22 05:12:59.114830+00:00", 
    "description": "Right now, nova-volumes does not allow volumes to be deleted that have snapshots attached. Some backends may support this so it should be configurable by the administrator whether to allow volumes with snapshots to be deleted.", 
    "tags": [], 
    "importance": "Low", 
    "heat": 16, 
    "link": "https://bugs.launchpad.net/nova/+bug/970409", 
    "owner": "None", 
    "id": 970409, 
    "index": 5405, 
    "created": "2012-03-31 21:56:37.302017+00:00", 
    "title": "Deleting volumes with snapshots should be allowed for some backends", 
    "comments": [
        {
            "content": "Right now, nova-volumes does not allow volumes to be deleted that have snapshots attached. Some backends may support this so it should be configurable by the administrator whether to allow volumes with snapshots to be deleted.", 
            "date_created": "2012-03-31 21:56:37.302017+00:00", 
            "author": "https://api.launchpad.net/1.0/~vishvananda"
        }, 
        {
            "content": "Can't this be handled implicitly by the driver for those back-ends that support it?  For example the base LVM driver currently will raise VolumeIsBusy if a snapshot exists.  Other drivers could simply choose to check/not-check depending on what they support?\n\nIf there's some other reason that admins may want to have this behavior configurable (independent of backend device's support) then we can add the flag.", 
            "date_created": "2012-07-10 17:03:18.917348+00:00", 
            "author": "https://api.launchpad.net/1.0/~john-griffith"
        }, 
        {
            "content": "Bug #1023768 may not truly be a duplicate of this issue.\n\nLet's see if I can summarise my understanding of things:\n\nThis bug appears to be about making it a configurable option as to whether it is permitted to attempt to delete a volume that has associated snapshots.\nAnd the subsequent discussion here seems to suggest that it is not necessarily needed as a configurable but instead should be left to the underlying back ends to gracefully decline the deletion of a volume if they don't support doing so when there are associated snapshots\n\nOne the other hand bug #1023768 appears to be about whether it is possible for a snapshot to exist independently of the volume it originates from, and as things stand that doesn't appear to be possible because some of the information needed to access a snapshot exists only in the originating volume's entry in the volumes table.\n\nFergal.", 
            "date_created": "2012-07-13 13:06:08.861387+00:00", 
            "author": "https://api.launchpad.net/1.0/~fergal-mccarthy"
        }, 
        {
            "content": "So really bug #1023768 isn't a bug but more of a question and this explains the answer and how it may change IMO.  I'll change it from duplicate back to invalid or question and reference this bug in the comments instead of directly linking them together.", 
            "date_created": "2012-07-13 14:33:17.345345+00:00", 
            "author": "https://api.launchpad.net/1.0/~john-griffith"
        }, 
        {
            "content": "Another Grizzly topic", 
            "date_created": "2012-09-04 18:06:53.813506+00:00", 
            "author": "https://api.launchpad.net/1.0/~john-griffith"
        }, 
        {
            "content": "My feeling is that behavior should be consistent regardless of which driver is being used.  I would rather add this check higher up, outside the driver, and maybe add a \"force\" flag to the Cinder API to cover this case.\nThis seems like one case of a more general \"problem\"; the API seems to be at the lowest common denominator of the back-end drivers and some back-ends support other features.  For example, should the API differentiate between space-efficient snapshots and full copies?", 
            "date_created": "2012-10-22 06:09:23.636081+00:00", 
            "author": "https://api.launchpad.net/1.0/~avishay-il"
        }, 
        {
            "content": "Deferring this to G3, what I'd like to do is get \"report capabilities\" implemented and then use that for the manager to determine whether or not to issue the request just as we do currently.  The other option is to do some special handling and move the checks further down in to the drivers but this seems like it will be an ideal case for the capabilities changes.", 
            "date_created": "2013-01-03 04:40:37.628214+00:00", 
            "author": "https://api.launchpad.net/1.0/~john-griffith"
        }, 
        {
            "content": "nova volumes does not exist anymore", 
            "date_created": "2014-08-22 05:12:49.978368+00:00", 
            "author": "https://api.launchpad.net/1.0/~jogo"
        }
    ]
}